pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// bl602_demo_at_text_0002.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 23020672: Register word32 wpa_MD5Init(Register (ptr32 Eq_92191) a0)
// Called from:
//      Bl_hmac_md5
word32 wpa_MD5Init(struct Eq_92191 * a0)
{
	*(struct Eq_92191 **) 0x67452301 = a0;
	*(struct Eq_92191 **) 4023233421 = a0;
	*(struct Eq_92191 **) 0x98BADD06 = a0;
	a0->dw0014 = 0x00;
	a0->dw0010 = 0x00;
	*(struct Eq_92191 **) 271733890 = a0;
	return 271733878;
}

// 230206A4: Register word32 wpa_MD5Update(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_92179) a5, Stack word32 dwArg1C, Stack Eq_2 dwArg48, Stack int32 dwArg98, Stack word32 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      Bl_hmac_md5
//      wpa_MD5Final
word32 wpa_MD5Update(Eq_2 ra, Eq_2 a1, Eq_2 a2, struct Eq_92179 * a5, word32 dwArg1C, Eq_2 dwArg48, int32 dwArg98, word32 dwArg0128, union Eq_2 & s1Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	struct Eq_93859 * a5_22 = a5 + (a2 << 0x03) / 20;
	a5_22->dw0010 = a5->dw0010;
	Eq_2 s3_135 = a1;
	Eq_2 s2_134 = a2;
	int32 a0_151 = a5 >> 0x03 & 63;
	if (a5_22 < a2 << 0x03)
		a5_22->dw0015 = a5_22->dw0014;
	Eq_2 s1_150;
	struct Eq_92778 * s0_116 = ((Eq_582647[]) 20)[a2].ptr0000.dw0000;
	(word32) (a2 >> 0x1D) + (a2 << 0x03) + 20 = s0_116;
	Eq_2 s1_40 = 64 - a0_151;
	if (a2 >= s1_40)
	{
		word32 a1_257;
		word32 a2_258;
		word32 a3_259;
		word32 a4_260;
		word32 a5_261;
		word32 a6_262;
		word32 a7_263;
		memcpy(s0_116 + (a0_151 + 88) / 36, a1, s1_40, out a1_257, out a2_258, out a3_259, out a4_260, out a5_261, out a6_262, out a7_263);
		word32 s4_264;
		Eq_2 ra_118 = wpa_MD5Transform(ra, s0_116, s1_40, s0_116, (char *) &s0_116->t0020 + 56, dwArg1C, dwArg98, dwArg0128, out s0_116, out s1_150, out s2_134, out s3_135, out s4_264);
		Eq_2 s4_100 = &s0_116->dw000C + 3;
		while (true)
		{
			word32 a1_97 = s3_135 + s1_150;
			if ((byte) s1_150.u0 + 63 >= s2_134)
				break;
			word32 a1_265;
			word32 a2_266;
			word32 a3_267;
			word32 a4_268;
			word32 a5_269;
			word32 a6_270;
			word32 a7_271;
			memcpy(s4_100, a1_97, 64, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a6_270, out a7_271);
			word32 s1_131;
			ra_118 = wpa_MD5Transform(ra_118, s0_116, s1_150, s0_116, s4_100, dwArg1C, dwArg98, dwArg0128, out s0_116, out s1_131, out s2_134, out s3_135, out s4_100);
			s1_150 = s1_131 + 64;
		}
		a0_151 = 0x00;
	}
	else
		s1_150.u0 = 0x00;
	Eq_2 a0_155 = s0_116 + (a0_151 + 88) / 36;
	word32 a1_161 = s3_135 + s1_150;
	ptr32 a5_169;
	word32 a1_272;
	word32 a2_273;
	word32 a3_274;
	word32 a4_275;
	word32 a6_276;
	word32 a7_277;
	memcpy(a0_155, a1_161, dwArg48, out a1_272, out a2_273, out a3_274, out a4_275, out a5_169, out a6_276, out a7_277);
	s1Out = s1_150;
	a5Out = a5_169;
	s2Out = s2_134;
	s3Out = s3_135;
	s4Out = dwArg04;
	return s1;
}

// 2302074E: Register Eq_2 wpa_MD5Final(Register Eq_2 ra, Register Eq_2 a1, Stack Eq_2 dwArg28, Stack int32 dwArg78, Stack word32 dwArg0108, Register out Eq_2 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      Bl_hmac_md5
Eq_2 wpa_MD5Final(Eq_2 ra, Eq_2 a1, Eq_2 dwArg28, int32 dwArg78, word32 dwArg0108, union Eq_2 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	struct Eq_92179 * a5_34;
	uint32 a2_21;
	word32 a5_144;
	word32 a4_143;
	word32 a3_142;
	word32 a1_141;
	word32 a6_145;
	word32 a7_146;
	memcpy(fp + ~0x17, (word32) a1 + 16, 0x08, out a1_141, out a2_21, out a3_142, out a4_143, out a5_144, out a6_145, out a7_146);
	Eq_94016 a2_33 = a2_21 >> 3 & 63;
	if (a2_33 <= 55)
		a5_34 = (struct Eq_92179 *) 56;
	else
		a5_34 = (struct Eq_92179 *) 0x0078;
	struct Eq_92179 * a5_51;
	word32 s1_147;
	word32 s2_148;
	word32 s3_149;
	word32 s4_150;
	wpa_MD5Update(ra, 0x230AEB00, a5_34 - a2_33, a5_34, dwLoc04, dwArg28, dwArg78, dwArg0108, out s1_147, out a5_51, out s2_148, out s3_149, out s4_150);
	Eq_2 s1_78;
	ptr32 s2_79;
	ptr32 s3_80;
	word32 a5_151;
	word32 s4_152;
	Eq_2 s0_77 = wpa_MD5Update(ra, fp + ~0x17, 0x08, a5_51, dwLoc04, dwArg28, dwArg78, dwArg0108, out s1_78, out a5_151, out s2_79, out s3_80, out s4_152);
	word32 a1_153;
	word32 a2_154;
	word32 a3_155;
	word32 a4_156;
	word32 a5_157;
	word32 a6_158;
	word32 a7_159;
	memcpy(s1_78, s0_77, 0x10, out a1_153, out a2_154, out a3_155, out a4_156, out a5_157, out a6_158, out a7_159);
	word32 t1_160;
	word32 a0_161;
	word32 a1_162;
	word32 a2_163;
	word32 a3_164;
	word32 a4_165;
	word32 a5_166;
	Eq_2 ra_114 = memset(ra, s0_77, 0x00, 0x0098, out t1_160, out a0_161, out a1_162, out a2_163, out a3_164, out a4_165, out a5_166);
	s1Out = s1_78;
	s2Out = s2_79;
	s3Out = s3_80;
	return ra_114;
}

// 230207BA: Register ptr32 rijndaelKeySetupEnc(Register ptr32 a0, Register Eq_2 a1, Register Eq_91877 a2, Register out Eq_2 a1Out)
// Called from:
//      rijndael_set_key
ptr32 rijndaelKeySetupEnc(ptr32 a0, Eq_2 a1, Eq_91877 a2, union Eq_2 & a1Out)
{
	*((word32) *a1 << 24 ^ (word32) (*((word32) a1 + 1)) << 16 ^ (word32) (*((word32) a1 + 3)) ^ (word32) (*((word32) a1 + 2)) << 8) = a0;
	((word32) *((word32) a1 + 4) << 24 ^ (word32) (*((word32) a1 + 5)) << 16 ^ (word32) (*((word32) a1 + 7)) ^ (word32) (*((word32) a1 + 6)) << 8)->ptr0004 = a0;
	((word32) *((word32) a1 + 8) << 24 ^ (word32) (*((word32) a1 + 9)) << 16 ^ (word32) (*((word32) a1 + 11)) ^ (word32) (*((word32) a1 + 0x0A)) << 8)->ptr0008 = a0;
	((word32) *((word32) a1 + 0x0C) << 24 ^ (word32) (*((word32) a1 + 0x0D)) << 16 ^ (word32) (*((word32) a1 + 0x0F)) ^ (word32) (*((word32) a1 + 0x0E)) << 8)->ptr000C = a0;
	struct Eq_94208 * a5_50 = (struct Eq_94208 *) 0x0080;
	if (a2 != 0x0080)
	{
		a1Out = a1;
		return 0x00;
	}
	else
	{
		do
		{
			ui32 a1_86 = (word32) (a2 >> 0x08 & 0x00FF)->b230B0C40;
			struct Eq_94225 * a5_88 = a5_50 ^ a1 ^ (word32) (a2 >> 0x18)->b230B0C40 ^ (word32) (a2 & 0x00FF)->b230B0C40 << 8 ^ (word32) (a2 >> 0x10 & 0x00FF)->b230B0C40 << 24 ^ a1_86 << 16;
			a5_88->dw0010 = ((Eq_582648[]) 4)[a1_86].dw0000;
			struct Eq_94263 * a5_91 = a5_88 ^ a1_86 << 16;
			word32 a0_92 = ((Eq_582649[]) 8)[a1_86].dw0000;
			a5_91->dw0014 = a0_92;
			struct Eq_94274 * a5_94 = a5_91 ^ a1_86 << 16;
			a5_94->dw0018 = a0_92;
			a5_50 = a5_94 ^ a2;
			a5_50->dw001C = a0_92;
			a1 = a1_86 << 16;
		} while (a0_92 != a0 + 144);
		a1Out = a1_86 << 16;
		return 0x0A;
	}
}

// 230208B8: Register word32 rijndael_set_key(Register Eq_2 a0, Register Eq_2 a1, Register Eq_91877 a2, Register (ptr32 Eq_91878) a3, Register out ptr32 s1Out, Register out (ptr32 Eq_91878) s2Out, Register out Eq_2 s3Out)
// Called from:
//      BL_AesEncrypt
//      BL_AesUnWrap
word32 rijndael_set_key(Eq_2 a0, Eq_2 a1, Eq_91877 a2, struct Eq_91878 * a3, ptr32 & s1Out, struct Eq_91878 & s2Out, union Eq_2 & s3Out)
{
	struct Eq_94289 * a1_235;
	struct Eq_94290 * a0_26 = rijndaelKeySetupEnc((word32) a0 + 8, a1, a2, out a1_235);
	a0_26->t0004 = a0;
	ptr32 s1_190 = (word32) a0 + 8;
	struct Eq_91878 * s2_25 = a3;
	if (a3 != null)
		*a0 = 0x00;
	else
	{
		*(union Eq_2 *) 0x01 = a0;
		if (a0_26 == null)
			a0_26 = rijndaelKeySetupEnc((word32) a0 + 8, a1, a2, out a1_235);
		struct Eq_94313 * a4_219 = (word32) a0 + 8;
		ui32 a2_48 = a0_26 << 0x02;
		while (true)
		{
			struct Eq_91878 * a3_53 = a2_48 - s2_25;
			if (s2_25 >= a3_53)
				break;
			word32 a5_58 = a1_235->dw0018;
			a1_235->dw0000 = a3_53->dw0000;
			a3_53->dw0018 = a5_58;
			struct Eq_94336 * a4_64 = a3_53->ptr0004;
			word32 a5_63 = a1_235->dw001C;
			a4_64->ptr1004 = a1_235;
			a3_53->dw001C = a5_63;
			word32 a5_68 = a1_235->dw0020;
			struct Eq_94354 * a3_69 = a4_64->ptr0008;
			a4_64->ptr1008 = a1_235;
			a3_69->dw0020 = a5_68;
			word32 a5_72 = a1_235->dw0024;
			struct Eq_94368 * a3_73 = a4_64->ptr000C;
			a4_64->ptr100C = a1_235;
			a3_73->dw0024 = a5_72;
			s2_25 = (struct Eq_91878 *) &s2_25->ptr0004;
			a4_219 = (struct Eq_94313 *) ((char *) &a4_64->ptr000C + 4);
		}
		struct Eq_94290 * t1_81 = (struct Eq_94290 *) 0x01;
		while (t1_81 < a0_26)
		{
			struct Eq_94385 * a4_126 = g_a230AF340[(word32) (a4_219 >> 8 & 0x00FF)->b230B0C40 * 0x04] ^ ((g_a230AEB40[(word32) (a4_219 >> 0x18)->b230B0C40 * 0x04] ^ g_a230AF740[(word32) (a4_219 & 0x00FF)->b230B0C40 * 0x04]) ^ g_a230AEF40[(word32) (a4_219 >> 0x10 & 0x00FF)->b230B0C40 * 0x04]);
			a4_126->dw0000 = a4_219->dw0000;
			struct Eq_94439 * a4_157 = g_a230AF340[(word32) (a4_126 >> 8 & 0x00FF)->b230B0C40 * 0x04] ^ ((g_a230AEB40[(word32) (a4_126 >> 0x18)->b230B0C40 * 0x04] ^ g_a230AF740[(word32) (a4_126 & 0x00FF)->b230B0C40 * 0x04]) ^ g_a230AEF40[(word32) (a4_126 >> 0x10 & 0x00FF)->b230B0C40 * 0x04]);
			a4_157->dw0004 = a4_126->dw0004;
			struct Eq_94493 * a4_188 = g_a230AF340[(word32) (a4_157 >> 8 & 0x00FF)->b230B0C40 * 0x04] ^ ((g_a230AEB40[(word32) (a4_157 >> 0x18)->b230B0C40 * 0x04] ^ g_a230AF740[(word32) (a4_157 & 0x00FF)->b230B0C40 * 0x04]) ^ g_a230AEF40[(word32) (a4_157 >> 0x10 & 0x00FF)->b230B0C40 * 0x04]);
			a4_188->dw0008 = a4_157->dw0008;
			s1_190 = a4_188->ptr000C;
			a4_219 = g_a230AF340[(word32) (a4_188 >> 8 & 0x00FF)->b230B0C40 * 0x04] ^ ((g_a230AEB40[(word32) (a4_188 >> 0x18)->b230B0C40 * 0x04] ^ g_a230AF740[(word32) (a4_188 & 0x00FF)->b230B0C40 * 0x04]) ^ g_a230AEF40[(word32) (a4_188 >> 0x10 & 0x00FF)->b230B0C40 * 0x04]);
			a4_219->ptr000C = s1_190;
			t1_81 = (struct Eq_94290 *) ((char *) t1_81 + 1);
		}
	}
	s1Out = s1_190;
	s2Out = s2_25;
	s3Out = a1;
	return s1;
}

