pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23020ADC: Register word32 rijndael_decrypt(Register (ptr32 Eq_92064) a1, Register (ptr32 Eq_92065) a2, Stack word32 dwArg3C, Stack (ptr32 Eq_92067) dwArgE4, Stack word32 dwArg0148, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 byte) s6Out, Register out (ptr32 byte) s9Out, Register out Eq_92075 s10Out)
// Called from:
//      BL_AesUnWrap
word32 rijndael_decrypt(struct Eq_92064 * a1, struct Eq_92065 * a2, word32 dwArg3C, struct Eq_92067 * dwArgE4, word32 dwArg0148, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out, byte & s5Out, byte & s6Out, byte & s9Out, union Eq_92075 & s10Out)
{
	ui32 a3_82 = (word32) a1->b000E;
	struct Eq_94611 * a0_356 = ((Eq_582666[]) 20)[a3_82].ptr0000;
	ui32 a5_39 = (word32) a1->b0002;
	ui32 a5_57 = (word32) a1->b0006;
	ui32 a5_72 = (word32) a1->b000A;
	int32 a6_86 = a0_356->dw0004;
	word32 a0_44 = ((Eq_582667[]) 8)[a5_39].dw0000;
	uint32 a4_341 = (word32) a1->b0000 << 24 ^ (word32) a1->b0001 << 16 ^ (word32) a1->b0003 ^ a5_39 << 8 ^ a5_39 << 8;
	uint32 t3_364 = (word32) a1->b0004 << 24 ^ (word32) a1->b0005 << 16 ^ (word32) a1->b0007 ^ a5_57 << 8 ^ a5_57 << 8;
	uint32 a7_119 = (word32) a1->b0008 << 24 ^ (word32) a1->b0009 << 16 ^ (word32) a1->b000B ^ a5_72 << 8 ^ a5_72 << 8;
	uint32 a5_110 = (word32) a1->b000C << 24 ^ (word32) a1->b000D << 16 ^ (word32) a1->b000F ^ a3_82 << 8 ^ a3_82 << 8;
	int32 s7_136 = a6_86 >> 0x01;
	while (true)
	{
		struct Eq_95134 * a3_101 = g_a230AF740[(t3_364 & 0x00FF) * 0x04];
		struct Eq_95074 * s0_105 = a3_101->ptr0010;
		uint32 a0_127 = a0_356 ^ a3_101 ^ a3_101 ^ (a5_110 >> 0x0E & 1020)->dw230AEF40 ^ (a7_119 >> 0x06 & 1020)->dw230AF340;
		s7_136 += ~0x00;
		uint32 a1_152 = g_a230AEB40[(t3_364 >> 0x18) * 0x04] ^ g_a230AF740[(a7_119 & 0x00FF) * 0x04] ^ s0_105->dw0014 ^ (a4_341 >> 0x0E & 1020)->dw230AEF40 ^ (a5_110 >> 0x06 & 1020)->dw230AF340;
		uint32 a3_188 = g_a230AEB40[(a7_119 >> 0x18) * 0x04] ^ g_a230AF740[(a5_110 & 0x00FF) * 0x04] ^ s0_105->dw0018 ^ (t3_364 >> 0x0E & 1020)->dw230AEF40 ^ (a4_341 >> 0x06 & 1020)->dw230AF340;
		uint32 a5_190 = g_a230AEB40[(a5_110 >> 24) * 0x04] ^ g_a230AF740[(a4_341 & 0x00FF) * 0x04] ^ s0_105->dw001C ^ (a7_119 >> 0x0E & 1020)->dw230AEF40 ^ (t3_364 >> 0x06 & 1020)->dw230AF340;
		int32 s10_203 = s0_105->dw0020;
		if (s7_136 == 0x00)
			break;
		a0_356 = g_a230AF740[(a0_127 & 0x00FF) * 0x04];
		word32 a3_370 = g_a230AEF40[(a3_188 >> 16 & 0x00FF) * 0x04];
		a4_341 = g_a230AEB40[(a0_127 >> 0x18) * 0x04] ^ g_a230AF740[(a1_152 & 0x00FF) * 0x04] ^ s10_203 ^ g_a230AEF40[(a5_190 >> 0x10 & 0x00FF) * 0x04] ^ g_a230AF340[(a3_188 >> 0x08 & 0x00FF) * 0x04];
		t3_364 = g_a230AEB40[(a1_152 >> 0x18) * 0x04] ^ g_a230AF740[(a3_188 & 0x00FF) * 0x04] ^ s0_105->dw0024 ^ g_a230AEF40[(a0_127 >> 0x10 & 0x00FF) * 0x04] ^ g_a230AF340[(a5_190 >> 0x08 & 0x00FF) * 0x04];
		a7_119 = g_a230AEB40[(a3_188 >> 0x18) * 0x04] ^ g_a230AF740[(a5_190 & 0x00FF) * 0x04] ^ (a0_356->ptr000C)->dw0008 ^ g_a230AEF40[(a1_152 >> 0x10 & 0x00FF) * 0x04] ^ g_a230AF340[(a0_127 >> 0x08 & 0x00FF) * 0x04];
		a5_110 = g_a230AEB40[(a5_190 >> 24) * 0x04] ^ a0_356 ^ a0_356 ^ a3_370 ^ a3_370;
	}
	byte * s9_215 = (a0_127 >> 0x18) + 0x230AFB40;
	Eq_92075 s10_233 = (word32) *s9_215 << 24 ^ (word32) (a5_190 >> 0x10 & 0x00FF)->b230AFB40 << 16 ^ (word32) (a1_152 & 0x00FF)->b230AFB40 ^ (word32) (a3_188 >> 0x08 & 0x00FF)->b230AFB40 << 8 ^ s10_203;
	a2->b0000 = (byte) (s10_233 >> 0x18);
	a2->b0001 = (byte) (s10_233 >> 0x10);
	a2->b0002 = (byte) (s10_233 >> 0x08);
	byte * s6_229 = (a1_152 >> 0x18) + 0x230AFB40;
	byte * s5_243 = (a3_188 & 0x00FF) + 0x230AFB40;
	ui32 a4_246 = (word32) *s6_229 << 24 ^ (word32) (a0_127 >> 0x10 & 0x00FF)->b230AFB40 << 16;
	word32 a6_247 = (word32) *s5_243;
	a2->b0003 = (byte) s10_233;
	struct Eq_94841 * s8_218 = a0_44 + 8 + ((a6_86 >> 0x01) << 5);
	uint32 a4_259 = a4_246 ^ a6_247 ^ (word32) (a5_190 >> 0x08 & 0x00FF)->b230AFB40 << 8 ^ s8_218->dw0004;
	a2->b0004 = (byte) (a4_259 >> 0x18);
	a2->b0005 = (byte) (a4_259 >> 0x10);
	a2->b0006 = (byte) (a4_259 >> 0x08);
	a2->b0007 = (byte) a4_259;
	byte * s3_257 = (a5_190 & 0x00FF) + 0x230AFB40;
	ui32 a5_275 = (word32) (a5_190 >> 24)->b230AFB40;
	uint32 a4_284 = (word32) (a3_188 >> 0x18)->b230AFB40 << 24 ^ (word32) (a1_152 >> 0x10 & 0x00FF)->b230AFB40 << 16 ^ (word32) (*s3_257) ^ (word32) (a0_127 >> 0x08 & 0x00FF)->b230AFB40 << 8 ^ s8_218->dw0008;
	a2->b0008 = (byte) (a4_284 >> 0x18);
	a2->b0009 = (byte) (a4_284 >> 0x10);
	a2->b000B = (byte) a4_284;
	ui32 a4_291 = (word32) (a3_188 >> 16 & 0x00FF)->b230AFB40;
	a2->b000A = (byte) (a4_284 >> 0x08);
	uint32 a5_301 = a5_275 << 24 ^ a4_291 << 16 ^ (word32) (a0_127 & 0x00FF)->b230AFB40 ^ (word32) (a1_152 >> 8 & 0x00FF)->b230AFB40 << 8 ^ s8_218->dw000C;
	a2->b000C = (byte) (a5_301 >> 0x18);
	a2->b000D = (byte) (a5_301 >> 0x10);
	dwArgE4->b000E = (byte) (a5_301 >> 0x08);
	dwArgE4->b000F = (byte) a5_301;
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	s2Out = 587918144;
	s3Out = s3_257;
	s4Out = dwArg98;
	s5Out = s5_243;
	s6Out = s6_229;
	s9Out = s9_215;
	s10Out = s10_233;
	return 0x230AF740;
}

// 23020F1E: Register word32 rijndael_encrypt(Register (ptr32 Eq_91861) a1, Register (ptr32 Eq_91848) a2, Stack word32 dwArg3C, Stack (ptr32 Eq_91864) dwArgE4, Stack word32 dwArg0148, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out (ptr32 byte) s6Out, Register out Eq_91870 s7Out, Register out ptr32 s8Out, Register out Eq_91872 s10Out)
// Called from:
//      BL_AesEncrypt
word32 rijndael_encrypt(struct Eq_91861 * a1, struct Eq_91848 * a2, word32 dwArg3C, struct Eq_91864 * dwArgE4, word32 dwArg0148, byte & s3Out, ptr32 & s4Out, byte & s5Out, byte & s6Out, union Eq_91870 & s7Out, ptr32 & s8Out, union Eq_91872 & s10Out)
{
	ui32 a3_82 = (word32) a1->b000E;
	ui32 a5_39 = (word32) a1->b0002;
	ui32 a5_57 = (word32) a1->b0006;
	ui32 a5_72 = (word32) a1->b000A;
	int32 a6_86 = ((Eq_582690[]) 20)[a3_82].ptr0000->dw0004;
	word32 a0_44 = ((Eq_582691[]) 8)[a5_39].dw0000;
	uint32 a4_341 = (word32) a1->b0000 << 24 ^ (word32) a1->b0001 << 16 ^ (word32) a1->b0003 ^ a5_39 << 8 ^ a5_39 << 8;
	uint32 t3_110 = (word32) a1->b0004 << 24 ^ (word32) a1->b0005 << 16 ^ (word32) a1->b0007 ^ a5_57 << 8 ^ a5_57 << 8;
	uint32 a7_119 = (word32) a1->b0008 << 24 ^ (word32) a1->b0009 << 16 ^ (word32) a1->b000B ^ a5_72 << 8 ^ a5_72 << 8;
	uint32 a5_386 = (word32) a1->b000C << 24 ^ (word32) a1->b000D << 16 ^ (word32) a1->b000F ^ a3_82 << 8 ^ a3_82 << 8;
	Eq_91870 s7_150 = a6_86 >> 0x01;
	while (true)
	{
		struct Eq_95794 * a0_108 = *((char *) g_a230B0840 + (a4_341 & 0x00FF) * 0x04);
		word32 a1_101 = *((char *) g_a230B0840 + (a5_386 & 0x00FF) * 0x04);
		struct Eq_95734 * s0_135 = a0_108->ptr0014;
		uint32 a3_127 = g_a230AFC40[(a4_341 >> 0x18) * 0x04] ^ a1_101 ^ a1_101 ^ (t3_110 >> 0x0E & 1020)->dw230B0040 ^ (a7_119 >> 0x06 & 1020)->dw230B0440;
		s7_150 = (word32) s7_150.u0 - 1;
		uint32 a1_152 = g_a230AFC40[(t3_110 >> 0x18) * 0x04] ^ a0_108 ^ a0_108 ^ (a7_119 >> 0x0E & 1020)->dw230B0040 ^ (a5_386 >> 0x06 & 1020)->dw230B0440;
		uint32 a0_186 = g_a230AFC40[(a7_119 >> 0x18) * 0x04] ^ *((char *) g_a230B0840 + (t3_110 & 0x00FF) * 0x04) ^ s0_135->dw0018 ^ (a5_386 >> 0x0E & 1020)->dw230B0040 ^ (a4_341 >> 0x06 & 1020)->dw230B0440;
		uint32 a5_188 = g_a230AFC40[(a5_386 >> 24) * 0x04] ^ *((char *) g_a230B0840 + (a7_119 & 0x00FF) * 0x04) ^ s0_135->dw001C ^ (a4_341 >> 0x0E & 1020)->dw230B0040 ^ (t3_110 >> 0x06 & 1020)->dw230B0440;
		int32 s10_202 = s0_135->dw0020;
		if (s7_150 == 0x00)
			break;
		struct Eq_95684 * a0_356 = *((char *) g_a230B0840 + (a0_186 & 0x00FF) * 0x04);
		word32 a3_370 = g_a230B0040[(a3_127 >> 16 & 0x00FF) * 0x04];
		a4_341 = g_a230AFC40[(a3_127 >> 0x18) * 0x04] ^ *((char *) g_a230B0840 + (a5_188 & 0x00FF) * 0x04) ^ s10_202 ^ g_a230B0040[(a1_152 >> 0x10 & 0x00FF) * 0x04] ^ g_a230B0440[(a0_186 >> 0x08 & 0x00FF) * 0x04];
		t3_110 = g_a230AFC40[(a1_152 >> 0x18) * 0x04] ^ *((char *) g_a230B0840 + (a3_127 & 0x00FF) * 0x04) ^ s0_135->dw0024 ^ g_a230B0040[(a0_186 >> 0x10 & 0x00FF) * 0x04] ^ g_a230B0440[(a5_188 >> 0x08 & 0x00FF) * 0x04];
		a7_119 = g_a230AFC40[(a0_186 >> 0x18) * 0x04] ^ *((char *) g_a230B0840 + (a1_152 & 0x00FF) * 0x04) ^ (a0_356->ptr000C)->dw0008 ^ g_a230B0040[(a5_188 >> 0x10 & 0x00FF) * 0x04] ^ g_a230B0440[(a3_127 >> 0x08 & 0x00FF) * 0x04];
		a5_386 = g_a230AFC40[(a5_188 >> 24) * 0x04] ^ a0_356 ^ a0_356 ^ a3_370 ^ a3_370;
	}
	Eq_91872 s10_233 = (word32) (a3_127 >> 0x18)->b230B0C40 << 24 ^ (word32) (a1_152 >> 0x10 & 0x00FF)->b230B0C40 << 16 ^ (word32) (a5_188 & 0x00FF)->b230B0C40 ^ (word32) (a0_186 >> 0x08 & 0x00FF)->b230B0C40 << 8 ^ s10_202;
	a2->b0000 = (byte) (s10_233 >> 0x18);
	a2->b0001 = (byte) (s10_233 >> 0x10);
	a2->b0002 = (byte) (s10_233 >> 0x08);
	byte * s6_229 = (a1_152 >> 0x18) + 0x230B0C40;
	byte * s5_243 = (a3_127 & 0x00FF) + 0x230B0C40;
	ui32 a4_246 = (word32) *s6_229 << 24 ^ (word32) (a0_186 >> 0x10 & 0x00FF)->b230B0C40 << 16;
	word32 a6_247 = (word32) *s5_243;
	a2->b0003 = (byte) s10_233;
	struct Eq_95500 * s8_218 = a0_44 + 8 + ((a6_86 >> 0x01) << 5);
	uint32 a4_259 = a4_246 ^ a6_247 ^ (word32) (a5_188 >> 0x08 & 0x00FF)->b230B0C40 << 8 ^ s8_218->dw0004;
	a2->b0004 = (byte) (a4_259 >> 0x18);
	a2->b0005 = (byte) (a4_259 >> 0x10);
	a2->b0006 = (byte) (a4_259 >> 0x08);
	a2->b0007 = (byte) a4_259;
	byte * s3_257 = (a1_152 & 0x00FF) + 0x230B0C40;
	ui32 a5_275 = (word32) (a5_188 >> 24)->b230B0C40;
	uint32 a4_284 = (word32) (a0_186 >> 0x18)->b230B0C40 << 24 ^ (word32) (a5_188 >> 0x10 & 0x00FF)->b230B0C40 << 16 ^ (word32) (*s3_257) ^ (word32) (a3_127 >> 0x08 & 0x00FF)->b230B0C40 << 8 ^ s8_218->dw0008;
	a2->b0008 = (byte) (a4_284 >> 0x18);
	a2->b0009 = (byte) (a4_284 >> 0x10);
	a2->b000B = (byte) a4_284;
	ui32 a4_291 = (word32) (a3_127 >> 16 & 0x00FF)->b230B0C40;
	a2->b000A = (byte) (a4_284 >> 0x08);
	uint32 a5_301 = a5_275 << 24 ^ a4_291 << 16 ^ (word32) (a0_186 & 0x00FF)->b230B0C40 ^ (word32) (a1_152 >> 8 & 0x00FF)->b230B0C40 << 8 ^ s8_218->dw000C;
	a2->b000C = (byte) (a5_301 >> 0x18);
	a2->b000D = (byte) (a5_301 >> 0x10);
	dwArgE4->b000E = (byte) (a5_301 >> 0x08);
	dwArgE4->b000F = (byte) a5_301;
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	s3Out = s3_257;
	s4Out = dwArg98;
	s5Out = s5_243;
	s6Out = s6_229;
	s7Out = s7_150;
	s8Out = dwArg78;
	s10Out = s10_233;
	return 0x230AFC40;
}

