pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23021360: Register (ptr32 Eq_95932) Bl_SHA1ProcessMessageBlock(Register Eq_2 a0)
// Called from:
//      Bl_SHA1Final
//      Bl_SHA1Update
struct Eq_95932 * Bl_SHA1ProcessMessageBlock(Eq_2 a0)
{
	struct Eq_95934 * a4_11 = (word32) a0 + 28;
	do
	{
		++a4_11;
		a4_11[0x03FF] = (struct Eq_95934) ((word32) a4_11[16] << 24 | (word32) a4_11->b0041 << 16 | (word32) a4_11->b003E << 8 | (word32) a4_11->b003F);
	} while ((word32) a0 + 92 != a4_11);
	Eq_95970 a6_137 = *a0;
	Eq_95970 t3_24 = *((word32) a0 + 4);
	int32 t1_100 = *((word32) a0 + 8);
	int32 t4_149 = *((word32) a0 + 0x0C);
	int32 t6_27 = *((word32) a0 + 16);
	struct Eq_95990 * a5_104 = null;
	while (true)
	{
		int32 a4_51;
		ui32 a3_44 = ((t1_100 ^ t4_149) & t3_24 ^ t4_149) + ((a6_137 << 0x05 | a6_137 >> 0x1B) + 0x5A827999);
		if ((a5_104 & 48) != 0x00)
		{
			int32 * a7_65 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
			uint32 a4_74 = *((word32) a0 + ((a5_104 + 0x0D & 0x0F) * 0x04 + 28)) ^ *((word32) a0 + ((a5_104 + 8 & 0x0F) * 0x04 + 28)) ^ *a7_65 ^ *((word32) a0 + ((a5_104 + 2 & 0x0F) * 0x04 + 28));
			a4_51 = a4_74 >> 31 | a4_74 << 0x01;
			*a7_65 = a4_51;
		}
		else
			a4_51 = (word32) a0 + (a5_104 << 0x02) + 28;
		++a5_104;
		Eq_95970 a4_122 = a4_51 + a3_44 + t6_27;
		int32 a7_138 = t3_24 << 0x1E | t3_24 >> 0x02;
		t3_24 = a6_137;
		t6_27 = t4_149;
		if (a5_104 == (struct Eq_95990 *) 0x14)
			break;
		t4_149 = t1_100;
		a6_137 = a4_122;
		t1_100 = a7_138;
	}
	while (true)
	{
		int32 * t3_119 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
		word32 a1_131 = (a0 + 28)[(a5_104 + 0x0D & 0x0F) * 0x04] ^ (a0 + 28)[(a5_104 + 8 & 0x0F) * 0x04] ^ Mem114[t3_119 + 0x00:int32] ^ (a0 + 28)[(a5_104 + 2 & 0x0F) * 0x04];
		int32 a1_134 = a1_131 >> 31 | a1_131 << 0x01;
		*t3_119 = a1_134;
		++a5_104;
		Eq_95970 a3_150 = (a6_137 ^ a7_138 ^ t1_100) + ((a4_122 << 0x05 | a4_122 >> 0x1B) + 1859775393) + a1_134 + t4_149;
		int32 t3_151 = a6_137 << 0x1E | a6_137 >> 0x02;
		a6_137 = a4_122;
		t4_149 = t1_100;
		if (a5_104 == (struct Eq_95990 *) 40)
			break;
		t1_100 = a7_138;
		a4_122 = a3_150;
		a7_138 = t3_151;
	}
	while (true)
	{
		int32 * t4_176 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
		word32 a6_188 = (a0 + 28)[(a5_104 + 0x0D & 0x0F) * 0x04] ^ (a0 + 28)[(a5_104 + 8 & 0x0F) * 0x04] ^ Mem171[t4_176 + 0x00:int32] ^ (a0 + 28)[(a5_104 + 2 & 0x0F) * 0x04];
		int32 a6_191 = a6_188 >> 0x1F | a6_188 << 0x01;
		*t4_176 = a6_191;
		++a5_104;
		Eq_95970 a1_209 = ((t3_151 | a7_138) & a4_122 | t3_151 & a7_138) + ((a3_150 << 0x05 | a3_150 >> 0x1B) + 2400959708) + a6_191 + t1_100;
		int32 t4_210 = a4_122 << 0x1E | a4_122 >> 0x02;
		a4_122 = a3_150;
		t1_100 = a7_138;
		if (a5_104 == (struct Eq_95990 *) 60)
			break;
		a7_138 = t3_151;
		a3_150 = a1_209;
		t3_151 = t4_210;
	}
	while (true)
	{
		int32 * t1_235 = ((a5_104 & 0x0F) << 2) + ((word32) a0 + 28);
		word32 a4_247 = (a0 + 28)[(a5_104 + 0x0D & 0x0F) * 0x04] ^ (a0 + 28)[(a5_104 + 8 & 0x0F) * 0x04] ^ Mem230[t1_235 + 0x00:int32] ^ (a0 + 28)[(a5_104 + 2 & 0x0F) * 0x04];
		int32 a4_250 = a4_247 >> 31 | a4_247 << 0x01;
		*t1_235 = a4_250;
		++a5_104;
		Eq_95970 a4_264 = a4_250 + (((a3_150 ^ t4_210) ^ t3_151) + ((a1_209 << 0x05 | a1_209 >> 0x1B) + 0xCA62C1D6)) + a7_138;
		int32 a6_267 = a3_150 << 0x1E | a3_150 >> 0x02;
		a3_150 = a1_209;
		a7_138 = t3_151;
		if (a5_104 == (struct Eq_95990 *) 80)
			break;
		t3_151 = t4_210;
		a1_209 = a4_264;
		t4_210 = a6_267;
	}
	a5_104->ptr0000->w009C = 0x00;
	Mem278[a4_264 + a5_104:word32] = Mem275[a5_104 + 4:word32];
	word32 a1_279 = a1_209 + a5_104;
	a1_279->dw0004 = (word32) a5_104[8];
	*a5_104[0x0C].dw0008 = (struct Eq_95990) (a5_104 + a6_267);
	struct Eq_96080 * a0_286 = a5_104[16];
	a0_286->dw000C = a5_104 + t4_210;
	a0_286->dw0010 = a5_104 + t3_151;
	return a1_279;
}

// 2302162A: void Bl_SHA1Init(Register (ptr32 Eq_92191) a0)
// Called from:
//      Bl_hmac_sha1
void Bl_SHA1Init(struct Eq_92191 * a0)
{
	if (a0 == null)
		return;
	*(struct Eq_92191 **) 0x67452301 = a0;
	*(struct Eq_92191 **) 4023233421 = a0;
	*(struct Eq_92191 **) 0x98BADD06 = a0;
	*(struct Eq_92191 **) 271733890 = a0;
	a0->dw0014 = 0x00;
	a0->dw0018 = 0x00;
	*(struct Eq_92191 **) 0xC3D2E200 = a0;
	a0->dw009C = 0x00;
}

// 23021672: Register Eq_2 Bl_SHA1Final(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 s1Out)
// Called from:
//      Bl_hmac_sha1
Eq_2 Bl_SHA1Final(Eq_2 ra, Eq_2 a0, Eq_2 a1, union Eq_2 & s1Out)
{
	if (a0 == 0x00 || (a1 == 0x00 || (word32) (*((word32) a0 + 0x009F)) != 0x00))
	{
		s1Out = s1;
		return ra;
	}
	else
	{
		Eq_2 s0_168 = a0;
		if ((word32) *((word32) a0 + 0x009E) == 0x00)
		{
			int32 a4_20 = (int32) *((word32) a0 + 0x009C);
			*((word32) a0 + 0x009C) = (word16) (int32) (word16) (a4_20 + 1);
			(word32) a0 + a4_20 + 92 = (ptr32) 0x80;
			if (a4_20 > 55)
			{
				while (true)
				{
					int32 a5_41 = (int32) *((word32) a0 + 0x009C);
					if (a5_41 > 63)
						break;
					*((word32) a0 + 0x009C) = (word16) (a5_41 + 1);
					(word32) a0 + a5_41 + 92 = (word32) 0x00;
				}
				Bl_SHA1ProcessMessageBlock(a0);
				while (true)
				{
					int32 a5_65 = (int32) *((word32) a0 + 0x009C);
					if (a5_65 > 55)
						break;
					*((word32) a0 + 0x009C) = (word16) (a5_65 + 1);
					(word32) a0 + a5_65 + 92 = (word32) 0x00;
				}
			}
			else
			{
				while (true)
				{
					int32 a5_32 = (int32) *((word32) a0 + 0x009C);
					if (a5_32 > 55)
						break;
					*((word32) a0 + 0x009C) = (word16) (a5_32 + 1);
					(word32) a0 + a5_32 + 92 = (word32) 0x00;
				}
			}
			uint32 a5_73 = (word32) *((word32) a0 + 24);
			struct Eq_96421 * s0_78 = (a5_73 >> 8)->ptr0018;
			s0_78->w0096 = (word16) (a5_73 << 0x08 | a5_73 >> 8);
			s0_78->b0095 = (byte) (a5_73 >> 24);
			uint32 a5_83 = (word32) s0_78->w0014;
			s0_78->b0094 = (byte) (a5_73 >> 0x20);
			s0_168 = (a5_83 >> 8)->t0014;
			*((word32) s0_168 + 0x009A) = (word16) (a5_83 << 0x08 | a5_83 >> 8);
			*((word32) s0_168 + 0x0099) = (byte) (a5_83 >> 24);
			*((word32) s0_168 + 0x0098) = (byte) (a5_83 >> 0x20);
			Bl_SHA1ProcessMessageBlock(a0);
			byte * a5_108 = (word32) s0_168 + 92;
			do
			{
				*a5_108 = 0x00;
				++a5_108;
			} while ((word32) s0_168 + 0x009C != a5_108);
			*((word32) s0_168 + 20) = 0x00;
			*((word32) s0_168 + 24) = 0x00;
			*((word32) s0_168 + 0x009E) = 0x01;
		}
		int32 a5_119;
		for (a5_119 = 0x00; a5_119 != 0x14; ++a5_119)
			*((word32) a1 + a5_119) = (byte) (*((word32) s0_168 + (a5_119 & -4)) >> ((~a5_119 & 0x03) << 3));
		word32 a5_275;
		word32 a4_274;
		word32 a2_272;
		word32 a3_273;
		word32 a1_271;
		word32 t1_269;
		word32 a0_270;
		Eq_2 ra_152 = memset(ra, s0_168, 0x00, 0x00A0, out t1_269, out a0_270, out a1_271, out a2_272, out a3_273, out a4_274, out a5_275);
		s1Out = a1;
		return ra_152;
	}
}

// 230217BE: Register word32 Bl_SHA1Update(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack word32 dwArg0128, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out ptr32 s2Out, Register out Eq_92433 s3Out)
// Called from:
//      Bl_hmac_sha1
word32 Bl_SHA1Update(Eq_2 a0, Eq_2 a1, Eq_2 a2, word32 dwArg0128, union Eq_2 & a1Out, union Eq_2 & a2Out, ptr32 & s2Out, union Eq_92433 & s3Out)
{
	if (a2 != 0x00)
	{
		Eq_2 s0_10 = a0;
		if (a0 != 0x00 && a1 != 0x00)
		{
			if ((word32) *((word32) a0 + 0x009E) != 0x00)
				*((word32) a0 + 0x009F) = 0x03;
			else if ((word32) *((word32) a0 + 0x009F) == 0x00)
			{
				word32 s1_22 = a1 + a2;
				s2 = 0x01;
				s3.u0 = 64;
				while (a1 != s1_22 && (word32) (*((word32) s0_10 + 0x009F)) == 0x00)
				{
					int32 a4_30 = (int32) *((word32) s0_10 + 0x009C);
					int32 a5_32 = a4_30 + 1 << 16;
					*((word32) s0_10 + 0x009C) = (word16) (a5_32 >> 16);
					struct Eq_96624 * a4_36 = (word32) s0_10 + a4_30;
					a4_36->b005C = (byte) (word32) *a1;
					s0_10 = a4_36->t0014;
					a4_36->t001C = s0_10;
					if (a4_36 == (struct Eq_96624 *) 0x08)
					{
						s0_10 = a4_36->t0020;
						a4_36->t0021 = s0_10;
						if (a4_36 == (struct Eq_96624 *) 0x09)
							*((word32) s0_10 + 0x009F) = 0x01;
					}
					if (a5_32 >> 16 == 64)
						a1 = Bl_SHA1ProcessMessageBlock(s0_10);
					a1 = (word32) a1 + 1;
				}
			}
		}
		0x00 = dwArg0128;
		a1Out = a1;
		a2Out = dwArg0100;
		s2Out = s2;
		s3Out = s3;
		return dwArgE4;
	}
	else
	{
		a1Out = a1;
		a2Out = a2;
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
}

// 23021854: Register word32 ap_setpsk(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      apm_start_req_handler
word32 ap_setpsk(Eq_2 a0, Eq_2 a1, Eq_2 a2)
{
	word32 a4_111;
	word32 a5_112;
	struct Eq_62008 * a0_15 = cm_GetApInfo(a0, out a4_111, out a5_112);
	if (a0_15 == null)
		return;
	Eq_2 a1_29;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	a0_15->b00A4 = (byte) strlen(a1, out a1_29, out a2_113, out a3_114, out a4_115, out a5_116);
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	word32 a5_121;
	word32 a6_122;
	word32 a7_123;
	memcpy(&a0_15->dw0080 + 1, a1_29, 32, out a1_117, out a2_118, out a3_119, out a4_120, out a5_121, out a6_122, out a7_123);
	word32 a1_124;
	word32 a2_125;
	word32 a3_126;
	word32 a4_127;
	word32 a5_128;
	a0_15->b0058 = (byte) strlen(a2, out a1_124, out a2_125, out a3_126, out a4_127, out a5_128);
	word32 a1_129;
	word32 a2_130;
	word32 a3_131;
	word32 a4_132;
	word32 a5_133;
	word32 a6_134;
	word32 a7_135;
	memcpy(&a0_15->b0016 + 2, a2, 64, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out a6_134, out a7_135);
	return;
}

// 230218AC: void ap_resetConfiguration(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      InitializeAp
void ap_resetConfiguration(Eq_2 ra, Eq_2 a0)
{
	word32 a4_116;
	word32 a5_117;
	struct Eq_62008 * a0_12 = cm_GetApInfo(a0, out a4_116, out a5_117);
	word32 a4_118;
	word32 a5_119;
	Eq_2 a0_17 = cm_GetApData(a0, out a4_118, out a5_119);
	if (a0_12 != null && a0_17 != 0x00)
	{
		word32 a1_120;
		word32 a2_121;
		word32 a3_122;
		word32 a4_123;
		word32 a5_124;
		a0_12->b00A4 = (byte) strlen(587926888, out a1_120, out a2_121, out a3_122, out a4_123, out a5_124);
		word32 a1_125;
		word32 a2_126;
		word32 a3_127;
		word32 a4_128;
		word32 a5_129;
		word32 a6_130;
		word32 a7_131;
		memcpy(&a0_12->dw0080 + 1, 587926888, 32, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out a6_130, out a7_131);
		a0_12->dw00B8 = 0x01;
		word32 t1_132;
		word32 a0_133;
		word32 a1_134;
		word32 a2_135;
		word32 a3_136;
		word32 a4_137;
		word32 a5_138;
		memset(ra, &a0_12->w0008, 0x00, 0x007C, out t1_132, out a0_133, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138);
		ui32 a5_59 = (word32) a0_12->w0008;
		a0_12->w0010 = 0x01;
		a0_12->w0008 = (word16) (a5_59 & 0x00F7 | 264);
		a0_12->w000C = (word16) ((word32) a0_12->w000C & 0x00F7 | 264);
		a0_12->b0079 = 0x03;
		a0_12->b007A = 0x03;
		*(struct Eq_62008 **) 0xE0 = a0_12;
		a0_12->dw0080 = 100;
		*(struct Eq_62008 **) 0x15000194 = a0_12;
	}
}

// 23021944: void InitializeAp(Register Eq_2 ra, Register Eq_2 a0)
// Called from:
//      cm_AllocResources
void InitializeAp(Eq_2 ra, Eq_2 a0)
{
	ap_resetConfiguration(ra, a0);
}

// 23021948: void ipc_emb2app_rawstatus_get()
// Called from:
//      ipc_host_get_rawstatus
void ipc_emb2app_rawstatus_get()
{
}

// 23021950: Register Eq_2 ipc_host_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bl_ipc_init
Eq_2 ipc_host_init(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, union Eq_2 & s0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_96883 * s1_38;
	Eq_96884 s2_41;
	Eq_2 s3_42;
	word32 a0_132;
	word32 a1_133;
	word32 a2_134;
	word32 a3_135;
	word32 a4_136;
	word32 a5_137;
	word32 a7_138;
	word32 s4_139;
	word32 s5_140;
	word32 s6_141;
	word32 s7_142;
	word32 s8_143;
	word32 s9_144;
	word32 s10_145;
	word32 s11_146;
	word32 t4_147;
	Eq_2 ra_37 = printf(ra, &g_t230B0D7C, g_dw4200EAF8 + g_dw4200EB38, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_38, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out a7_138, out s2_41, out s3_42, out s4_139, out s5_140, out s6_141, out s7_142, out s8_143, out s9_144, out s10_145, out s11_146, out t4_147);
	utils_list_init(&g_t42023F34);
	word32 t1_148;
	word32 a0_149;
	word32 a1_150;
	word32 a2_151;
	word32 a3_152;
	word32 a4_153;
	word32 a5_154;
	Eq_2 ra_62 = memset(ra_37, a0, 0x00, 228, out t1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_153, out a5_154);
	s1_38->t0020 = a0;
	word32 a1_155;
	word32 a2_156;
	word32 a3_157;
	word32 a4_158;
	word32 a5_159;
	word32 a6_160;
	word32 a7_161;
	memcpy(a0, s3_42, 32, out a1_155, out a2_156, out a3_157, out a4_158, out a5_159, out a6_160, out a7_161);
	*(union Eq_2 *) 0x3A = a0;
	*((word32) a0 + 53) = 0x02;
	((word32) a0 + 0x00A4)->u0 = 0x08;
	((word32) a0 + 0x00A8)->u0 = 992;
	*((word32) a0 + 224) = s2_41;
	*(union Eq_2 *) 0x00FFF83C = a0;
	*((word32) a0 + 0x00A0) = a0;
	s1_38->t0260 = a0;
	ptr32 a3_108;
	ptr32 a4_109;
	word32 t1_162;
	word32 a0_163;
	word32 a1_164;
	word32 a2_165;
	word32 a5_166;
	Eq_2 ra_111 = memset(ra_62, (char *) &s1_38->t0020 + 484, 0x00, (word32) dwArg48 - 832, out t1_162, out a0_163, out a1_164, out a2_165, out a3_108, out a4_109, out a5_166);
	s0Out = a0;
	a3Out = a3_108;
	a4Out = a4_109;
	return ra_111;
}

