pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23021BC6: Register Eq_2 bl_main_denoise(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a4Out)
// Called from:
//      stateConnectedIPYes_exit
//      stateGlobalGuard_denoise
Eq_2 bl_main_denoise(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a4Out)
{
	ptr32 a4_18;
	Eq_2 ra_22 = bl_send_mm_denoise_req(ra, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg30, dwArg34, dwArg40, dwArg44, dwArg58, dwArg68, dwArg7C, dwArg8C, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out a4_18);
	a4Out = a4_18;
	return ra_22;
}

// 23021BD4: void bl_main_monitor(Register Eq_2 ra, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      stateIdleGuard_sniffer
void bl_main_monitor(Eq_2 ra, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	Eq_2 a5_14;
	word32 t1_69;
	word32 a0_70;
	word32 a1_71;
	word32 a2_72;
	bl_send_monitor_enable(memset(ra, fp + -56, 0x00, 40, out t1_69, out a0_70, out a1_71, out a2_72, out a3_12, out a4_13, out a5_14), a3_12, a4_13, a5_14, s3, mstatus, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg28, dwArg4C, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
}

// 23021BFA: Register word32 bl_main_phy_up(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      stateIfaceDownGuard_phyup
word32 bl_main_phy_up(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 a0_15;
	struct Eq_97677 * s0_41 = bl_send_start(ra, a3, a4, a5, s3, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a0_15);
	if (a0_15 == 0x00)
		s0_41->dw1000E80 = s0_41->dwFFFE80 | 4;
	else
		a0_15 = ~0x00;
	return a0_15;
}

// 23021C2E: void bl_main_monitor_channel_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg44, Stack Eq_2 dwArg4C, Stack up32 dwArg64, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      stateSnifferGuard_ChannelSet
void bl_main_monitor_channel_set(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, word32 dwArg44, Eq_2 dwArg4C, up32 dwArg64, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	bl_send_monitor_channel_set(ra, s1, a1, a4, a5, s3, mstatus, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwArg00, dwArg04, dwArg08, dwArg44, dwArg4C, dwArg64, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
}

// 23021C4C: Register Eq_2 bl_main_if_remove(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      stateDisconnect_action_idle
//      stateGlobalGuard_stop
//      stateGlobalGuard_disable_autoreconnect
Eq_2 bl_main_if_remove(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a5_15;
	Eq_2 a3_19;
	Eq_2 a4_20;
	Eq_2 s3_27;
	Eq_2 a3_43;
	ptr32 mstatus_65;
	ptr32 a3_74;
	word32 s1_124;
	word32 a0_125;
	word32 a1_126;
	word32 a2_127;
	word32 a7_128;
	word32 s2_129;
	word32 s4_130;
	word32 s5_131;
	word32 s6_132;
	word32 s7_133;
	word32 s8_134;
	word32 s9_135;
	word32 s10_136;
	word32 s11_137;
	word32 t4_138;
	word32 s1_139;
	word32 a0_140;
	word32 a1_141;
	word32 a2_142;
	word32 a4_143;
	word32 a5_144;
	word32 a7_145;
	word32 s2_146;
	word32 s3_147;
	word32 s4_148;
	word32 s5_149;
	word32 s6_150;
	word32 s7_151;
	word32 s8_152;
	word32 s9_153;
	word32 s10_154;
	word32 s11_155;
	word32 t4_156;
	Eq_2 ra_77 = printf(bl_send_remove_if(printf(ra, &g_t230B0F90, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_124, out a0_125, out a1_126, out a2_127, out a3_19, out a4_20, out a5_15, out a7_128, out s2_129, out s3_27, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138), a3_19, a4_20, a5_15, s3_27, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a3_43, out mstatus_65), &g_t230B0FC8, a3_43, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_139, out a0_140, out a1_141, out a2_142, out a3_74, out a4_143, out a5_144, out a7_145, out s2_146, out s3_147, out s4_148, out s5_149, out s6_150, out s7_151, out s8_152, out s9_153, out s10_154, out s11_155, out t4_156);
	a3Out = a3_74;
	mstatusOut = mstatus_65;
	return ra_77;
}

