pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23021FEE: Register word32 bl_main_scan(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      stateDisconnect_enter
//      stateGlobalGuard_fw_scan
//      stateConnectedIPYes_enter
word32 bl_main_scan(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	return bl_send_scanu_req(ra, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
}

// 23022006: Register Eq_2 bl_cfg80211_connect(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      bl_main_connect
Eq_2 bl_cfg80211_connect(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a4_18;
	if (bl_send_sm_connect_req(ra, s1, a0, a3, a4, a5, s2, mstatus, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out a4_18) == 0x00)
		a4_18 = (word32) bLoc14;
	return a4_18;
}

// 23022032: Register word32 bl_main_connect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register ptr32 a6, Register word32 a7, Register ptr32 mstatus, Stack uint16 wArg00, Stack Eq_2 dwArg18)
// Called from:
//      stateDisconnect_action_reconnect
//      stateIdleAction_connect
word32 bl_main_connect(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, ptr32 a6, word32 a7, ptr32 mstatus, uint16 wArg00, Eq_2 dwArg18)
{
	byte bLoc010F_173 = SLICE(dwLoc0110, byte, 8);
	word32 s0_33 = (word32) wArg00;
	Eq_2 a3_37;
	Eq_2 a4_38;
	Eq_2 a5_39;
	word32 a1_199;
	word32 a2_200;
	word32 t1_197;
	word32 a0_198;
	Eq_2 ra_40 = memset(ra, fp + -272, 0x00, 0x00F0, out t1_197, out a0_198, out a1_199, out a2_200, out a3_37, out a4_38, out a5_39);
	if (s0_33 != 0x00)
		dwLoc0110 = SEQ((word16) s0_33, bLoc010F_173, (byte) a7);
	return bl_cfg80211_connect(ra_40, a2, 0x420230A0, a3_37, a4_38, a5_39, a0, mstatus, dwLoc0130, dwLoc012C, dwLoc0110, dwLoc010C, dwLoc0108, a0, dwLocFC, dwLocD8, dwLocB4, dwLoc68, dwLoc48, dwLoc28, s0, dwArg18);
}

// 230220C4: void bl_main_event_handle(Register Eq_2 ra, Register ptr32 s0, Register (ptr32 Eq_58770) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s4, Register Eq_58767 s6, Register ptr32 mstatus, Stack word32 dwArg08, Stack (ptr32 Eq_58770) dwArg10, Stack ptr32 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack word32 dwArg88, Stack Eq_2 dwArg8C)
// Called from:
//      bl_event_handle
void bl_main_event_handle(Eq_2 ra, ptr32 s0, struct Eq_58770 * a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s4, Eq_58767 s6, ptr32 mstatus, word32 dwArg08, struct Eq_58770 * dwArg10, ptr32 dwArg28, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, word32 dwArg88, Eq_2 dwArg8C)
{
	struct Eq_99421 * a0_16;
	Eq_2 a4_20;
	ptr32 mstatus_23;
	Eq_2 ra_24 = bl_irq_bottomhalf(ra, s0, a2, a3, a4, s2, s4, s6, mstatus, dwArg08, dwArg28, dwArg68, dwArg88, out a0_16, out a4_20, out mstatus_23);
	bl_tx_try_flush(ra_24, a0_16, dwArg10, a4_20, mstatus_23, dwArg38, dwArg40, dwArg44, dwArg68, dwArg8C);
}

// 230220DC: Register word32 bl_main_lowlevel_init()
// Called from:
//      bl_main_rtthread_start
word32 bl_main_lowlevel_init()
{
	return bl_irqs_init();
}

// 230220E8: Register Eq_2 bl_main_rtthread_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_99498) s0Out, Register out ptr32 mstatusOut)
// Called from:
//      bl606a0_wifi_init
Eq_2 bl_main_rtthread_start(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, struct Eq_99498 & s0Out, ptr32 & mstatusOut)
{
	Eq_2 ra_141;
	struct Eq_274 * a0_400;
	*bl_main_lowlevel_init() = 0x420230A0;
	g_t420233F8.u0 = 0x420233F8;
	g_dw420233FC = 0x420233F8;
	*(word32 *) 1124220572 = 0x4200D06C;
	word32 a0_30;
	Eq_2 s1_40;
	Eq_2 s2_43;
	Eq_2 a3_319;
	struct Eq_99498 * s0_113;
	Eq_2 ra_324 = bl_platform_on(ra, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwArg18, dwArg3C, dwArg98, dwArgD8, dwArg0118, out s0_113, out s1_40, out a0_30, out a3_319, out s2_43);
	if (a0_30 != 0x00)
		a0_400 = (struct Eq_274 *) &g_t230B0FE8;
	else
	{
		ipc_host_enable_irq((struct Eq_97413 *) 0x07FF);
		Eq_2 a3_64;
		Eq_2 a4_65;
		Eq_2 a5_66;
		Eq_2 s3_75;
		word32 a0_87;
		Eq_2 a2_89;
		Eq_2 a4_91;
		Eq_2 a5_92;
		ra_324 = bl_send_reset(bl_wifi_enable_irq(ra_324, s1_40, s2_43, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, s1, ra, dwArg8C, out a3_64, out a4_65, out a5_66, out s3_75), a3_64, a4_65, a5_66, s3_75, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, ra, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s0_113, out a0_87, out a2_89, out a3_319, out a4_91, out a5_92, out mstatus);
		if (a0_87 != 0x00)
			a0_400 = (struct Eq_274 *) &g_t230B1000;
		else
		{
			Eq_2 a3_118;
			Eq_2 a4_119;
			Eq_2 a5_120;
			Eq_2 s3_125;
			word32 s1_526;
			word32 a0_527;
			word32 a1_528;
			word32 a2_529;
			word32 s2_530;
			word32 s4_531;
			vTaskDelay(0x05, a2_89, a3_319, a4_91, a5_92, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158, out s1_526, out a0_527, out a1_528, out a2_529, out a3_118, out a4_119, out a5_120, out s2_530, out s3_125, out s4_531);
			word32 a0_133;
			ra_141 = bl_send_version_req(ra_324, a3_118, a4_119, a5_120, s3_125, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg48, ra, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_113, out a0_133, out mstatus);
			if (a0_133 != 0x00)
				goto l2302213C;
			Eq_2 a3_174;
			Eq_2 a3_199;
			Eq_2 a3_224;
			Eq_2 a3_249;
			Eq_2 a3_274;
			struct Eq_99740 * a1_297;
			word32 s1_303;
			word32 a0_317;
			Eq_2 a4_320;
			Eq_2 a5_321;
			Eq_2 s3_329;
			word32 s1_551;
			word32 a0_552;
			word32 a1_553;
			word32 a2_554;
			word32 a4_555;
			word32 a5_556;
			word32 a7_557;
			word32 s2_558;
			word32 s3_559;
			word32 s4_560;
			word32 s5_561;
			word32 s6_562;
			word32 s7_563;
			word32 s8_564;
			word32 s9_565;
			word32 s10_566;
			word32 s11_567;
			word32 t4_568;
			word32 s1_569;
			word32 a0_570;
			word32 a1_571;
			word32 a2_572;
			word32 a4_573;
			word32 a5_574;
			word32 a7_575;
			word32 s2_576;
			word32 s3_577;
			word32 s4_578;
			word32 s5_579;
			word32 s6_580;
			word32 s7_581;
			word32 s8_582;
			word32 s9_583;
			word32 s10_584;
			word32 s11_585;
			word32 t4_586;
			word32 s1_587;
			word32 a0_588;
			word32 a1_589;
			word32 a2_590;
			word32 a4_591;
			word32 a5_592;
			word32 a7_593;
			word32 s2_594;
			word32 s3_595;
			word32 s4_596;
			word32 s5_597;
			word32 s6_598;
			word32 s7_599;
			word32 s8_600;
			word32 s9_601;
			word32 s10_602;
			word32 s11_603;
			word32 t4_604;
			word32 s1_605;
			word32 a0_606;
			word32 a1_607;
			word32 a2_608;
			word32 a4_609;
			word32 a5_610;
			word32 a7_611;
			word32 s2_612;
			word32 s3_613;
			word32 s4_614;
			word32 s5_615;
			word32 s6_616;
			word32 s7_617;
			word32 s8_618;
			word32 s9_619;
			word32 s10_620;
			word32 s11_621;
			word32 t4_622;
			word32 s1_623;
			word32 a0_624;
			word32 a1_625;
			word32 a2_626;
			word32 a4_627;
			word32 a5_628;
			word32 a7_629;
			word32 s2_630;
			word32 s3_631;
			word32 s4_632;
			word32 s5_633;
			word32 s6_634;
			word32 s7_635;
			word32 s8_636;
			word32 s9_637;
			word32 s10_638;
			word32 s11_639;
			word32 t4_640;
			word32 a0_641;
			word32 a2_642;
			word32 a3_643;
			word32 a4_644;
			word32 a5_645;
			word32 a7_646;
			word32 s2_647;
			word32 s3_648;
			word32 s4_649;
			word32 s5_650;
			word32 s6_651;
			word32 s7_652;
			word32 s8_653;
			word32 s9_654;
			word32 s10_655;
			word32 s11_656;
			word32 t4_657;
			ra_324 = bl_handle_dynparams(printf(printf(printf(printf(printf(printf(ra_141, &g_t230B1018, s0_113->tFFFFFDE4 >> 0x08 & 0x00FF, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_551, out a0_552, out a1_553, out a2_554, out a3_174, out a4_555, out a5_556, out a7_557, out s2_558, out s3_559, out s4_560, out s5_561, out s6_562, out s7_563, out s8_564, out s9_565, out s10_566, out s11_567, out t4_568), &g_t230B1038, a3_174, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_569, out a0_570, out a1_571, out a2_572, out a3_199, out a4_573, out a5_574, out a7_575, out s2_576, out s3_577, out s4_578, out s5_579, out s6_580, out s7_581, out s8_582, out s9_583, out s10_584, out s11_585, out t4_586), &g_t230B105C, a3_199, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_587, out a0_588, out a1_589, out a2_590, out a3_224, out a4_591, out a5_592, out a7_593, out s2_594, out s3_595, out s4_596, out s5_597, out s6_598, out s7_599, out s8_600, out s9_601, out s10_602, out s11_603, out t4_604), &g_t230B1080, a3_224, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_605, out a0_606, out a1_607, out a2_608, out a3_249, out a4_609, out a5_610, out a7_611, out s2_612, out s3_613, out s4_614, out s5_615, out s6_616, out s7_617, out s8_618, out s9_619, out s10_620, out s11_621, out t4_622), &g_t230B10A0, a3_249, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_623, out a0_624, out a1_625, out a2_626, out a3_274, out a4_627, out a5_628, out a7_629, out s2_630, out s3_631, out s4_632, out s5_633, out s6_634, out s7_635, out s8_636, out s9_637, out s10_638, out s11_639, out t4_640), &g_t230B10C0, a3_274, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_303, out a0_641, out a1_297, out a2_642, out a3_643, out a4_644, out a5_645, out a7_646, out s2_647, out s3_648, out s4_649, out s5_650, out s6_651, out s7_652, out s8_653, out s9_654, out s10_655, out s11_656, out t4_657), s1_303 + 0x00A0, a1_297, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out a0_317, out a3_319, out a4_320, out a5_321, out s3_329);
			if (a0_317 == 0x00)
			{
				Eq_2 a3_343;
				Eq_2 a4_344;
				Eq_2 a5_345;
				Eq_2 s3_353;
				ptr32 mstatus_365;
				word32 a1_658;
				ra_141 = bl_send_me_chan_config_req(bl_send_me_config_req(ra_324, a3_319, a4_320, a5_321, s3_329, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg40, dwArg44, dwArg48, dwArg5C, s1, ra, dwArg8C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a3_343, out a4_344, out a5_345, out s3_353, out mstatus_365), a3_343, a4_344, a5_345, s3_353, mstatus_365, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, ra, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s0_113, out a1_658, out mstatus);
				s0_113->b0E6C = 0x01;
l2302213C:
				s0Out = s0_113;
				mstatusOut = mstatus;
				return ra_141;
			}
			a0_400 = (struct Eq_274 *) &g_t230B10DC;
		}
	}
	word32 s1_532;
	word32 a0_533;
	word32 a1_534;
	word32 a2_535;
	word32 a3_536;
	word32 a4_537;
	word32 a5_538;
	word32 a7_539;
	word32 s2_540;
	word32 s3_541;
	word32 s4_542;
	word32 s5_543;
	word32 s6_544;
	word32 s7_545;
	word32 s8_546;
	word32 s9_547;
	word32 s10_548;
	word32 s11_549;
	word32 t4_550;
	ra_141 = printf(ra_324, a0_400, a3_319, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_532, out a0_533, out a1_534, out a2_535, out a3_536, out a4_537, out a5_538, out a7_539, out s2_540, out s3_541, out s4_542, out s5_543, out s6_544, out s7_545, out s8_546, out s9_547, out s10_548, out s11_549, out t4_550);
	goto l2302213C;
}

// 2302221E: Register Eq_2 bl_handle_dynparams(Register Eq_2 ra, Register (ptr32 Eq_99856) a0, Register (ptr32 Eq_99740) a1, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_handle_dynparams(Eq_2 ra, struct Eq_99856 * a0, struct Eq_99740 * a1, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	struct Eq_100077 * a3_14 = a0->ptrFFFE00;
	a0->dw1000E00 = a3_14 | 0x00040000;
	struct Eq_100086 * a4_11 = a0->ptrFFFDFC;
	if ((word32) a4_11->b0048 != 0x00)
	{
		a0->dw1000E00 = a3_14 | 0x00058000;
		a3_14 |= 0x00058000;
	}
	if ((word32) a4_11->b0014 != 0x00)
	{
		struct Eq_100077 * a3_22 = a0->ptrFFFE00;
		a0->dw1000E00 = a3_22 | 0x04000000;
		a3_14 = a3_22 | 0x04000000;
	}
	Eq_2 a4_29 = a3_14->t000C;
	if (a3_14 > (struct Eq_100077 *) 0x05)
		*(union Eq_2 *) 0x0E = a4_29;
	struct Eq_100124 * a5_41 = a3_14->ptr0004;
	if (a3_14 > (struct Eq_100077 *) 0x02)
		a5_41->dw0004 = 0x00;
	ui32 a3_47 = (word32) a0->wFFFE04;
	struct Eq_100137 * a5_55 = a1->ptr001C;
	a0->w1000E04 = (word16) (a3_47 | 0x0100);
	if ((word32) a5_55->b0008 != 0x00)
		a0->w1000E04 = (word16) (a3_47 | 0x0101);
	Eq_2 a3_112 = (word32) (word16) a1;
	if ((word32) a5_55->b0017 != 0x00)
	{
		ui32 a2_76 = (word32) a0->wFFFE04;
		a0->b1000E0E = 0x01;
		a0->w1000E04 = (word16) (a2_76 | 2);
		a0->w1000E14 = (word16) ((word32) a3_112 + 0x0087);
	}
	else
	{
		a0->w1000E14 = (word16) ((word32) a3_112 + 65);
		a0->b1000E0A = ~0x00;
	}
	if (a1 > (struct Eq_99740 *) 0x01)
		a0->w1000E04 = (word16) ((word32) a0->wFFFE04 | 0x0080);
	if ((word32) a5_55->b0015 != 0x00)
	{
		int32 a2_104;
		ui32 a2_100 = (word32) a0->wFFFE04;
		a0->w1000E04 = (word16) (a2_100 | 32);
		if ((word32) a5_55->b0017 != 0x00)
		{
			a0->w1000E04 = (word16) (a2_100 | 96);
			a2_104 = 0x0096;
		}
		else
			a2_104 = 72;
		a3_112 = (word32) a3_112 + a2_104;
		a0->w1000E14 = (word16) a3_112;
	}
	a0->w1000E04 = (word16) ((word32) a0->wFFFE04 | 0x0C);
	ptr32 a4_125 = (word32) a5_55->b0000;
	if (a4_125 == 0x00)
		a0->b1000E06 = 0x00;
	ptr32 a5_129 = (word32) a5_55->b0019;
	if (a5_129 == 0x00)
	{
		a0Out.u0 = <invalid>;
		a3Out = a3_112;
		a4Out = a4_125;
		a5Out = a5_129;
		s3Out = s3;
		return ra;
	}
	else
	{
		ptr32 a5_161;
		Eq_2 a3_165;
		ptr32 a4_166;
		ptr32 s3_173;
		word32 s2_482;
		word32 s4_483;
		word32 s6_485;
		word32 s7_486;
		word32 s8_487;
		word32 s9_488;
		word32 s10_489;
		word32 s11_490;
		word32 t4_491;
		word32 s5_484;
		word32 s1_477;
		word32 a0_478;
		word32 a1_479;
		word32 a2_480;
		word32 a7_481;
		Eq_2 ra_168 = printf(ra, &g_t230B110C, a3_112, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_477, out a0_478, out a1_479, out a2_480, out a3_165, out a4_166, out a5_161, out a7_481, out s2_482, out s3_173, out s4_483, out s5_484, out s6_485, out s7_486, out s8_487, out s9_488, out s10_489, out s11_490, out t4_491);
		a0Out.u0 = <invalid>;
		a3Out = a3_165;
		a4Out = a4_166;
		a5Out = a5_161;
		s3Out = s3_173;
		return ra_168;
	}
}

