pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23022374: Register Eq_2 bl_send_msg(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_powersaving
//      bl_main_denoise
//      bl_main_raw_send
//      bl_main_rate_config
//      bl_main_conf_max_sta
//      bl_main_cfg_task_req
//      bl_send_reset
//      bl_send_monitor_enable
//      bl_send_monitor_channel_set
//      bl_send_version_req
//      bl_send_me_config_req
//      bl_send_me_chan_config_req
//      bl_send_start
//      bl_send_add_if
//      bl_send_remove_if
//      bl_send_scanu_req
//      bl_send_sm_connect_req
//      bl_send_sm_disconnect_req
//      bl_send_apm_start_req
//      bl_send_apm_stop_req
//      bl_send_apm_sta_del_req
Eq_2 bl_send_msg(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 a1_169;
	ptr32 a3_171;
	Eq_2 a5_168;
	ptr32 a4_158;
	Eq_2 ra_164;
	ptr32 s1_179;
	Eq_2 a2_243;
	Eq_2 a5_240;
	Eq_2 s2_160;
	Eq_2 a3_41;
	ptr32 s3_161;
	Eq_2 a4_44 = 0x01000000;
	a3_41 = a3;
	if ((*((word32) a0 + 0x00FFFDE0) >> 2 & 0x01) == 0x00)
	{
		uint32 a5_39 = (a3 & -3) << 16;
		a3_41.u0 = 0x01;
		if (a5_39 >> 16 != 0x01)
		{
			a3_41.u0 = 0x05;
			if (a3 != 0x05)
			{
				a3_41.u0 = 35;
				if (a3 != 35)
				{
					a4_44.u0 = 0x01000401;
					if (a5_39 >> 16 != 0x01000401 && a3 != 50)
					{
						word32 s11_509;
						word32 t4_510;
						word32 s5_503;
						word32 s9_507;
						word32 s10_508;
						word32 s8_506;
						word32 s6_504;
						word32 s7_505;
						word32 a0_497;
						word32 a7_501;
						word32 s4_502;
						word32 a4_500;
						word32 a1_498;
						word32 a3_499;
						word32 s1_496;
						ra_164 = printf(ra, &g_t230B1CF0, 35, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_496, out a0_497, out a1_498, out a2_243, out a3_499, out a4_500, out a5_240, out a7_501, out s2_160, out s3_161, out s4_502, out s5_503, out s6_504, out s7_505, out s8_506, out s9_507, out s10_508, out s11_509, out t4_510);
						goto l230223E8;
					}
				}
			}
		}
	}
	if (*((word32) a0 + 52) != 0x00)
	{
		int32 a2_50 = (word32) *((word32) a1 - 8);
		Eq_2 a5_51 = 65;
		word32 s5_116 = 0x01;
		if (a2_50 != 65)
		{
			a5_51.u0 = 80;
			if (a2_50 != 80)
			{
				a5_51 = (word32) (word16) (a2_50 + ~0x0100040B & ~0x04);
				if (a5_51 != 0x00)
				{
					a5_51.u0 = ~0x02000407;
					s5_116 = (word32) ((a2_50 & ~0x04) < ~0x02000408);
				}
			}
		}
		Eq_2 a0_81;
		Eq_2 a2_83;
		Eq_2 a5_86;
		word32 s1_89;
		Eq_2 s2_90;
		word32 s3_91;
		word32 s4_92;
		word32 a6_536;
		word32 s8_537;
		word32 a3_534;
		word32 a4_535;
		word32 a1_533;
		pvPortMalloc(ra, a3, 64, a3_41, a4_44, a5_51, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_89, out a0_81, out a1_533, out a2_83, out a3_534, out a4_535, out a5_86, out a6_536, out s2_90, out s3_91, out s4_92, out s8_537);
		if (a0_81 == 0x00)
		{
			word32 a4_547;
			word32 a0_544;
			word32 a2_546;
			word32 a1_545;
			word32 s0_542;
			word32 s1_543;
			Eq_2 a3_196;
			word32 a5_548;
			word32 a6_549;
			word32 s4_550;
			word32 t3_551;
			vPortFree(s2_90, a2_83, a5_86, mstatus, dwArg0128, dwArg0168, out s0_542, out s1_543, out a0_544, out a1_545, out a2_546, out a3_196, out a4_547, out a5_548, out a6_549, out s4_550, out t3_551);
			word32 s1_552;
			word32 a0_553;
			word32 a2_554;
			word32 a7_555;
			word32 s4_556;
			word32 s5_557;
			word32 s6_558;
			word32 s7_559;
			word32 s8_560;
			word32 s9_561;
			word32 s10_562;
			word32 s11_563;
			word32 t4_564;
			ra_164 = printf(ra, &g_t230B1D4C, a3_196, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_552, out a0_553, out a1_169, out a2_554, out a3_171, out a4_158, out a5_168, out a7_555, out s2_160, out s3_161, out s4_556, out s5_557, out s6_558, out s7_559, out s8_560, out s9_561, out s10_562, out s11_563, out t4_564);
			s1_179 = ~0x0B;
		}
		else
		{
			word32 a2_101;
			word32 a3_102;
			word32 a4_103;
			word32 a1_540;
			word32 a5_541;
			word32 t1_538;
			word32 a0_539;
			Eq_2 ra_105 = memset(ra, a0_81, 0x00, 64, out t1_538, out a0_539, out a1_540, out a2_101, out a3_102, out a4_103, out a5_541);
			*(union Eq_2 *) 0x40 = a0_81;
			word32 a5_111 = (word32) *((word32) a1 - 8);
			*((word32) a0_81 + 0x0A) = (word16) s1_89;
			*((word32) a0_81 + 0x0C) = s2_90;
			*((word32) a0_81 + 8) = (word16) a5_111;
			*((word32) a0_81 + 16) = s4_92;
			if (s5_116 != 0x00)
				((word32) a0_81 + 24)->u2 = 0x01;
			if (s3_91 != 0x00)
				((word32) a0_81 + 24)->u2 = (word16) ((word32) *((word32) a0_81 + 24) | 2);
			struct Eq_100666 * sp_156;
			Eq_2 s0_165;
			word32 s5_166;
			ptr32 a0_167;
			Eq_2 a2_170;
			word32 t1_178;
			(*((word32) a0 + 32))();
			s1_179 = a0_167;
			if (s5_166 == 0x00)
			{
				word32 s0_565;
				word32 a0_566;
				word32 a2_567;
				word32 a6_568;
				word32 s4_569;
				word32 t3_570;
				vPortFree(s0_165, a2_170, a5_168, mstatus, sp_156->t0158, sp_156->t0198, out s0_565, out s1_179, out a0_566, out a1_169, out a2_567, out a3_171, out a4_158, out a5_168, out a6_568, out s4_569, out t3_570);
			}
		}
l230223F0:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_179;
		a0Out = s1_179;
		a1Out = a1_169;
		a2Out = dwArgB8;
		a3Out = a3_171;
		a4Out = a4_158;
		a5Out = a5_168;
		s2Out = s2_160;
		s3Out = s3_161;
		mstatusOut = mstatus;
		return ra_164;
	}
	word32 s9_522;
	word32 t4_525;
	word32 s10_523;
	word32 s11_524;
	word32 s8_521;
	word32 a4_515;
	word32 s6_519;
	word32 s7_520;
	word32 s5_518;
	word32 a7_516;
	word32 s4_517;
	word32 a1_513;
	word32 a3_514;
	word32 a0_512;
	word32 s1_511;
	ra_164 = printf(ra, &g_t230B1D20, a3_41, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_511, out a0_512, out a1_513, out a2_243, out a3_514, out a4_515, out a5_240, out a7_516, out s2_160, out s3_161, out s4_517, out s5_518, out s6_519, out s7_520, out s8_521, out s9_522, out s10_523, out s11_524, out t4_525);
l230223E8:
	word32 a0_528;
	word32 t3_532;
	word32 s4_531;
	word32 a2_529;
	word32 a6_530;
	word32 s0_526;
	word32 s1_527;
	vPortFree(s2_160, a2_243, a5_240, mstatus, dwArg0128, dwArg0168, out s0_526, out s1_527, out a0_528, out a1_169, out a2_529, out a3_171, out a4_158, out a5_168, out a6_530, out s4_531, out t3_532);
	s1_179 = ~0x0F;
	goto l230223F0;
}

// 230224E0: Register Eq_2 bl_msg_zalloc.constprop.3(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_100734 a5Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      bl_main_powersaving
//      bl_main_denoise
//      bl_main_raw_send
//      bl_main_rate_config
//      bl_main_conf_max_sta
//      bl_main_cfg_task_req
//      bl_send_reset
//      bl_send_monitor_enable
//      bl_send_monitor_channel_set
//      bl_send_version_req
//      bl_send_me_config_req
//      bl_send_me_chan_config_req
//      bl_send_start
//      bl_send_add_if
//      bl_send_remove_if
//      bl_send_scanu_req
//      bl_send_sm_connect_req
//      bl_send_sm_disconnect_req
//      bl_send_apm_start_req
//      bl_send_apm_stop_req
//      bl_send_apm_sta_del_req
Eq_2 bl_msg_zalloc.constprop.3(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_100734 & a5Out, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	Eq_2 ra_128;
	ptr32 a1_121;
	ptr32 a3_122;
	ptr32 a4_123;
	Eq_100734 a5_124;
	Eq_2 a0_27;
	Eq_2 a3_30;
	ptr32 a6_33;
	word32 a1_163;
	word32 a2_164;
	word32 a4_165;
	word32 a5_166;
	word32 s8_167;
	ptr32 s1_129;
	ptr32 s2_134;
	ptr32 s3_135;
	ptr32 s4_136;
	pvPortMalloc(ra, a2, (word32) a2 + 8, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_129, out a0_27, out a1_163, out a2_164, out a3_30, out a4_165, out a5_166, out a6_33, out s2_134, out s3_135, out s4_136, out s8_167);
	Eq_2 s0_42 = a0_27;
	if (a0_27 == 0x00)
	{
		word32 a0_172;
		word32 a2_173;
		word32 a7_174;
		word32 s5_175;
		word32 s7_176;
		word32 s8_177;
		word32 s9_178;
		word32 s10_179;
		word32 s11_180;
		word32 t4_181;
		ra_128 = printf(ra, &g_t230B1C74, a3_30, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_129, out a0_172, out a1_121, out a2_173, out a3_122, out a4_123, out a5_124, out a7_174, out s2_134, out s3_135, out s4_136, out s5_175, out s6, out s7_176, out s8_177, out s9_178, out s10_179, out s11_180, out t4_181);
	}
	else
	{
		word32 t1_168;
		word32 a0_169;
		word32 a2_170;
		word32 a5_171;
		ra_128 = memset(ra, a0_27, 0x00, (word32) a2 + 8, out t1_168, out a0_169, out a1_121, out a2_170, out a3_122, out a4_123, out a5_171);
		*a0_27 = (word16) s3_135;
		*((word32) a0_27 + 2) = (word16) s2_134;
		*((word32) a0_27 + 4) = 100;
		*((word32) a0_27 + 6) = (word16) s1_129;
		a5_124.u0 = 100;
		s0_42 = (word32) a0_27 + 8;
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_129;
	a0Out = s0_42;
	a1Out = a1_121;
	a3Out = a3_122;
	a4Out = a4_123;
	a5Out = a5_124;
	a6Out = a6_33;
	s2Out = s2_134;
	s3Out = s3_135;
	s4Out = s4_136;
	s6Out = s6;
	return ra_128;
}

