pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23022544: Register Eq_2 bl_msg_update_channel_cfg(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      bl_main_set_country_code
//      bl606a0_wifi_init
Eq_2 bl_msg_update_channel_cfg(Eq_2 ra, Eq_2 a0, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	struct Eq_100847 * s3_19 = g_a230B1D80;
	word32 s1_20;
	for (s1_20 = 0x00; s1_20 != 0x04; ++s1_20)
	{
		struct Eq_274 * a0_51;
		int32 a2_30;
		Eq_2 a3_31;
		word32 a4_158;
		word32 a5_159;
		word32 a1_157;
		if (strcmp(s3_19->dw0000, a0, out a1_157, out a2_30, out a3_31, out a4_158, out a5_159) == 0x00)
		{
			g_dw4200F338 = a2_30;
			g_t4200F33C.u0 = 0x4200F000;
			a0_51 = (struct Eq_274 *) &g_t230B1C08;
			goto l23022596;
		}
		++s3_19;
	}
	g_dw4200F338 = 0x0E;
	g_t4200F33C.u0 = 587929332;
	a0_51 = (struct Eq_274 *) &g_t230B1C38;
l23022596:
	ptr32 a5_78;
	ptr32 a3_82;
	ptr32 a4_83;
	ptr32 s3_90;
	word32 t4_156;
	word32 s10_154;
	word32 s11_155;
	word32 s8_152;
	word32 s9_153;
	word32 s6_150;
	word32 s7_151;
	word32 s4_148;
	word32 s5_149;
	word32 a7_146;
	word32 s2_147;
	word32 a1_144;
	word32 a2_145;
	word32 s1_142;
	word32 a0_143;
	Eq_2 ra_85 = printf(ra, a0_51, a3_31, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_142, out a0_143, out a1_144, out a2_145, out a3_82, out a4_83, out a5_78, out a7_146, out s2_147, out s3_90, out s4_148, out s5_149, out s6_150, out s7_151, out s8_152, out s9_153, out s10_154, out s11_155, out t4_156);
	a3Out = a3_82;
	a4Out = a4_83;
	a5Out = a5_78;
	s3Out = s3_90;
	return ra_85;
}

// 230225D8: Register int32 bl_msg_get_channel_nums()
// Called from:
//      bl_main_get_channel_nums
int32 bl_msg_get_channel_nums()
{
	return g_dw4200F338;
}

// 230225E2: Register Eq_2 bl_send_reset(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_send_reset(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a0_18;
	ptr32 a3_21;
	ptr32 a4_22;
	ptr32 a5_23;
	Eq_2 s0_26;
	Eq_2 s3_29;
	Eq_2 s6_40;
	word32 s1_139;
	word32 a1_140;
	word32 a6_141;
	word32 s2_142;
	word32 s4_143;
	Eq_2 ra_25 = bl_msg_zalloc.constprop.3(ra, 0x00, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_26, out s1_139, out a0_18, out a1_140, out a3_21, out a4_22, out a5_23, out a6_141, out s2_142, out s3_29, out s4_143, out s6_40);
	if (a0_18 == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x0B;
		a2Out = dwArg10;
		a3Out = a3_21;
		a4Out = a4_22;
		a5Out = a5_23;
		mstatusOut = mstatus;
		return ra_25;
	}
	else
	{
		Eq_2 a2_57;
		ptr32 a3_58;
		ptr32 a4_59;
		ptr32 a5_60;
		ptr32 mstatus_63;
		ptr32 s0_65;
		ptr32 a0_82;
		word32 s1_144;
		word32 a1_145;
		word32 s2_146;
		word32 s3_147;
		Eq_2 ra_64 = bl_send_msg(ra_25, s0_26, a0_18, 0x01, s3_29, s6_40, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_65, out s1_144, out a0_82, out a1_145, out a2_57, out a3_58, out a4_59, out a5_60, out s2_146, out s3_147, out mstatus_63);
		s0Out = s0_65;
		a0Out = a0_82;
		a2Out = a2_57;
		a3Out = a3_58;
		a4Out = a4_59;
		a5Out = a5_60;
		mstatusOut = mstatus_63;
		return ra_64;
	}
}

// 23022614: void bl_send_monitor_enable(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_monitor
void bl_send_monitor_enable(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_20;
	Eq_2 s0_28;
	Eq_2 s3_31;
	Eq_2 s6_42;
	word32 s1_137;
	word32 a1_138;
	word32 a3_139;
	word32 a4_140;
	word32 a5_141;
	word32 a6_142;
	word32 s2_143;
	word32 s4_144;
	Eq_2 ra_27 = bl_msg_zalloc.constprop.3(ra, 0x04, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_28, out s1_137, out a0_20, out a1_138, out a3_139, out a4_140, out a5_141, out a6_142, out s2_143, out s3_31, out s4_144, out s6_42);
	if (a0_20 == 0x00)
		return;
	*(union Eq_2 *) 0x01 = a0_20;
	word32 s0_145;
	word32 s1_146;
	word32 a0_147;
	word32 a1_148;
	word32 a2_149;
	word32 a3_150;
	word32 a4_151;
	word32 a5_152;
	word32 s2_153;
	word32 s3_154;
	word32 mstatus_155;
	bl_send_msg(ra_27, s0_28, a0_20, 93, s3_31, s6_42, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_145, out s1_146, out a0_147, out a1_148, out a2_149, out a3_150, out a4_151, out a5_152, out s2_153, out s3_154, out mstatus_155);
}

