pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23022650: void bl_send_monitor_channel_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack word32 dwArg84, Stack Eq_2 dwArg8C, Stack up32 dwArgA4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_monitor_channel_set
void bl_send_monitor_channel_set(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, word32 dwArg84, Eq_2 dwArg8C, up32 dwArgA4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_25;
	word32 a3_28;
	up32 s0_33;
	Eq_2 s1_34;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 s4_232;
	word32 a5_229;
	word32 a6_230;
	word32 s2_231;
	word32 a1_227;
	word32 a4_228;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x0C, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_33, out s1_34, out a0_25, out a1_227, out a3_28, out a4_228, out a5_229, out a6_230, out s2_231, out s3_36, out s4_232, out s6_47);
	if (a0_25 == 0x00)
		return;
	union Eq_2 * s0_61;
	if (dwArgA4 >= s0_33 + -1)
	{
		if (dwArg84 != 0x0E)
			s0_61 = (word32) (word16) (dwArg84 + 0x00FFF96C);
		else
			s0_61 = (union Eq_2 *) 0x00FFF9B4;
	}
	else
		s0_61 = (union Eq_2 *) 0x0FFFFFFF;
	*s0_61 = (union Eq_2 *) a0_25;
	if (a3_28 != 0x00)
	{
		*(union Eq_2 *) 0x05 = a0_25;
		if (a3_28 != 0x01)
		{
			*(union Eq_2 *) 0x09 = a0_25;
			goto l230226B8;
		}
	}
	else
		*((word32) a0_25 + 4) = 0x00;
	*((word32) a0_25 + 8) = 0x00;
l230226B8:
	word32 s0_233;
	word32 a2_237;
	word32 a0_235;
	word32 a1_236;
	word32 s1_234;
	word32 a3_238;
	word32 a4_239;
	word32 a5_240;
	word32 s2_241;
	word32 s3_242;
	word32 mstatus_243;
	bl_send_msg(ra_32, s1_34, a0_25, 95, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, s1, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_233, out s1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out s2_241, out s3_242, out mstatus_243);
}

// 230226DE: Register Eq_2 bl_send_version_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_send_version_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & mstatusOut)
{
	Eq_2 a0_20;
	Eq_2 s0_28;
	Eq_2 s3_31;
	Eq_2 s6_42;
	word32 s1_138;
	word32 a1_139;
	word32 a3_140;
	word32 a4_141;
	word32 a5_142;
	word32 a6_143;
	word32 s2_144;
	word32 s4_145;
	Eq_2 ra_27 = bl_msg_zalloc.constprop.3(ra, 0x00, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_28, out s1_138, out a0_20, out a1_139, out a3_140, out a4_141, out a5_142, out a6_143, out s2_144, out s3_31, out s4_145, out s6_42);
	if (a0_20 == 0x00)
	{
		s0Out = s0_28;
		a0Out = ~0x0B;
		mstatusOut = mstatus;
		return ra_27;
	}
	else
	{
		ptr32 mstatus_65;
		Eq_2 s0_67;
		ptr32 a0_84;
		word32 s1_146;
		word32 a1_147;
		word32 a2_148;
		word32 a3_149;
		word32 a4_150;
		word32 a5_151;
		word32 s2_152;
		word32 s3_153;
		Eq_2 ra_66 = bl_send_msg(ra_27, s0_28, a0_20, 0x05, s3_31, s6_42, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_67, out s1_146, out a0_84, out a1_147, out a2_148, out a3_149, out a4_150, out a5_151, out s2_152, out s3_153, out mstatus_65);
		s0Out = s0_67;
		a0Out = a0_84;
		mstatusOut = mstatus_65;
		return ra_66;
	}
}

// 23022712: Register Eq_2 bl_send_me_config_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_send_me_config_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_23;
	Eq_2 a3_26;
	ptr32 a4_27;
	ptr32 a5_28;
	ptr32 s3_34;
	word32 s0_232;
	word32 s1_233;
	word32 a1_234;
	word32 a6_235;
	word32 s2_236;
	word32 s4_237;
	word32 s6_238;
	Eq_2 ra_30 = bl_msg_zalloc.constprop.3(ra, 52, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_232, out s1_233, out a0_23, out a1_234, out a3_26, out a4_27, out a5_28, out a6_235, out s2_236, out s3_34, out s4_237, out s6_238);
	if (a0_23 == 0x00)
	{
		0x00 = (int8) dwArg38;
		a3Out = a3_26;
		a4Out = a4_27;
		a5Out = a5_28;
		s3Out = s3_34;
		mstatusOut = mstatus;
		return ra_30;
	}
	else
	{
		word32 s1_68;
		Eq_2 s2_71;
		Eq_2 s3_72;
		Eq_2 s6_75;
		word32 a0_239;
		word32 a1_240;
		word32 a2_241;
		word32 a3_242;
		word32 a4_243;
		word32 a5_244;
		word32 a7_245;
		word32 s4_246;
		word32 s5_247;
		word32 s7_248;
		word32 s8_249;
		word32 s9_250;
		word32 s10_251;
		word32 s11_252;
		word32 t4_253;
		Eq_2 ra_67 = printf(ra_30, &g_t230B1CD0, a3_26, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_68, out a0_239, out a1_240, out a2_241, out a3_242, out a4_243, out a5_244, out a7_245, out s2_71, out s3_72, out s4_246, out s5_247, out s6_75, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out t4_253);
		((word32) a0_23 + 46)->u2 = 0x01;
		struct Eq_101284 * a4_82 = (word32) s2_71 + s1_68;
		*a0_23 = (word16) (word32) a4_82->wFFFFFE04;
		*((word32) a0_23 + 2) = (byte) ((word32) a4_82->bFFFFFE08 << 2 | (word32) a4_82->bFFFFFE07);
		byte * a5_102;
		struct Eq_101313 * a4_100 = (word32) a0_23 + 3;
		byte * s1_95 = (word32) s2_71 + (s1_68 + -486);
		for (a5_102 = (word32) s2_71 + (s1_68 + -502); a5_102 != s1_95; ++a5_102)
		{
			++a4_100;
			a4_100[0x0FFF] = (struct Eq_101313) (byte) (word32) *a5_102;
		}
		*((word32) a0_23 + 20) = 0x00;
		*((word32) a0_23 + 24) = 0x00;
		*((word32) a0_23 + 28) = 0x00;
		*((word32) a0_23 + 48) = (byte) (word32) *((word32) *((word32) s2_71 + 0x00FFFDFC) + 56);
		*((word32) a0_23 + 44) = *((word32) *((word32) s2_71 + 0x00FFFDFC) + 60);
		0x00 = (int8) dwArg38;
		Eq_2 a3_132;
		ptr32 a4_133;
		ptr32 a5_134;
		ptr32 mstatus_137;
		ptr32 s3_144;
		word32 s0_254;
		word32 s1_255;
		word32 a0_256;
		word32 a1_257;
		word32 a2_258;
		word32 s2_259;
		Eq_2 ra_138 = bl_send_msg(ra_67, s2_71, a0_23, 0x01000401, s3_72, s6_75, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_254, out s1_255, out a0_256, out a1_257, out a2_258, out a3_132, out a4_133, out a5_134, out s2_259, out s3_144, out mstatus_137);
		a3Out = a3_132;
		a4Out = a4_133;
		a5Out = a5_134;
		s3Out = s3_144;
		mstatusOut = mstatus_137;
		return ra_138;
	}
}

// 230227D6: Register Eq_2 bl_send_me_chan_config_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out (ptr32 Eq_98069) s0Out, Register out ptr32 a1Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_set_country_code
//      bl_main_rtthread_start
Eq_2 bl_send_me_chan_config_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, struct Eq_98069 & s0Out, ptr32 & a1Out, ptr32 & mstatusOut)
{
	Eq_2 a0_19;
	ptr32 a1_20;
	Eq_2 s0_27;
	Eq_2 s3_30;
	Eq_2 s6_41;
	word32 s1_258;
	word32 a3_259;
	word32 a4_260;
	word32 a5_261;
	word32 a6_262;
	word32 s2_263;
	word32 s4_264;
	Eq_2 ra_26 = bl_msg_zalloc.constprop.3(ra, 0x00FE, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_27, out s1_258, out a0_19, out a1_20, out a3_259, out a4_260, out a5_261, out a6_262, out s2_263, out s3_30, out s4_264, out s6_41);
	if (a0_19 == 0x00)
	{
		s0Out = s0;
		a1Out = a1_20;
		mstatusOut = mstatus;
		return ra_26;
	}
	else
	{
		((word32) a0_19 + 252)->u0 = 0x00;
		int32 a2_106;
		for (a2_106 = 0x34; a2_106 < g_dw4200F338; ++a2_106)
		{
			word32 a4_63 = (word32) *((word32) a0_19 + 252);
			struct Eq_101438 * a5_70 = (word32) a0_19 + (a4_63 + 0x06);
			a5_70->b0003 = 0x00;
			int32 a0_65 = a2_106 + 0;
			if (((word32) g_t4200F33C + a0_65 + 8 & 0x01) != 0x00)
				a5_70->b0003 = 0x02;
			ui32 t0_82 = (word32) a5_70->b0003;
			ui32 a3_85 = (word32) g_t4200F33C + a0_65 + 8;
			a5_70->b0002 = 0x00;
			a5_70->b0003 = (byte) ((word32) ((a3_85 & 0x0A) != 0x00) | t0_82);
			a5_70->w0000 = (word16) (word32) ((word32) g_t4200F33C + a0_65 + 2);
			a5_70->t0004 = g_t4200F33C;
			ui32 a5_100 = a4_63 + 1 & 0x00FF;
			*((word32) a0_19 + 252) = (byte) a5_100;
			if (a5_100 == 0x0E)
				break;
		}
		*((word32) a0_19 + 0x00FD) = 0x00;
		ptr32 a1_135;
		ptr32 mstatus_142;
		struct Eq_98069 * s0_144;
		word32 s1_265;
		word32 a0_266;
		word32 a2_267;
		word32 a3_268;
		word32 a4_269;
		word32 a5_270;
		word32 s2_271;
		word32 s3_272;
		Eq_2 ra_143 = bl_send_msg(ra_26, s0_27, a0_19, 0x01000403, s3_30, s6_41, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_144, out s1_265, out a0_266, out a1_135, out a2_267, out a3_268, out a4_269, out a5_270, out s2_271, out s3_272, out mstatus_142);
		s0Out = s0_144;
		a1Out = a1_135;
		mstatusOut = mstatus_142;
		return ra_143;
	}
}

// 230228A8: void bl_send_me_rate_config_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_rate_config
void bl_send_me_rate_config_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_27;
	Eq_2 s0_35;
	word32 s1_36;
	word32 s2_37;
	Eq_2 s3_38;
	Eq_2 s6_49;
	word32 a1_148;
	word32 a3_149;
	word32 a4_150;
	word32 a5_151;
	word32 a6_152;
	word32 s4_153;
	Eq_2 ra_34 = bl_msg_zalloc.constprop.3(ra, 0x04, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_35, out s1_36, out a0_27, out a1_148, out a3_149, out a4_150, out a5_151, out a6_152, out s2_37, out s3_38, out s4_153, out s6_49);
	if (a0_27 == 0x00)
		0x00 = dwArg38;
	else
	{
		*a0_27 = (byte) s2_37;
		*((word32) a0_27 + 2) = (word16) s1_36;
		0x00 = dwArg38;
		word32 s0_154;
		word32 s1_155;
		word32 a0_156;
		word32 a1_157;
		word32 a2_158;
		word32 a3_159;
		word32 a4_160;
		word32 a5_161;
		word32 s2_162;
		word32 s3_163;
		word32 mstatus_164;
		bl_send_msg(ra_34, s0_35, a0_27, 0x00, s3_38, s6_49, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_154, out s1_155, out a0_156, out a1_157, out a2_158, out a3_159, out a4_160, out a5_161, out s2_162, out s3_163, out mstatus_164);
	}
}

// 230228F6: Register word32 bl_send_start(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a0Out)
// Called from:
//      bl_main_phy_up
word32 bl_send_start(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a0Out)
{
	Eq_2 a0_22;
	Eq_2 s1_31;
	Eq_2 s3_33;
	Eq_2 s6_44;
	word32 s0_172;
	word32 a1_173;
	word32 a3_174;
	word32 a4_175;
	word32 a5_176;
	word32 a6_177;
	word32 s2_178;
	word32 s4_179;
	Eq_2 ra_29 = bl_msg_zalloc.constprop.3(ra, 72, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_172, out s1_31, out a0_22, out a1_173, out a3_174, out a4_175, out a5_176, out a6_177, out s2_178, out s3_33, out s4_179, out s6_44);
	if (a0_22 == 0x00)
	{
		0x00 = (int8) dwArg38;
		a0Out = ~0x0B;
		return s0;
	}
	else
	{
		*((word32) s1_31 + 0x01000E2C) = 0x01;
		word32 a1_180;
		word32 a2_181;
		word32 a3_182;
		word32 a4_183;
		word32 a5_184;
		word32 a6_185;
		word32 a7_186;
		memcpy(a0_22, (word32) s1_31 + 0x00FFFE2C, 64, out a1_180, out a2_181, out a3_182, out a4_183, out a5_184, out a6_185, out a7_186);
		*((word32) *((word32) *((word32) s1_31 + 0x00FFFDFC) + 16) + 64) = a0_22;
		*((word32) a0_22 + 0x0044) = *((word32) *((word32) s1_31 + 0x00FFFDFC) + 52);
		0x00 = (int8) dwArg38;
		word32 s0_97;
		ptr32 a0_114;
		word32 s1_187;
		word32 a1_188;
		word32 a2_189;
		word32 a3_190;
		word32 a4_191;
		word32 a5_192;
		word32 s2_193;
		word32 s3_194;
		word32 mstatus_195;
		bl_send_msg(ra_29, s1_31, a0_22, 0x03, s3_33, s6_44, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_97, out s1_187, out a0_114, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out s2_193, out s3_194, out mstatus_195);
		a0Out = a0_114;
		return s0_97;
	}
}

// 23022964: Register Eq_2 bl_send_add_if(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg94, Stack Eq_2 dwArgD8, Stack ptr32 dwArgE4, Stack Eq_2 dwArgF8, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_if_add
Eq_2 bl_send_add_if(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg94, Eq_2 dwArgD8, ptr32 dwArgE4, Eq_2 dwArgF8, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_28;
	ptr32 a3_31;
	word32 s1_37;
	Eq_2 s2_38;
	Eq_2 s3_39;
	Eq_2 s6_50;
	word32 s0_211;
	word32 a1_212;
	word32 a4_213;
	word32 a5_214;
	word32 a6_215;
	word32 s4_216;
	Eq_2 ra_35 = bl_msg_zalloc.constprop.3(ra, 0x08, a3, a4, a5, a1, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, s3, dwArgD8, dwArgF8, dwArg0118, out s0_211, out s1_37, out a0_28, out a1_212, out a3_31, out a4_213, out a5_214, out a6_215, out s2_38, out s3_39, out s4_216, out s6_50);
	if (a0_28 == 0x00)
	{
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		a3Out = a3_31;
		mstatusOut = mstatus;
		return ra_35;
	}
	else
	{
		word32 a4_64;
		word32 a1_67;
		word32 a3_69;
		word32 a2_217;
		word32 a5_218;
		word32 a6_219;
		word32 a7_220;
		memcpy((word32) a0_28 + 1, s3_39, 0x06, out a1_67, out a2_217, out a3_69, out a4_64, out a5_218, out a6_219, out a7_220);
		if (dwArg94 > 0x08)
		{
			*a0_28 = 0x00;
			0x00 = (int8) dwArg0128;
			ptr32 a3_92;
			ptr32 mstatus_97;
			ptr32 s0_99;
			word32 s1_221;
			word32 a0_222;
			word32 a1_223;
			word32 a2_224;
			word32 a4_225;
			word32 a5_226;
			word32 s2_227;
			word32 s3_228;
			Eq_2 ra_98 = bl_send_msg(ra_35, s2_38, a0_28, 0x07, s3_39, s6_50, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_99, out s1_221, out a0_222, out a1_223, out a2_224, out a3_92, out a4_225, out a5_226, out s2_227, out s3_228, out mstatus_97);
			s0Out = s0_99;
			a3Out = a3_92;
			mstatusOut = mstatus_97;
			return ra_98;
		}
		else
		{
			Eq_2 ra_128;
			ptr32 s0_129;
			ptr32 a3_134;
			ptr32 mstatus_135;
			word32 t5_149;
			word32 t6_150;
			g_t230B1148();
			s0Out = s0_129;
			a3Out = a3_134;
			mstatusOut = mstatus_135;
			return ra_128;
		}
	}
}

