pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230229FC: Register Eq_2 bl_send_remove_if(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_if_remove
Eq_2 bl_send_remove_if(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_22;
	ptr32 a3_25;
	Eq_2 s0_30;
	word32 s1_31;
	Eq_2 s3_33;
	Eq_2 s6_44;
	word32 a1_142;
	word32 a4_143;
	word32 a5_144;
	word32 a6_145;
	word32 s2_146;
	word32 s4_147;
	Eq_2 ra_29 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_30, out s1_31, out a0_22, out a1_142, out a3_25, out a4_143, out a5_144, out a6_145, out s2_146, out s3_33, out s4_147, out s6_44);
	if (a0_22 == 0x00)
	{
		a3Out = a3_25;
		mstatusOut = mstatus;
		return ra_29;
	}
	else
	{
		*a0_22 = (byte) s1_31;
		ptr32 a3_65;
		ptr32 mstatus_70;
		word32 s0_148;
		word32 s1_149;
		word32 a0_150;
		word32 a1_151;
		word32 a2_152;
		word32 a4_153;
		word32 a5_154;
		word32 s2_155;
		word32 s3_156;
		Eq_2 ra_71 = bl_send_msg(ra_29, s0_30, a0_22, 0x09, s3_33, s6_44, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_148, out s1_149, out a0_150, out a1_151, out a2_152, out a3_65, out a4_153, out a5_154, out s2_155, out s3_156, out mstatus_70);
		a3Out = a3_65;
		mstatusOut = mstatus_70;
		return ra_71;
	}
}

// 23022A3A: Register word32 bl_send_scanu_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_scan
word32 bl_send_scanu_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_18;
	Eq_2 a3_21;
	Eq_2 s0_26;
	Eq_2 s3_29;
	Eq_2 s6_40;
	word32 s1_191;
	word32 a1_192;
	word32 a4_193;
	word32 a5_194;
	word32 a6_195;
	word32 s2_196;
	word32 s4_197;
	Eq_2 ra_25 = bl_msg_zalloc.constprop.3(ra, 340, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_26, out s1_191, out a0_18, out a1_192, out a3_21, out a4_193, out a5_194, out a6_195, out s2_196, out s3_29, out s4_197, out s6_40);
	if (a0_18 == 0x00)
		return s0;
	Eq_46327 a5_50 = *((word32) s0_26 + 0x00FFFE1C);
	*((word32) a0_18 + 332) = 0x00;
	*((word32) a0_18 + 334) = (byte) a5_50;
	int32 a4_55 = g_dw4200F338;
	word32 a5_58 = (word32) *((word32) *a3_21 + 4);
	*((word32) a0_18 + 335) = (byte) a4_55;
	*((word32) a0_18 + 320) = a3_21;
	*((word32) a0_18 + 0x0144) = (word16) a5_58;
	*((word32) a0_18 + 336) = 0x0100;
	((word32) a0_18 + 328)->u0 = 0x00;
	Eq_2 a5_65 = a0_18;
	int32 a2_66;
	for (a2_66 = 0x34; a2_66 < (a4_55 & 0x00FF); ++a2_66)
	{
		struct Eq_101938 * a4_81 = (word32) g_t4200F33C + (a2_66 + 0);
		a5_65 = (word32) a5_65 + 6;
		*((word32) a5_65 + 0x0FFC) = (byte) (word32) a4_81->b0000;
		word32 t1_84 = (word32) a4_81->w0002;
		*((word32) a5_65 + 0x0FFD) = 0x01;
		*((word32) a5_65 + 0x0FFA) = (word16) t1_84;
		*((word32) a5_65 + 0x0FFE) = a4_81->b0014;
	}
	word32 s0_113;
	word32 s1_198;
	word32 a0_199;
	word32 a1_200;
	word32 a2_201;
	word32 a3_202;
	word32 a4_203;
	word32 a5_204;
	word32 s2_205;
	word32 s3_206;
	word32 mstatus_207;
	bl_send_msg(ra_25, s0_26, a0_18, 0x00, s3_29, s6_40, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_113, out s1_198, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out s2_205, out s3_206, out mstatus_207);
	return s0_113;
}

// 23022AEC: void bl_send_scanu_raw_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack Eq_2 dwArg0138)
// Called from:
//      bl_main_raw_send
void bl_send_scanu_raw_send(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128, Eq_2 dwArg0138)
{
	Eq_2 a0_28;
	word32 s0_36;
	Eq_2 s1_37;
	word32 s2_38;
	Eq_2 s3_39;
	Eq_2 s6_50;
	word32 a1_140;
	word32 a3_141;
	word32 a4_142;
	word32 a5_143;
	word32 a6_144;
	word32 s4_145;
	Eq_2 ra_35 = bl_msg_zalloc.constprop.3(ra, 0x08, a3, a4, a5, a1, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, s3, dwArgD8, dwArgF8, dwArg0118, out s0_36, out s1_37, out a0_28, out a1_140, out a3_141, out a4_142, out a5_143, out a6_144, out s2_38, out s3_39, out s4_145, out s6_50);
	if (a0_28 != 0x00)
	{
		*a0_28 = s3_39;
		*((word32) a0_28 + 4) = s2_38;
		word32 s0_146;
		word32 s1_147;
		word32 a0_148;
		word32 a1_149;
		word32 a2_150;
		word32 a3_151;
		word32 a4_152;
		word32 a5_153;
		word32 s2_154;
		word32 s3_155;
		word32 mstatus_156;
		bl_send_msg(ra_35, s1_37, a0_28, s0_36 + 6, s3_39, s6_50, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, s3, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_146, out s1_147, out a0_148, out a1_149, out a2_150, out a3_151, out a4_152, out a5_153, out s2_154, out s3_155, out mstatus_156);
	}
	0x00 = dwArg0128;
}

// 23022B38: Register Eq_2 bl_send_sm_connect_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out (ptr32 Eq_99351) a4Out)
// Called from:
//      bl_cfg80211_connect
Eq_2 bl_send_sm_connect_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, struct Eq_99351 & a4Out)
{
	Eq_2 a0_463;
	Eq_2 a0_30;
	struct Eq_102068 * a5_35;
	Eq_2 s3_41;
	Eq_2 s6_52;
	word32 a3_967;
	word32 s4_970;
	word32 a6_968;
	word32 s2_969;
	word32 s0_965;
	word32 s1_966;
	Eq_2 a1_144;
	struct Eq_99351 * a4_34;
	Eq_2 ra_37 = bl_msg_zalloc.constprop.3(ra, 452, a3, a4, a5, a0, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_965, out s1_966, out a0_30, out a1_144, out a3_967, out a4_34, out a5_35, out a6_968, out s2_969, out s3_41, out s4_970, out s6_52);
	if (a0_30 == 0x00)
	{
		a0_463.u0 = ~0x0B;
		goto l23022CDA;
	}
	struct Eq_102100 * s0_57 = a5_35->ptr0060;
	Eq_2 s2_203 = 0x00;
	if (a5_35 != null)
	{
		s0_57 = a4_34->ptr0064;
		s2_203.u0 = 0x04;
		if (a4_34 > (struct Eq_99351 *) ~0x000FAC01)
		{
			s2_203.u0 = 0x00;
			if (a4_34 == (struct Eq_99351 *) 1027077)
				s2_203.u0 = 0x04;
		}
	}
	if ((word32) s0_57->b0084 != 0x00)
		s2_203 |= 1;
	if ((word32) s0_57->b0088 != 0x00)
		s2_203 |= 2;
	struct Eq_102132 * s0_84 = a4_34->ptr005C;
	if ((a4_34 & ~0x04) != 0x000FAC01)
		s2_203 |= 8;
	if ((word32) s0_84->b0055 == 0x01)
		s2_203 |= 16;
	struct Eq_102150 * a5_100 = (word32) s0_84->w0086;
	if (a5_100 == null)
		a5_100 = (struct Eq_102150 *) 0x08FFF88E;
	struct Eq_102159 * a4_115;
	Eq_2 a3_124;
	Eq_2 a2_130;
	*((word32) a0_30 + 52) = (word16) a5_100;
	struct Eq_102166 * s0_109 = a5_100->ptr0038;
	if (a5_100 == null)
	{
l23022C0C:
		word32 a5_971;
		word32 a6_972;
		word32 a7_973;
		memcpy((word32) a0_30 + 0x0022, 588036424, 0x06, out a1_144, out a2_130, out a3_124, out a4_115, out a5_971, out a6_972, out a7_973);
		goto l23022C58;
	}
	else
	{
		struct Eq_102150 * a3_110 = (word32) a5_100->b0000;
		if (a3_110 == (struct Eq_102150 *) 0x00FF)
		{
			struct Eq_102150 * a2_118 = (word32) a5_100->b0001;
			a4_115 = null;
			if (a2_118 == a3_110)
			{
				struct Eq_102150 * a3_120 = (word32) a5_100->b0002;
				if (a3_120 == a2_118)
				{
					struct Eq_102150 * a2_121 = (word32) a5_100->b0003;
					if (a2_121 == a3_120)
					{
						struct Eq_102150 * a3_122 = (word32) a5_100->b0004;
						if (a3_122 == a2_121)
						{
							a5_100 = (word32) a5_100->b0005;
							if (a5_100 == a3_122)
								goto l23022C0C;
						}
					}
				}
			}
			goto l23022C40;
		}
		if (a3_110 == null && ((word32) a5_100->b0001 == 0x00 && ((word32) a5_100->b0002 == 0x00 && (word32) a5_100->b0003 == 0x00)))
		{
			a4_115 = (word32) a5_100->b0004;
			if (a4_115 == null)
			{
				a5_100 = (word32) a5_100->b0005;
				if (a5_100 != null)
				{
l23022C40:
					a3_124.u0 = 0x06;
					do
					{
						s0_109 = a5_100->ptr0038;
						a2_130 = CONVERT(Mem126[a5_100 + a4_115:byte], byte, word32);
						a5_100 = a0_30 + a4_115;
						a5_100->b0022 = (byte) a2_130;
						++a4_115;
					} while (a4_115 != (struct Eq_102159 *) 0x06);
l23022C58:
					*((word32) a0_30 + 61) = *((word32) s3_41 + 0x00FFFE1C);
					if ((word32) s0_109->w0002 != 0x00)
					{
						*((word32) a0_30 + 42) = (byte) (word32) s0_109->b0000;
						ui32 a5_179 = (word32) s0_109->w0002;
						*((word32) a0_30 + 40) = (word16) a5_179;
						*((word32) a0_30 + 43) = (byte) (word32) ((a5_179 & 0x0A) != 0x00);
					}
					else
						((word32) a0_30 + 40)->u0 = ~0x00;
					struct Eq_102159 * a5_185;
					for (a5_185 = null; a5_185 < a4_115; ++a5_185)
					{
						a3_124 = CONVERT(Mem187[a4_115 + a5_185:byte], byte, word32);
						a4_115 = a0_30 + a5_185;
						a4_115[1] = (struct Eq_102159) (byte) a3_124;
					}
					*a0_30 = (byte) a4_115;
					*((word32) a0_30 + 48) = s2_203;
					struct Eq_102337 * a5_212 = (struct Eq_102337 *) 0x0100;
					if (a2_130 <= 0x0100)
					{
						if (a2_130 != 0x00)
						{
							word32 a6_995;
							word32 a2_993;
							word32 a4_994;
							word32 a7_996;
							word32 a1_992;
							memcpy((word32) a0_30 + 64, a1_144, a2_130, out a1_992, out a2_993, out a3_124, out a4_994, out a5_212, out a6_995, out a7_996);
						}
						Eq_2 s0_242 = a5_212->t0050;
						*((word32) a0_30 + 54) = (word16) a5_212;
						word32 a4_251 = (word32) *((word32) *((byte) a3_124.u0 + 44) + 48);
						*((word32) a0_30 + 56) = (word16) a3_124;
						*((word32) a0_30 + 58) = (byte) (a4_251 ^ 1);
						word32 a4_256 = (word32) *((word32) s0_242 + 72);
						if (a4_256 == 0x08)
							a4_256 = 0x00;
						*((word32) a0_30 + 59) = (byte) a4_256;
						*((word32) a0_30 + 60) = g_t4200D0B0;
						((word32) a0_30 + 320)->u0 = 0x01;
						Eq_2 a2_268 = (word32) *((word32) s0_242 + 0x009C);
						if (a2_268 != 0x00)
						{
							word32 a4_1000;
							word32 a5_1001;
							word32 a1_997;
							word32 a2_998;
							word32 a3_999;
							word32 a7_1003;
							word32 a6_1002;
							memcpy((word32) a0_30 + 0x0141, *((word32) s0_242 + 0x0094), a2_268, out a1_997, out a2_998, out a3_999, out a4_1000, out a5_1001, out a6_1002, out a7_1003);
						}
						Eq_2 a2_286 = (word32) *((word32) s0_242 + 0x009D);
						if (a2_286 != 0x00)
						{
							word32 a1_1004;
							word32 a6_1009;
							word32 a7_1010;
							word32 a3_1006;
							word32 a2_1005;
							word32 a4_1007;
							word32 a5_1008;
							memcpy((word32) a0_30 + 0x0181, *((word32) s0_242 + 0x0098), a2_286, out a1_1004, out a2_1005, out a3_1006, out a4_1007, out a5_1008, out a6_1009, out a7_1010);
						}
						struct Eq_99351 * a4_412;
						Eq_2 a0_435;
						word32 a2_1014;
						word32 a3_1015;
						word32 a5_1016;
						word32 s2_1017;
						word32 s3_1018;
						word32 mstatus_1019;
						word32 s0_1011;
						word32 s1_1012;
						word32 a1_1013;
						bl_send_msg(ra_37, s3_41, a0_30, 33552385, s3_41, s6_52, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, s1, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_1011, out s1_1012, out a0_435, out a1_1013, out a2_1014, out a3_1015, out a4_412, out a5_1016, out s2_1017, out s3_1018, out mstatus_1019);
						a4Out = a4_412;
						return a0_435;
					}
					word32 s1_974;
					word32 a0_975;
					word32 a1_976;
					word32 a2_977;
					word32 s2_981;
					word32 s3_982;
					word32 s5_984;
					word32 s6_985;
					word32 s7_986;
					word32 s8_987;
					word32 s9_988;
					word32 a3_978;
					word32 s10_989;
					word32 s4_983;
					word32 a5_979;
					word32 a7_980;
					word32 s11_990;
					word32 t4_991;
					printf(ra_37, &g_t230AE870, a3_124, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_974, out a0_975, out a1_976, out a2_977, out a3_978, out a4_34, out a5_979, out a7_980, out s2_981, out s3_982, out s4_983, out s5_984, out s6_985, out s7_986, out s8_987, out s9_988, out s10_989, out s11_990, out t4_991);
					a0_463.u0 = ~0x15;
l23022CDA:
					a4Out = a4_34;
					return a0_463;
				}
				goto l23022C0C;
			}
		}
		a4_115 = null;
		goto l23022C40;
	}
}

// 23022D7E: void bl_send_sm_disconnect_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_disconnect
void bl_send_sm_disconnect_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_25;
	Eq_2 s0_33;
	word32 s1_34;
	word32 s2_35;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 a1_149;
	word32 a3_150;
	word32 a4_151;
	word32 a5_152;
	word32 a6_153;
	word32 s4_154;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x04, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_33, out s1_34, out a0_25, out a1_149, out a3_150, out a4_151, out a5_152, out a6_153, out s2_35, out s3_36, out s4_154, out s6_47);
	if (a0_25 == 0x00)
		0x00 = (int8) dwArg38;
	else
	{
		*a0_25 = (word16) s2_35;
		*((word32) a0_25 + 2) = *((word32) s0_33 + 0x00FFFE1C);
		0x00 = (int8) dwArg38;
		word32 s0_155;
		word32 s1_156;
		word32 a0_157;
		word32 a1_158;
		word32 a2_159;
		word32 a3_160;
		word32 a4_161;
		word32 a5_162;
		word32 s2_163;
		word32 s3_164;
		word32 mstatus_165;
		bl_send_msg(ra_32, s0_33, a0_25, s1_34 + -2044, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_155, out s1_156, out a0_157, out a1_158, out a2_159, out a3_160, out a4_161, out a5_162, out s2_163, out s3_164, out mstatus_165);
	}
}

// 23022DD4: void bl_send_mm_powersaving_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_powersaving
void bl_send_mm_powersaving_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_22;
	Eq_2 s0_30;
	word32 s1_31;
	Eq_2 s3_33;
	Eq_2 s6_44;
	word32 a1_140;
	word32 a3_141;
	word32 a4_142;
	word32 a5_143;
	word32 a6_144;
	word32 s2_145;
	word32 s4_146;
	Eq_2 ra_29 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_30, out s1_31, out a0_22, out a1_140, out a3_141, out a4_142, out a5_143, out a6_144, out s2_145, out s3_33, out s4_146, out s6_44);
	if (a0_22 == 0x00)
		return;
	*a0_22 = (byte) s1_31;
	word32 s0_147;
	word32 s1_148;
	word32 a0_149;
	word32 a1_150;
	word32 a2_151;
	word32 a3_152;
	word32 a4_153;
	word32 a5_154;
	word32 s2_155;
	word32 s3_156;
	word32 mstatus_157;
	bl_send_msg(ra_29, s0_30, a0_22, 50, s3_33, s6_44, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_147, out s1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_153, out a5_154, out s2_155, out s3_156, out mstatus_157);
}

