pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23022E16: Register Eq_2 bl_send_mm_denoise_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a4Out)
// Called from:
//      bl_main_denoise
Eq_2 bl_send_mm_denoise_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a4Out)
{
	Eq_2 a0_22;
	ptr32 a4_26;
	Eq_2 s0_30;
	word32 s1_31;
	Eq_2 s3_33;
	Eq_2 s6_44;
	word32 a1_141;
	word32 a3_142;
	word32 a5_143;
	word32 a6_144;
	word32 s2_145;
	word32 s4_146;
	Eq_2 ra_29 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_30, out s1_31, out a0_22, out a1_141, out a3_142, out a4_26, out a5_143, out a6_144, out s2_145, out s3_33, out s4_146, out s6_44);
	if (a0_22 == 0x00)
	{
		a4Out = a4_26;
		return ra_29;
	}
	else
	{
		*a0_22 = (byte) s1_31;
		ptr32 a4_66;
		word32 s0_147;
		word32 s1_148;
		word32 a0_149;
		word32 a1_150;
		word32 a2_151;
		word32 a3_152;
		word32 a5_153;
		word32 s2_154;
		word32 s3_155;
		word32 mstatus_156;
		Eq_2 ra_71 = bl_send_msg(ra_29, s0_30, a0_22, 50, s3_33, s6_44, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_147, out s1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_66, out a5_153, out s2_154, out s3_155, out mstatus_156);
		a4Out = a4_66;
		return ra_71;
	}
}

// 23022E58: Register Eq_2 bl_send_apm_start_req(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_start
Eq_2 bl_send_apm_start_req(Eq_2 ra, Eq_2 a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a4_34;
	Eq_2 a5_35;
	Eq_2 a3_39;
	word32 a1_330;
	word32 a2_331;
	word32 a6_332;
	word32 a7_333;
	memcpy(fp + -44, 587927916, 0x0C, out a1_330, out a2_331, out a3_39, out a4_34, out a5_35, out a6_332, out a7_333);
	struct Eq_102736 * a0_52;
	up32 a4_56;
	word32 a5_57;
	word32 a6_58;
	Eq_2 s1_61;
	Eq_2 s2_62;
	Eq_2 s3_63;
	Eq_2 s6_74;
	word32 s0_334;
	word32 a1_335;
	word32 s4_336;
	ptr32 a3_221;
	Eq_2 ra_227 = bl_msg_zalloc.constprop.3(ra, 0x00A8, a3_39, a4_34, a5_35, a0, mstatus, dwLoc30, s4, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgC8, dwArgE8, dwArg0108, out s0_334, out s1_61, out a0_52, out a1_335, out a3_221, out a4_56, out a5_57, out a6_58, out s2_62, out s3_63, out s4_336, out s6_74);
	if (a0_52 != null)
	{
		struct Eq_102767 * a4_86;
		a0_52->b0010 = 0x00;
		if (a4_56 <= ~0x0D)
		{
			if (a4_56 != 0x0E)
				a4_86 = (word32) (word16) (a4_56 + 0x00FFF96C);
			else
				a4_86 = (struct Eq_102767 *) 0x00FFF9B4;
		}
		else
			a4_86 = (struct Eq_102767 *) 0x0FFFFFFF;
		*((word32) dwArgA4 + 0x0E) = (word16) a4_86;
		a4_86->t0014 = dwArgA4;
		((word32) dwArgA4 + 40)->u0 = 100;
		*(union Eq_2 *) 0x34 = dwArgA4;
		((word32) dwArgA4 + 48)->u0 = ~0x0177;
		*((word32) dwArgA4 + 50) = 0x06;
		*((word32) dwArgA4 + 29) = (byte) a6_58;
		*((word32) dwArgA4 + 0x0033) = (byte) a5_57;
		*((word32) dwArgA4 + 0x0011) = 0x00;
		*((word32) dwArgA4 + 18) = 0x00;
		*((word32) dwArgA4 + 24) = 0x00;
		*((word32) dwArgA4 + 28) = 0x00;
		((word32) dwArgA4 + 32)->u0 = 0x00;
		((word32) dwArgA4 + 36)->u0 = 0x00;
		word32 a1_337;
		word32 a2_338;
		word32 a3_339;
		word32 a4_340;
		word32 a5_341;
		word32 a0_129 = (word32) (strlen(s2_62, out a1_337, out a2_338, out a3_339, out a4_340, out a5_341) != 0x00);
		((word32) dwArgA4 + 52)->u0 = 0x01;
		*((word32) dwArgA4 + 0x0066) = (byte) a0_129;
		word32 a1_342;
		word32 a2_343;
		word32 a3_344;
		word32 a4_345;
		word32 a5_346;
		word32 a1_347;
		word32 a2_348;
		word32 a3_349;
		word32 a4_350;
		word32 a5_351;
		word32 a6_352;
		word32 a7_353;
		memcpy((word32) dwArgA4 + 69, s1_61, strlen(s1_61, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346), out a1_347, out a2_348, out a3_349, out a4_350, out a5_351, out a6_352, out a7_353);
		word32 a1_354;
		word32 a2_355;
		word32 a3_356;
		word32 a4_357;
		word32 a5_358;
		word32 a1_359;
		word32 a2_360;
		word32 a3_361;
		word32 a4_362;
		word32 a5_363;
		word32 a6_364;
		word32 a7_365;
		memcpy((word32) dwArgA4 + 0x0067, s2_62, strlen(s2_62, out a1_354, out a2_355, out a3_356, out a4_357, out a5_358), out a1_359, out a2_360, out a3_361, out a4_362, out a5_363, out a6_364, out a7_365);
		word32 a1_366;
		word32 a2_367;
		word32 a3_368;
		word32 a4_369;
		word32 a5_370;
		*((word32) dwArgA4 + 0x0044) = (byte) strlen(s1_61, out a1_366, out a2_367, out a3_368, out a4_369, out a5_370);
		*((word32) dwArgA4 + 53) = 0x0C;
		word32 a1_371;
		word32 a2_372;
		word32 a3_373;
		word32 a4_374;
		word32 a5_375;
		word32 a6_376;
		word32 a7_377;
		memcpy((word32) dwArgA4 + 54, fp + -44, 0x0C, out a1_371, out a2_372, out a3_373, out a4_374, out a5_375, out a6_376, out a7_377);
		((word32) dwArgA4 + 66)->u0 = 0x0101;
		word32 s0_378;
		word32 s1_379;
		word32 a0_380;
		word32 a1_381;
		word32 a2_382;
		word32 a4_383;
		word32 a5_384;
		word32 s2_385;
		word32 s3_386;
		ra_227 = bl_send_msg(ra_227, s3_63, dwArgA4, 0x01FFFC01, s3_63, s6_74, mstatus, dwLoc30, s4, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_378, out s1_379, out a0_380, out a1_381, out a2_382, out a3_221, out a4_383, out a5_384, out s2_385, out s3_386, out mstatus);
	}
	s0Out = dwArg0158;
	a3Out = a3_221;
	mstatusOut = mstatus;
	return ra_227;
}

// 23022F98: Register Eq_2 bl_send_apm_stop_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_stop
Eq_2 bl_send_apm_stop_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_25;
	ptr32 a3_28;
	word32 s0_33;
	Eq_2 s1_34;
	word32 s2_35;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 a1_147;
	word32 a4_148;
	word32 a5_149;
	word32 a6_150;
	word32 s4_151;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_33, out s1_34, out a0_25, out a1_147, out a3_28, out a4_148, out a5_149, out a6_150, out s2_35, out s3_36, out s4_151, out s6_47);
	if (a0_25 == 0x00)
	{
		0x00 = (int8) dwArg38;
		a3Out = a3_28;
		mstatusOut = mstatus;
		return ra_32;
	}
	else
	{
		*a0_25 = (byte) s2_35;
		0x00 = (int8) dwArg38;
		ptr32 a3_68;
		ptr32 mstatus_73;
		word32 s0_152;
		word32 s1_153;
		word32 a0_154;
		word32 a1_155;
		word32 a2_156;
		word32 a4_157;
		word32 a5_158;
		word32 s2_159;
		word32 s3_160;
		Eq_2 ra_74 = bl_send_msg(ra_32, s1_34, a0_25, s0_33 + -1021, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_152, out s1_153, out a0_154, out a1_155, out a2_156, out a3_68, out a4_157, out a5_158, out s2_159, out s3_160, out mstatus_73);
		a3Out = a3_68;
		mstatusOut = mstatus_73;
		return ra_74;
	}
}

// 23022FE2: Register Eq_2 bl_send_apm_sta_del_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_apm_sta_delete
Eq_2 bl_send_apm_sta_del_req(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_28;
	word32 a3_31;
	ptr32 s0_36;
	Eq_2 s1_37;
	ptr32 s2_38;
	Eq_2 s3_39;
	Eq_2 s6_50;
	word32 a1_159;
	word32 a4_160;
	word32 a5_161;
	word32 a6_162;
	word32 s4_163;
	Eq_2 ra_35 = bl_msg_zalloc.constprop.3(ra, 0x02, a3, a4, a5, s3, mstatus, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, out s0_36, out s1_37, out a0_28, out a1_159, out a3_31, out a4_160, out a5_161, out a6_162, out s2_38, out s3_39, out s4_163, out s6_50);
	if (a0_28 == 0x00)
	{
		s0Out = s0_36;
		s1Out = s1_37;
		s2Out = s2_38;
		s3Out = s3_39;
		mstatusOut = mstatus;
		return ra_35;
	}
	else
	{
		*((word32) a0_28 + 1) = (byte) s2_38;
		*a0_28 = (byte) a3_31;
		ptr32 mstatus_80;
		ptr32 s0_82;
		Eq_2 s1_83;
		ptr32 s2_86;
		Eq_2 s3_87;
		word32 a0_164;
		word32 a1_165;
		word32 a2_166;
		word32 a3_167;
		word32 a4_168;
		word32 a5_169;
		Eq_2 ra_81 = bl_send_msg(ra_35, s1_37, a0_28, (word32) dwArg84 - 1012, s3_39, s6_50, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, s1, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_82, out s1_83, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_86, out s3_87, out mstatus_80);
		s0Out = s0_82;
		s1Out = s1_83;
		s2Out = s2_86;
		s3Out = s3_87;
		mstatusOut = mstatus_80;
		return ra_81;
	}
}

// 23023036: void bl_send_apm_conf_max_sta_req(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_conf_max_sta
void bl_send_apm_conf_max_sta_req(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_25;
	word32 s0_33;
	Eq_2 s1_34;
	word32 s2_35;
	Eq_2 s3_36;
	Eq_2 s6_47;
	word32 a1_145;
	word32 a3_146;
	word32 a4_147;
	word32 a5_148;
	word32 a6_149;
	word32 s4_150;
	Eq_2 ra_32 = bl_msg_zalloc.constprop.3(ra, 0x01, a3, a4, a5, s3, mstatus, dwArg00, dwArg04, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgF8, dwArg0118, dwArg0138, out s0_33, out s1_34, out a0_25, out a1_145, out a3_146, out a4_147, out a5_148, out a6_149, out s2_35, out s3_36, out s4_150, out s6_47);
	if (a0_25 == 0x00)
		0x00 = dwArg38;
	else
	{
		*a0_25 = (byte) s2_35;
		0x00 = dwArg38;
		word32 s0_151;
		word32 s1_152;
		word32 a0_153;
		word32 a1_154;
		word32 a2_155;
		word32 a3_156;
		word32 a4_157;
		word32 a5_158;
		word32 s2_159;
		word32 s3_160;
		word32 mstatus_161;
		bl_send_msg(ra_32, s1_34, a0_25, s0_33 + -1010, s3_36, s6_47, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_151, out s1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_158, out s2_159, out s3_160, out mstatus_161);
	}
}

