pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23023080: void bl_send_cfg_task_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      bl_main_cfg_task_req
void bl_send_cfg_task_req(Eq_2 ra, Eq_2 s0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 a0_32;
	struct Eq_103181 * a4_36;
	byte * a5_37;
	union Eq_2 * s1_41;
	word32 s2_42;
	Eq_2 s3_43;
	Eq_2 s4_44;
	Eq_2 s6_54;
	word32 s0_255;
	word32 a1_256;
	word32 a3_257;
	word32 a6_258;
	Eq_2 ra_39 = bl_msg_zalloc.constprop.3(ra, 36, a3, a4, a5, a2, mstatus, s2, s0, dwArg10, dwArg14, dwArg38, s3, dwArgD8, dwArgF8, dwArg0118, out s0_255, out s1_41, out a0_32, out a1_256, out a3_257, out a4_36, out a5_37, out a6_258, out s2_42, out s3_43, out s4_44, out s6_54);
	if (a0_32 == 0x00)
		0x00 = (int8) dwArg0128;
	else
	{
		*s1_41 = (union Eq_2 *) a0_32;
		Eq_2 s0_114 = a0_32;
		if (s1_41 <= (union Eq_2 *) 0x02)
		{
			s0_114 = dwArgB4;
			if (s1_41 == null)
			{
				*((word32) a0_32 + 4) = s3_43;
				*((word32) a0_32 + 8) = s2_42;
				a4_36->t000C = a0_32;
				utils_tlv_bl_pack_auto((word32) a0_32 + 20, 0x08, (word32) (word16) a4_36, a5_37, a4_36)->t0010 = dwArgB4;
			}
		}
		else
		{
			if (s1_41 != (union Eq_2 *) 0x03)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_270;
					xTaskGetTickCountFromISR(out a5_270);
				}
				else
				{
					word32 a5_288;
					xTaskGetTickCount(out a5_288);
				}
				word32 s1_271;
				word32 a0_272;
				word32 a1_273;
				word32 a2_274;
				word32 a3_275;
				word32 a4_276;
				word32 a5_277;
				word32 s2_278;
				word32 s3_279;
				word32 s4_280;
				word32 s5_281;
				word32 s6_282;
				word32 s7_283;
				word32 s8_284;
				word32 s9_285;
				word32 s10_286;
				word32 s11_287;
				bl_printk(ra_39, &g_t230B1CAC, 0x230B1C90, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_271, out a0_272, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277, out s2_278, out s3_279, out s4_280, out s5_281, out s6_282, out s7_283, out s8_284, out s9_285, out s10_286, out s11_287);
				while (true)
					;
			}
			*((word32) a0_32 + 4) = s3_43;
			*((word32) a0_32 + 8) = s2_42;
			*((word32) a0_32 + 16) = 0x00;
		}
		0x00 = (int8) dwArg0128;
		word32 s0_259;
		word32 s1_260;
		word32 a0_261;
		word32 a1_262;
		word32 a2_263;
		word32 a3_264;
		word32 a4_265;
		word32 a5_266;
		word32 s2_267;
		word32 s3_268;
		word32 mstatus_269;
		bl_send_msg(ra_39, s4_44, s0_114, 0x03000001, s3_43, s6_54, mstatus, dwArg10, dwArg14, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_259, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out s2_267, out s3_268, out mstatus_269);
	}
}

// 2302315A: Register Eq_2 bl_platform_on(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_platform_on(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	g_dw42024F10 = 0x42040000;
	ptr32 a0_12;
	ptr32 a3_15;
	ptr32 s0_21;
	ptr32 s1_22;
	ptr32 s2_25;
	Eq_2 ra_20 = bl_ipc_init(ra, 0x42040000, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg38, dwArg5C, dwArgB8, dwArgF8, dwArg0138, out s0_21, out s1_22, out a0_12, out a3_15, out s2_25);
	if (a0_12 == 0x00)
		((union Eq_2 *) 0x07)->u0 = 0x44800000;
	s0Out = s0_21;
	s1Out = s1_22;
	a0Out = a0_12;
	a3Out = a3_15;
	s2Out = s2_25;
	return ra_20;
}

// 23023186: void bl_rx_chan_pre_switch_ind()
void bl_rx_chan_pre_switch_ind()
{
}

// 2302318A: void bl_rx_rssi_status_ind(Register word32 ra, Register word32 a2)
void bl_rx_rssi_status_ind(word32 ra, word32 a2)
{
	<anonymous> * a5_5 = g_ptr4200F35C;
	if (a5_5 == null)
		return;
	a5_5();
}

// 230231B2: void bl_rx_apm_sta_del_ind(Register Eq_2 ra, Register (ptr32 Eq_103383) a2, Register Eq_2 a3, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void bl_rx_apm_sta_del_ind(Eq_2 ra, struct Eq_103383 * a2, Eq_2 a3, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_2 a3_22;
	Eq_2 a3_47;
	ptr32 s1_51;
	word32 s1_147;
	word32 a0_148;
	word32 a1_149;
	word32 a2_150;
	word32 a4_151;
	word32 a5_152;
	word32 a7_153;
	word32 s2_154;
	word32 s3_155;
	word32 s4_156;
	word32 s5_157;
	word32 s6_158;
	word32 s7_159;
	word32 s8_160;
	word32 s9_161;
	word32 s10_162;
	word32 s11_163;
	word32 t4_164;
	word32 a0_165;
	word32 a1_166;
	word32 a2_167;
	word32 a5_168;
	word32 a7_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s5_173;
	word32 s6_174;
	word32 s7_175;
	word32 s8_176;
	word32 s9_177;
	word32 s10_178;
	word32 s11_179;
	word32 t4_180;
	struct Eq_446 * a4_102;
	Eq_2 ra_101 = printf(printf(ra, &g_t230B1EA4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_147, out a0_148, out a1_149, out a2_150, out a3_22, out a4_151, out a5_152, out a7_153, out s2_154, out s3_155, out s4_156, out s5_157, out s6_158, out s7_159, out s8_160, out s9_161, out s10_162, out s11_163, out t4_164), &g_t230B1EBC, a3_22, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_51, out a0_165, out a1_166, out a2_167, out a3_47, out a4_102, out a5_168, out a7_169, out s2_170, out s3_171, out s4_172, out s5_173, out s6_174, out s7_175, out s8_176, out s9_177, out s10_178, out s11_179, out t4_180);
	Eq_103475 a0_64 = (word32) a2->b0008;
	if (a0_64 <= 11)
		(s1_51 + ((word32) a0_64 + 28))->b1000C98 = 0x00;
	else
	{
		word32 s1_181;
		word32 a0_182;
		word32 a1_183;
		word32 a2_184;
		word32 a3_185;
		word32 a5_186;
		word32 a7_187;
		word32 s2_188;
		word32 s3_189;
		word32 s4_190;
		word32 s5_191;
		word32 s6_192;
		word32 s7_193;
		word32 s8_194;
		word32 s9_195;
		word32 s10_196;
		word32 s11_197;
		word32 t4_198;
		ra_101 = printf(ra_101, &g_t230B1ED4, a3_47, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_181, out a0_182, out a1_183, out a2_184, out a3_185, out a4_102, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
	}
	word32 s0_199;
	word32 a0_200;
	word32 a3_201;
	aos_post_event(ra_101, 0x02, a4_102, dwArg14, out s0_199, out a0_200, out a3_201);
}

