pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23023606: void bl_rx_sm_disconnect_ind(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void bl_rx_sm_disconnect_ind(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a3_21;
	word32 s8_329;
	word32 a0_327;
	word32 s4_328;
	Eq_2 s0_141 = ipaddr_addr(0x230B2104, out a0_327, out a3_21, out s4_328, out s8_329);
	Eq_2 a3_45;
	Eq_2 a3_70;
	struct Eq_104955 * s2_103;
	word32 s3_338;
	word32 s4_339;
	word32 s5_340;
	word32 s6_341;
	word32 s7_342;
	word32 s2_337;
	word32 a7_336;
	word32 a5_335;
	word32 a2_333;
	word32 a4_334;
	word32 a0_331;
	word32 a1_332;
	word32 s1_330;
	word32 s8_343;
	word32 s9_344;
	word32 s10_345;
	word32 s11_346;
	word32 t4_347;
	word32 s1_348;
	word32 a0_349;
	word32 a1_350;
	word32 a2_351;
	word32 a4_352;
	word32 a5_353;
	word32 a7_354;
	word32 s2_355;
	word32 s3_356;
	word32 s4_357;
	word32 s5_358;
	word32 s6_359;
	word32 s7_360;
	word32 s8_361;
	word32 s9_362;
	word32 s10_363;
	word32 s11_364;
	word32 t4_365;
	word32 a0_366;
	word32 a1_367;
	word32 a2_368;
	word32 a4_369;
	word32 a5_370;
	word32 a7_371;
	word32 s3_372;
	word32 s4_373;
	word32 s5_374;
	word32 s6_375;
	word32 s7_376;
	word32 s8_377;
	word32 s9_378;
	word32 s10_379;
	word32 s11_380;
	word32 t4_381;
	ptr32 s1_100;
	Eq_2 a3_147;
	Eq_2 ra_140 = printf(printf(printf(ra, &g_t230B210C, a3_21, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_330, out a0_331, out a1_332, out a2_333, out a3_45, out a4_334, out a5_335, out a7_336, out s2_337, out s3_338, out s4_339, out s5_340, out s6_341, out s7_342, out s8_343, out s9_344, out s10_345, out s11_346, out t4_347), &g_t230B213C, a3_45, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_348, out a0_349, out a1_350, out a2_351, out a3_70, out a4_352, out a5_353, out a7_354, out s2_355, out s3_356, out s4_357, out s5_358, out s6_359, out s7_360, out s8_361, out s9_362, out s10_363, out s11_364, out t4_365), &g_t230B2154, a3_70, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_100, out a0_366, out a1_367, out a2_368, out a3_147, out a4_369, out a5_370, out a7_371, out s2_103, out s3_372, out s4_373, out s5_374, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380, out t4_381);
	Eq_2 s2_113 = &s2_103->ptr036C;
	if (s2_103->ptr036C != null)
	{
		word32 a2_120;
		word32 t1_382;
		word32 a0_383;
		word32 a1_384;
		word32 a3_385;
		word32 a4_386;
		word32 a5_387;
		Eq_2 ra_124 = memset(ra_140, fp + ~0x17, 0x00, 0x08, out t1_382, out a0_383, out a1_384, out a2_120, out a3_385, out a4_386, out a5_387);
		<anonymous> * a5_136 = s2_103->ptr036C;
		word32 tp_257;
		a5_136();
	}
	word32 a5_168 = (word32) *((word32) s0_141 + 0x0A);
	Eq_2 a4_173 = a5_168 + 0x0424 + s1_100;
	if (a4_173 != 0x00 && (s1_100 + (a5_168 + 0x00C4))->dw0368 != 0x00)
	{
		Eq_2 a4_189;
		Eq_2 a5_190;
		Eq_2 s2_195;
		word32 a3_388;
		word32 a4_389;
		word32 s3_390;
		netifapi_netif_set_addr(ra_140, netifapi_netif_common(ra_140, s0_141, a3_147, a4_173, a5_168 + 0x00C4, s2_113, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_388, out a4_189, out a5_190, out s2_195), fp - 28, fp - 28, fp - 28, a4_189, a5_190, s2_195, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a4_389, out s3_390);
	}
}

// 230236D6: void bl_rx_scanu_result_ind(Register Eq_2 ra, Register (ptr32 Eq_47466) a2, Stack Eq_2 dwArg18, Stack word32 dwArg24, Stack word32 dwArg44, Stack Eq_2 dwArg8C)
void bl_rx_scanu_result_ind(Eq_2 ra, struct Eq_47466 * a2, Eq_2 dwArg18, word32 dwArg24, word32 dwArg44, Eq_2 dwArg8C)
{
	Eq_2 a3_25;
	word32 a0_891;
	word32 t1_890;
	word32 a4_894;
	word32 a5_895;
	word32 a1_892;
	word32 a2_893;
	Eq_2 ra_28 = memset(ra, fp + -0x0078, 0x00, 32, out t1_890, out a0_891, out a1_892, out a2_893, out a3_25, out a4_894, out a5_895);
	struct Eq_47466 * s0_249 = a2;
	ui32 a5_31 = (word32) a2->w0024;
	if ((a5_31 & 252) != 0x0080)
	{
		if ((a5_31 & 252) == 80)
		{
			word32 s1_70;
			word32 s2_73;
			word32 s3_74;
			word32 s4_75;
			word32 a3_932;
			word32 a4_933;
			word32 a0_929;
			word32 a1_930;
			word32 a5_934;
			word32 a7_935;
			word32 a2_931;
			word32 s6_937;
			word32 s5_936;
			word32 s8_939;
			word32 s10_941;
			word32 s11_942;
			word32 t4_943;
			word32 s9_940;
			word32 s7_938;
			Eq_2 ra_69 = printf(ra_28, &g_t230B1F04, a3_25, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_70, out a0_929, out a1_930, out a2_931, out a3_932, out a4_933, out a5_934, out a7_935, out s2_73, out s3_74, out s4_75, out s5_936, out s6_937, out s7_938, out s8_939, out s9_940, out s10_941, out s11_942, out t4_943);
			<anonymous> * a3_84 = g_ptr4200F358;
			if (a3_84 != null)
			{
				word32 a4_85 = (word32) a2->w003E;
				word32 a5_86 = (word32) a2->w0042;
				word32 t3_113;
				word32 s10_114;
				word32 s11_115;
				word32 s6_116;
				word32 s7_117;
				word32 s8_118;
				word32 t5_552;
				word32 tp_554;
				word32 t6_553;
				word32 a6_551;
				a3_84();
			}
		}
		else
		{
			word32 a1_912;
			word32 a3_914;
			word32 a2_913;
			word32 t4_928;
			word32 a0_911;
			word32 a4_915;
			word32 a5_916;
			word32 a7_917;
			word32 s9_925;
			word32 s5_921;
			word32 s1_910;
			word32 s3_919;
			word32 s4_920;
			word32 s2_918;
			word32 s6_922;
			word32 s10_926;
			word32 s11_927;
			word32 s8_924;
			word32 s7_923;
			printf(ra_28, &g_t230B1F18, a3_25, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_910, out a0_911, out a1_912, out a2_913, out a3_914, out a4_915, out a5_916, out a7_917, out s2_918, out s3_919, out s4_920, out s5_921, out s6_922, out s7_923, out s8_924, out s9_925, out s10_926, out s11_927, out t4_928);
		}
		return;
	}
	<anonymous> ** s3_121 = &g_dw4200F340;
	if (g_dw4200F340 == 0x00)
		return;
	word32 a5_902;
	word32 a2_899;
	word32 a4_901;
	word32 a0_897;
	word32 a1_898;
	word32 t1_896;
	word32 a3_900;
	Eq_2 ra_131 = memset(ra_28, fp + -88, 0x00, 56, out t1_896, out a0_897, out a1_898, out a2_899, out a3_900, out a4_901, out a5_902);
	Eq_2 s1_134 = (word32) a2->w0008;
	Eq_2 s4_135 = &a2->w0046 + 1;
	struct Eq_105246 * s2_136 = &a2->w0046 + 1;
	Eq_2 a5_137 = 0x00;
	while (a5_137 < s1_134)
	{
		Eq_2 a2_143 = (word32) s2_136->b0001;
		if ((word32) s2_136->b0000 == 0x00)
		{
			if (a2_143 <= 32)
			{
				word32 a3_905;
				word32 a1_903;
				word32 a2_904;
				word32 a7_909;
				word32 a5_907;
				word32 a6_908;
				word32 a4_906;
				memcpy(fp + -82, &s2_136->b0001 + 1, a2_143, out a1_903, out a2_904, out a3_905, out a4_906, out a5_907, out a6_908, out a7_909);
				((word32) s2_136->b0001 + (fp + -32))->b0FCE = 0x00;
			}
			break;
		}
		a5_137 = (word32) a5_137 + ((word32) a2_143 + 2);
		s2_136 += ((word32) a2_143 + 2) / 2;
	}
	int32 a2_172 = (word32) a2->w0008;
	struct Eq_105255 * a5_175 = &a2->w0046 + 1;
	int32 a3_176;
	for (a3_176 = 0x00; a3_176 < a2_172; a3_176 += (word32) a4_183.u1 + 2)
	{
		Eq_105429 a4_183 = (word32) a5_175->b0001;
		if ((word32) a5_175->b0000 == 0x03)
			break;
		a5_175 += ((word32) a4_183.u1 + 2) / 2;
	}
	if (((word32) a2->w0046 & 0x10) == 0x00)
	{
l2302385A:
		<anonymous> * a5_440 = *s3_121;
		word32 t3_519;
		word32 s10_520;
		word32 s11_521;
		word32 s6_522;
		word32 s7_523;
		word32 s8_524;
		word32 a6_525;
		word32 t5_526;
		word32 t6_527;
		word32 tp_528;
		a5_440();
		return;
	}
	uint32 s1_204 = (word32) s1_134 - 36 << 16;
	byte * s1_205 = s1_204 >> 16;
	word32 a5_944;
	Eq_2 a0_213 = mac_ie_find(&a2->w0046 + 1, s1_204 >> 16, 48, out a5_944);
	s2_136 = null;
	if (a0_213 != 0x00)
	{
		struct Eq_47224 * a4_223;
		word32 a5_224;
		word32 a1_945;
		word32 a2_946;
		word32 a3_947;
		word32 a6_948;
		word32 a7_949;
		memcpy(fp + -0x0078, a0_213, (word32) *((word32) a0_213 + 1) + 0x02 & 0x00FF, out a1_945, out a2_946, out a3_947, out a4_223, out a5_224, out a6_948, out a7_949);
		bLoc27 = (byte) ((word32) bLoc27 | 32);
		struct Eq_105246 * a0_240;
		ra_131 = process_rsn_ie(fp + -0x0078, fp + -41, fp + -40, fp + -121, a4_223, a5_224, dwArg8C, out s0_249, out s1_205, out a0_240, out s3_121, out s4_135);
		s2_136 = a0_240;
	}
	Eq_2 a0_276;
	ui32 a4_278;
	s1_134 = mac_vsie_find(s4_135, s1_205, &g_t230B1DC0, (byte *) 0x04, out a0_276, out a2_172, out a4_278, out s4_135);
	if (a0_276 != 0x00)
	{
		bLoc27 = (byte) ((word32) bLoc27 | 8);
		if (s2_136 == null)
		{
			word32 a1_950;
			word32 a3_952;
			word32 a4_953;
			word32 a2_951;
			word32 a7_956;
			word32 a5_954;
			word32 a6_955;
			memcpy(fp + -0x0078, a0_276, (word32) *((word32) a0_276 + 1) + 0x02 & 0x00FF, out a1_950, out a2_951, out a3_952, out a4_953, out a5_954, out a6_955, out a7_956);
			s0_249 = process_wpa_ie(fp + -0x0078, fp + -43, fp + -42, out s1_134, out a2_172, out a4_278, out s2_136, out s3_121, out s4_135);
		}
	}
	ui32 a3_344;
	ui32 a4_337 = a4_278 & 0x02FFF800;
	if (a4_337 == 0x02FFF800)
	{
		ui32 a5_356 = (word32) bLoc28 | (word32) bLoc2A;
		a3_344 = a5_356 & 8;
		if ((a5_356 & 0x04) != 0x00)
			goto l23023840;
		if ((a5_356 & 8) == 0x00)
			goto l23023854;
		if ((a5_356 & 8 & 0x08000800) != 0x00 || ((a5_356 & 8) & 0x04000400) == 0x00)
		{
l23023846:
			if (a4_337 == 0x02FFF800)
			{
l23023856:
				goto l2302385A;
			}
			goto l23023926;
		}
l23023844:
		goto l23023846;
	}
	ui32 a5_346;
	ui32 a5_338 = (word32) bLoc27;
	if ((a5_338 & 8) != 0x00)
	{
		ui32 a5_347 = (word32) bLoc2A;
		a3_344 = a5_347 & 8;
		if ((a5_347 & 0x04) == 0x00)
		{
			if ((a5_347 & 8) != 0x00)
			{
				a5_346 = (word32) bLoc2B;
				goto l230238FA;
			}
			goto l23023926;
		}
	}
	else
	{
		if ((a5_338 & 32) == 0x00)
			goto l23023926;
		ui32 a5_343 = (word32) bLoc28;
		a3_344 = a5_343 & 8;
		if ((a5_343 & 0x04) == 0x00)
		{
			if ((a5_343 & 8) != 0x00)
			{
				a5_346 = (word32) bLoc29;
l230238FA:
				if ((a5_346 & 8) != 0x00 || (a5_346 & 0x04) == 0x00)
					goto l230238CC;
				goto l23023844;
			}
l23023926:
			ui32 a5_386 = (word32) bLoc27;
			goto l23023856;
		}
	}
l23023840:
	if (a3_344 == 0x00)
		goto l23023846;
	goto l23023844;
}

