pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23023990: void bl_rx_mesh_path_update_ind()
void bl_rx_mesh_path_update_ind()
{
}

// 23023994: void bl_rx_mesh_proxy_update_ind()
void bl_rx_mesh_proxy_update_ind()
{
}

// 23023998: void bl_rx_remain_on_channel_exp_ind()
void bl_rx_remain_on_channel_exp_ind()
{
}

// 2302399C: void bl_rx_ps_change_ind()
void bl_rx_ps_change_ind()
{
}

// 230239A0: void bl_rx_traffic_req_ind()
void bl_rx_traffic_req_ind()
{
}

// 230239A4: void bl_rx_csa_counter_ind()
void bl_rx_csa_counter_ind()
{
}

// 230239A8: void bl_rx_csa_finish_ind()
void bl_rx_csa_finish_ind()
{
}

// 230239AC: void bl_rx_csa_traffic_ind()
void bl_rx_csa_traffic_ind()
{
}

// 230239B0: void bl_rx_channel_survey_ind()
void bl_rx_channel_survey_ind()
{
}

// 230239B4: void bl_rx_dbg_error_ind()
void bl_rx_dbg_error_ind()
{
}

// 230239B8: void bl_rx_tdls_chan_switch_cfm()
void bl_rx_tdls_chan_switch_cfm()
{
}

// 230239BC: void bl_rx_tdls_chan_switch_ind()
void bl_rx_tdls_chan_switch_ind()
{
}

// 230239C0: void bl_rx_tdls_chan_switch_base_ind()
void bl_rx_tdls_chan_switch_base_ind()
{
}

// 230239C4: void bl_rx_tdls_peer_ps_ind()
void bl_rx_tdls_peer_ps_ind()
{
}

// 230239C8: void bl_rx_me_tkip_mic_failure_ind()
void bl_rx_me_tkip_mic_failure_ind()
{
}

// 230239CC: void bl_rx_me_tx_credits_update_ind()
void bl_rx_me_tx_credits_update_ind()
{
}

// 230239D0: void bl_rx_mesh_path_create_cfm()
void bl_rx_mesh_path_create_cfm()
{
}

// 230239D4: void bl_rx_mesh_peer_update_ind()
void bl_rx_mesh_peer_update_ind()
{
}

// 230239D8: void bl_rx_sm_connect_ind_cb_register(Register word32 a0, Register (ptr32 code) a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_sm_connect_ind_cb_register(word32 a0, <anonymous> * a1)
{
	g_ptr4200F364 = a1;
	g_dw4200F368 = a0;
}

// 230239EC: void bl_rx_sm_disconnect_ind_cb_register(Register word32 a0, Register word32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_sm_disconnect_ind_cb_register(word32 a0, word32 a1)
{
	g_dw4200F36C = a1;
	g_dw4200F370 = a0;
}

// 23023A00: void bl_rx_beacon_ind_cb_register(Register word32 a0, Register int32 a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_beacon_ind_cb_register(word32 a0, int32 a1)
{
	g_dw4200F340 = a1;
	g_dw4200F344 = a0;
}

// 23023A14: void bl_rx_probe_resp_ind_cb_register(Register (ptr32 code) a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_probe_resp_ind_cb_register(<anonymous> * a1)
{
	g_ptr4200F358 = a1;
}

// 23023A20: void bl_rx_pkt_cb_register(Register word32 a0, Register (ptr32 code) a1)
// Called from:
//      wifi_mgmr_sniffer_register
void bl_rx_pkt_cb_register(word32 a0, <anonymous> * a1)
{
	g_ptr4200F350 = a1;
	g_dw4200F354 = a0;
}

// 23023A34: void bl_rx_pkt_cb_unregister()
// Called from:
//      wifi_mgmr_sniffer_unregister
void bl_rx_pkt_cb_unregister()
{
	g_ptr4200F350 = null;
	g_dw4200F354 = 0x00;
}

// 23023A48: void bl_rx_rssi_cb_register(Register word32 a0, Register (ptr32 code) a1)
// Called from:
//      wifi_mgmr_event_init
void bl_rx_rssi_cb_register(word32 a0, <anonymous> * a1)
{
	g_ptr4200F35C = a1;
	g_dw4200F360 = a0;
}

// 23023A5C: Register word32 bl_rx_event_register(Register word32 a0, Register (ptr32 code) a1)
// Called from:
//      wifi_mgmr_event_init
word32 bl_rx_event_register(word32 a0, <anonymous> * a1)
{
	g_ptr4200F348 = a1;
	g_dw4200F34C = a0;
	return 0x4200F000;
}

// 23023A70: void bl_rx_e2a_handler(Register Eq_2 a0, Register word32 a2)
// Called from:
//      apm_tx_int_ps_postpone
void bl_rx_e2a_handler(Eq_2 a0, word32 a2)
{
	g_ptr420230C8();
}

// 23023AA6: void bl_rx_pkt_cb(Register (ptr32 Eq_105725) a0)
// Called from:
//      tcpip_stack_input
void bl_rx_pkt_cb(struct Eq_105725 * a0)
{
	<anonymous> * t1_5 = g_ptr4200F350;
	if (t1_5 == null)
		return;
	t1_5();
}

// 23023AC2: Register (ptr32 Eq_105731) bl_tx_push(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_58770) a2, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_105744) a0Out, Register out (ptr32 (ptr32 Eq_97113)) a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_105749 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_105731) s3Out)
// Called from:
//      bl_tx_resend
//      bl_tx_try_flush
struct Eq_105731 * bl_tx_push(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_58770 * a2, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_105744 & a0Out, struct Eq_97113 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_105749 & a5Out, union Eq_2 & s2Out, struct Eq_105731 & s3Out)
{
	struct Eq_97113 ** s4_21 = *((word32) a1 + 8);
	Eq_2 a3_26;
	word32 a4_156;
	word32 a5_157;
	word32 a0_25 = ipc_host_txdesc_get(a2, a4, a5, out a3_26, out a4_156, out a5_157);
	Eq_2 s2_17 = a0;
	struct Eq_105731 * s1_29 = a0_25 + 4;
	word32 s3_30 = a0_25;
	if (a0_25 == 0x04)
	{
		word32 a0_158;
		word32 a1_159;
		word32 a2_160;
		word32 a3_161;
		word32 a4_162;
		word32 a5_163;
		word32 a7_164;
		word32 s5_165;
		word32 s6_166;
		word32 s7_167;
		word32 s8_168;
		word32 s9_169;
		word32 s10_170;
		word32 s11_171;
		word32 t4_172;
		printf(ra, &g_t230B276C, a3_26, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_29, out a0_158, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a7_164, out s2_17, out s3_30, out s4_21, out s5_165, out s6_166, out s7_167, out s8_168, out s9_169, out s10_170, out s11_171, out t4_172);
	}
	struct Eq_105773 * a1_57 = (word32) a1 + 0x0C;
	struct Eq_105731 * s3_59 = s3_30 + 84;
	do
	{
		++a1_57;
		ui32 a5_63 = (word32) a1_57->bFFFFFFFF;
		++s1_29;
		s1_29[0x0FFF] = (struct Eq_105731) (byte) a5_63;
	} while (s3_59 != s1_29);
	ptr32 a3_75;
	ptr32 a4_76;
	struct Eq_105744 * a0_74 = ipc_host_txdesc_push(s4_21, a5_63, out a3_75, out a4_76);
	Eq_2 a5_78 = *((word32) s2_17 + 56);
	*((word32) s2_17 + 56) = (word32) a5_78 + 1;
	a0Out = a0_74;
	a1Out = s4_21;
	a2Out = dwArg48;
	a3Out = a3_75;
	a4Out = a4_76;
	a5Out = (word32) a5_78 + 1;
	s2Out = s2_17;
	s3Out = s3_59;
	return s1_29;
}

// 23023B32: Register word32 bl_tx_resend(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_58770) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_97201) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      ipc_host_irq
word32 bl_tx_resend(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_58770 * a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, ptr32 & s1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_97201 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 a5_140;
	Eq_2 a4_23 = vTaskEnterCritical(a4, mstatus, out a5_140);
	struct Eq_97201 * s3_24 = &g_t4200F000;
	ptr32 s1_128 = 0x42023F14;
	while (a4_23 != s3_24->t037C)
	{
		Eq_2 a4_40;
		word32 a5_141;
		if (ipc_host_txdesc_get(a2, a4_23, *((word32) a0 + 52), out a3, out a4_40, out a5_141) == 0x00)
			break;
		Eq_2 a0_43 = g_t4200EB34;
		*((word32) a4_40 + 4) = 0x00;
		struct Eq_105878 * a5_57;
		word32 s2_142;
		s1_128 = bl_tx_push(ra, a0_43, a1, a2, a4_40, *a1, 0x4200EB34, s2, dwArg30, dwArg34, dwArg58, dwArg7C, out a0, out a1, out a2, out a3, out a4_23, out a5_57, out s2_142, out s3_24);
		a5_57->dw0001 = a5_57->dw0000;
	}
	ptr32 a4_86;
	word32 a5_143;
	Eq_2 a3_85 = vTaskExitCritical(a3, mstatus, out a4_86, out a5_143);
	s1Out = s1_128;
	a2Out = dwArg48;
	a3Out = a3_85;
	a4Out = a4_86;
	s3Out = s3_24;
	s4Out = dwArg04;
	s5Out = 0x4200F000;
	return s1;
}

// 23023BAC: void bl_tx_try_flush(Register Eq_2 ra, Register (ptr32 Eq_99421) a0, Register (ptr32 Eq_58770) a2, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C)
// Called from:
//      bl_main_event_handle
void bl_tx_try_flush(Eq_2 ra, struct Eq_99421 * a0, struct Eq_58770 * a2, Eq_2 a4, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C)
{
	word32 a5_112;
	Eq_2 a4_16 = vTaskEnterCritical(a4, mstatus, out a5_112);
	Eq_2 s2_17 = 0x42024000;
	while (true)
	{
		Eq_2 a3_26;
		Eq_2 a4_27;
		struct Eq_105929 * a5_28;
		if (ipc_host_txdesc_get(a2, a4_16, a0->t0034, out a3_26, out a4_27, out a5_28) == 0x00)
			break;
		Eq_2 a5_32;
		Eq_2 a0_31 = utils_list_pop_front(a4_27, a5_28, out a5_32);
		if (a0_31 == 0x00)
			break;
		word32 s3_116;
		word32 a5_115;
		word32 a3_114;
		word32 a1_113;
		bl_tx_push(ra, a0_31, a0_31, a2, a4_27, a5_32, s2_17, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out a0, out a1_113, out a2, out a3_114, out a4_16, out a5_115, out s2_17, out s3_116);
	}
	0x00 = dwArg38;
	word32 a5_118;
	word32 a4_117;
	vTaskExitCritical(a3_26, mstatus, out a4_117, out a5_118);
}

// 23023BF2: void bl_txdatacfm(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 Eq_105971) a5, Register Eq_2 s4, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg0118)
void bl_txdatacfm(Eq_2 ra, Eq_2 a3, struct Eq_105971 * a5, Eq_2 s4, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a1_5 = a5->t0004;
	Eq_2 s0_17 = a5->t0004;
	if (a5 == null)
	{
l23023C5C:
		0x00 = dwArg38;
		return;
	}
	Eq_2 a4_19 = a5 << 0x0F;
	Eq_2 s1_20 = a1_5;
	if (a5 << 0x0F < 0x00)
	{
		if (((g_dw4200F37C + 0x01 ^ g_dw4200F378) & 0x07) != 0x00)
		{
			word32 a0_206;
			word32 a1_207;
			word32 a2_208;
			word32 a4_209;
			word32 a5_210;
			word32 s4_211;
			word32 s8_212;
			puts(587933572, out a0_206, out a1_207, out a2_208, out a4_209, out a5_210, out s4_211, out s8_212);
			int32 a4_90 = g_dw4200F37C;
			*s0_17 = ((a4_90 & 7) << 2) + 0x42023F14;
			g_dw4200F37C = a4_90 + 0x01;
l23023C5A:
			goto l23023C5C;
		}
		word32 a0_201;
		word32 a1_202;
		word32 a2_203;
		word32 a5_204;
		word32 s8_205;
		s1_20 = puts(587933588, out a0_201, out a1_202, out a2_203, out a4_19, out a5_204, out s4, out s8_205);
	}
	word32 s0_185;
	word32 s1_186;
	word32 a0_187;
	word32 a1_188;
	word32 a2_189;
	word32 a3_190;
	word32 a4_191;
	word32 a5_192;
	word32 a7_193;
	word32 s2_194;
	word32 s3_195;
	word32 s4_196;
	word32 s5_197;
	word32 s6_198;
	word32 s8_199;
	word32 mstatus_200;
	pbuf_free(ra, s1_20, a3, a4_19, s4, mstatus, dwArg0118, out s0_185, out s1_186, out a0_187, out a1_188, out a2_189, out a3_190, out a4_191, out a5_192, out a7_193, out s2_194, out s3_195, out s4_196, out s5_197, out s6_198, out s8_199, out mstatus_200);
	goto l23023C5A;
}

// 23023C7C: Register Eq_2 bl_tx_notify(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_97291) s0Out, Register out Eq_97292 s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_97294) a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 int32) s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      ipc_host_irq
Eq_2 bl_tx_notify(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, struct Eq_97291 & s0Out, union Eq_97292 & s1Out, union Eq_2 & a0Out, struct Eq_97294 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, int32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a0_5 = g_t4200F374;
	if (a0_5 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0_5;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_12;
		struct Eq_97294 * a1_13;
		ptr32 a2_14;
		Eq_2 a4_15;
		struct Eq_97291 * s0_17;
		Eq_97292 s1_18;
		int32 * s3_20;
		ptr32 s4_21;
		ptr32 a3_25;
		ptr32 mstatus_26;
		word32 a5_73;
		word32 s2_74;
		Eq_2 ra_27 = xTaskGenericNotify(ra, a0_5, 0x00, 0x02, 0x00, a4, mstatus, dwArg14, dwArg38, dwArg58, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_17, out s1_18, out a0_12, out a1_13, out a2_14, out a3_25, out a4_15, out a5_73, out s2_74, out s3_20, out s4_21, out mstatus_26);
		s0Out = s0_17;
		s1Out = s1_18;
		a0Out = a0_12;
		a1Out = a1_13;
		a2Out = a2_14;
		a3Out = a3_25;
		a4Out = a4_15;
		s3Out = s3_20;
		s4Out = s4_21;
		mstatusOut = mstatus_26;
		return ra_27;
	}
}

// 23023C92: void bl_output(Register Eq_2 ra, Register (ptr32 Eq_106154) a0, Register (ptr32 Eq_106155) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack word32 dwArgA8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE8)
// Called from:
//      wifi_tx
void bl_output(Eq_2 ra, struct Eq_106154 * a0, struct Eq_106155 * a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA4, word32 dwArgA8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgE8)
{
	if (a0 != null)
	{
		ui32 a5_22 = (word32) a1->b0041;
		if ((a5_22 & 0x04) != 0x00)
		{
			word32 s0_25 = *(a5_22 & 0x04);
			if ((a5_22 & 0x04) == 0x00)
			{
				word32 a5_677;
				*xTaskGetCurrentTaskHandle(out a5_677) = s0_25;
			}
			g_ptr4200FB34 = a0;
			Eq_2 s3_40 = *((word32) a2 + 4);
			word32 s4_41 = (word32) *((word32) a2 + 8);
			Eq_2 a3_46;
			struct Eq_106243 * a5_48;
			if (pbuf_header(a2, 0x0080, a2, out a3_46, out a5_48) != 0x00)
			{
				word32 a0_699;
				word32 s11_715;
				word32 t4_716;
				word32 s4_708;
				word32 s5_709;
				word32 s6_710;
				word32 s8_712;
				word32 s9_713;
				word32 s10_714;
				word32 s7_711;
				word32 a2_701;
				word32 a3_702;
				word32 a4_703;
				word32 a7_705;
				word32 s2_706;
				word32 s3_707;
				word32 a5_704;
				word32 s1_698;
				word32 a1_700;
				printf(ra, &g_t230B26E8, a3_46, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_698, out a0_699, out a1_700, out a2_701, out a3_702, out a4_703, out a5_704, out a7_705, out s2_706, out s3_707, out s4_708, out s5_709, out s6_710, out s7_711, out s8_712, out s9_713, out s10_714, out s11_715, out t4_716);
			}
			else
			{
				word32 a5_109;
				Eq_2 s1_131 = a5_48->t0004;
				Eq_2 s0_130 = a5_48 + (0x00 - a5_48 & 0x03) / 8;
				word32 a1_680;
				word32 a2_681;
				word32 a0_679;
				word32 t1_678;
				word32 a4_683;
				word32 a3_682;
				word32 a5_684;
				Eq_2 ra_157 = memset(ra, s0_130, 0x00, 92, out t1_678, out a0_679, out a1_680, out a2_681, out a3_682, out a4_683, out a5_684);
				*((word32) s1_131 + 8) = s0_130;
				word32 a1_685;
				word32 a3_687;
				word32 a4_688;
				word32 a6_690;
				word32 a2_686;
				word32 a7_691;
				word32 a5_689;
				memcpy((word32) s0_130 + 28, s3_40, 0x06, out a1_685, out a2_686, out a3_687, out a4_688, out a5_689, out a6_690, out a7_691);
				word32 a1_692;
				word32 a2_693;
				word32 a4_694;
				word32 a5_695;
				word32 a6_696;
				word32 a7_697;
				Eq_2 a3_126;
				memcpy((word32) s0_130 + 0x0022, (word32) s3_40 + 6, 0x06, out a1_692, out a2_693, out a3_126, out a4_694, out a5_695, out a6_696, out a7_697);
				*((word32) s1_131 + 0x0C) = s0_130;
				ui32 a5_100 = (word32) *((word32) s3_40 + 0x0D);
				Eq_2 a4_101 = (word32) *((word32) s3_40 + 0x0C);
				*((word32) s0_130 + 54) = 0x00;
				*((word32) s0_130 + 40) = (word16) (a5_100 << 8 | a4_101);
				if (a3 != 0x00)
					a5_109 = (word32) a0->bFFFE1C;
				else
					a5_109 = (word32) a0->bFFFE20;
				*((word32) s0_130 + 55) = (byte) a5_109;
				((word32) s0_130 + 58)->u2 = 0x00;
				*((word32) s0_130 + 20) = (word16) (s4_41 + ~0x0D);
				if (a3 != 0x00)
					*((word32) s0_130 + 56) = a0->tFFFE24;
				else
				{
					word32 a0_123;
					s0_130 = bl_utils_idx_lookup(a0, s3_40, out s1_131, out a0_123, out a3_126, out a4_101);
					*((word32) s0_130 + 56) = (byte) a0_123;
				}
				struct Eq_106543 * s4_143 = (word32) s0_130 + 60;
				Eq_2 s2_146 = s1_131;
				int32 s3_147 = 0x00;
				int32 s5_148 = 0x04;
				word32 s6_149 = 0x230B2000;
				do
				{
					if (s3_147 == 0x00)
					{
						*((word32) *((word32) s2_146 + 4) + 202) = s0_130;
						((Eq_2[]) -66)[(word32) *((word32) s2_146 + 0x0A) / 4] = s0_130;
					}
					else
					{
						if (s3_147 == s5_148)
						{
							word32 a5_739;
							word32 s8_742;
							word32 s7_741;
							word32 a7_740;
							word32 a2_738;
							word32 a1_737;
							word32 s10_744;
							word32 a0_736;
							word32 s11_745;
							word32 t4_746;
							word32 s9_743;
							ra_157 = printf(ra_157, s6_149 + 1808, a3_126, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_131, out a0_736, out a1_737, out a2_738, out a3_126, out a4_101, out a5_739, out a7_740, out s2_146, out s3_147, out s4_143, out s5_148, out s6_149, out s7_741, out s8_742, out s9_743, out s10_744, out s11_745, out t4_746);
						}
						s4_143->dw0000 = (word32) *((word32) s2_146 + 4);
						s4_143[4] = (struct Eq_106543) (word32) *((word32) s2_146 + 0x0A);
					}
					s2_146 = *s2_146;
					++s3_147;
					++s4_143;
				} while (s2_146 != 0x00);
				if (s3_147 > 0x02)
				{
					word32 s11_734;
					word32 s10_733;
					word32 s8_731;
					word32 s7_730;
					word32 s6_729;
					word32 t4_735;
					word32 s9_732;
					word32 a2_722;
					word32 a5_723;
					word32 a7_724;
					word32 s3_726;
					word32 s4_727;
					word32 s5_728;
					word32 s2_725;
					word32 a0_720;
					word32 a1_721;
					ra_157 = printf(ra_157, &g_t230B2750, a3_126, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_131, out a0_720, out a1_721, out a2_722, out a3_126, out a4_101, out a5_723, out a7_724, out s2_725, out s3_726, out s4_727, out s5_728, out s6_729, out s7_730, out s8_731, out s9_732, out s10_733, out s11_734, out t4_735);
				}
				*(union Eq_2 *) 0x11111121 = s0_130;
				*((word32) s0_130 + 28) = s0_130;
				*((word32) s0_130 + 4) = 0x00;
				Eq_2 a3_268;
				Eq_2 a4_269;
				word32 a5_717;
				pbuf_ref(s1_131, a3_126, a4_101, mstatus, out a3_268, out a4_269, out a5_717);
				struct Eq_106483 * a5_271;
				vTaskEnterCritical(a4_269, mstatus, out a5_271);
				utils_list_push_back(s0_130, a5_271);
				word32 a5_719;
				word32 a4_718;
				vTaskExitCritical(a3_268, mstatus, out a4_718, out a5_719);
				bl_irq_handler(ra_157, mstatus, dwLoc08, dwArg18, dwArgA4, dwArgC0, dwArgC4, dwArgE8);
			}
l23023CBC:
			0x00 = dwArgA8;
			return;
		}
	}
	word32 a2_661;
	word32 a4_663;
	word32 a3_662;
	word32 a1_660;
	word32 a0_659;
	word32 s1_658;
	word32 a5_664;
	word32 a7_665;
	word32 s5_669;
	word32 s7_671;
	word32 s6_670;
	word32 s4_668;
	word32 s9_673;
	word32 s2_666;
	word32 s3_667;
	word32 s8_672;
	word32 s11_675;
	word32 s10_674;
	word32 t4_676;
	printf(ra, &g_t230B26C8, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_658, out a0_659, out a1_660, out a2_661, out a3_662, out a4_663, out a5_664, out a7_665, out s2_666, out s3_667, out s4_668, out s5_669, out s6_670, out s7_671, out s8_672, out s9_673, out s10_674, out s11_675, out t4_676);
	goto l23023CBC;
}

// 23023E38: void bl_radarind()
void bl_radarind()
{
}

// 23023E3C: void bl_msgackind(Register word32 ra, Register (ptr32 code) a5)
void bl_msgackind(word32 ra, <anonymous> * a5)
{
	a5();
}

// 23023E4E: void bl_prim_tbtt_ind()
void bl_prim_tbtt_ind()
{
}

// 23023E50: void my_pbuf_free_custom(Register (ptr32 Eq_28009) s0, Register (ptr32 Eq_106622) a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24)
void my_pbuf_free_custom(struct Eq_28009 * s0, struct Eq_106622 * a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24)
{
	struct Eq_29004 * a0_5 = a0->ptr0014;
	bl60x_firmwre_mpdu_free(s0, a0_5, a1, a4, mstatus, dwArg08, dwArg24);
}

// 23023E56: void bl_dbgind()
void bl_dbgind()
{
}

// 23023E5A: void bl_sec_tbtt_ind()
void bl_sec_tbtt_ind()
{
}

// 23023E5C: void my_pbuf_free_custom_fake()
void my_pbuf_free_custom_fake()
{
}

