pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23023E5E: Register Eq_2 tcpip_stack_input(Register Eq_2 ra, Register ui32 a1, Register (ptr32 Eq_45610) a2, Register Eq_45560 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 s7, Register ptr32 s8, Register ptr32 s9, Register ptr32 s10, Register ptr32 s11, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg08, Stack word32 dwArgA8, Stack word32 dwArg0104, Stack word32 dwArg0124, Stack word32 dwArg0144, Stack word32 dwArg0164, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_45629 a1Out, Register out Eq_45560 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out Eq_45560 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxu_swdesc_upload_evt
Eq_2 tcpip_stack_input(Eq_2 ra, ui32 a1, struct Eq_45610 * a2, Eq_45560 a3, Eq_2 a4, Eq_2 s3, ptr32 s7, ptr32 s8, ptr32 s9, ptr32 s10, ptr32 s11, ptr32 fflags, ptr32 frm, Eq_2 dwArg08, word32 dwArgA8, word32 dwArg0104, word32 dwArg0124, word32 dwArg0144, word32 dwArg0164, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_45629 & a1Out, union Eq_45560 & a3Out, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_45560 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if ((a1 & 0x01) == 0x00)
	{
		s0Out = s0;
		a0Out = ~0x00;
		a1Out = a1 & 0x01;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		s11Out = s11;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
	Eq_99509 s2_102;
	struct Eq_106640 * sp_5 = fp + -144;
	struct Eq_106644 * a5_34 = (word32) a2->b0031;
	if (a5_34 == (struct Eq_106644 *) 0x00FF)
	{
		s2_102 = g_t420233F8;
		a5_34 = (struct Eq_106644 *) &g_t420233F8;
		while (s2_102 != 0x420233F8)
		{
			if ((word32) *((byte) s2_102.u0 + 111) != 0x00)
				goto l23023ED6;
			s2_102 = *s2_102;
		}
	}
	else
	{
		s2_102.u0 = 0x00;
		if (a5_34 > (struct Eq_106644 *) 0x01)
			goto l23023ED6;
		s2_102 = (char *) &a5_34->t0030 + 0x42023494;
		a5_34 = (word32) a5_34->b42023533;
		if (a5_34 != null)
		{
l23023ED6:
			Eq_45629 a1_398;
			Eq_2 a2_59 = a5_34->t0030;
			Eq_2 s4_104 = a4;
			Eq_45560 s6_106 = a3;
			Eq_2 s0_162 = a2_59;
			if ((a5_34 & 2) != 0x00)
			{
				word32 s1_601 = Mem72[a4 + 0x00:int32] + a3;
				bl_rx_pkt_cb(s1_601);
				a1_398 = (word32) s1_601->w0000;
				if ((a1_398 & 252) != 0x0080 && ((word32) ((word16) ((a1_398 & 252) + -0x00A0 & -33)) != 0x00 || (word32) ((word16) ((word32) s1_601->t0018 + ~0x05)) > 0x01) && (((a1_398 & 252) != 0x00D0 || (word32) s1_601->t0018 != 0x06) && ((a1_398 & 0x0C) != 0x08 && (a1_398 & 0x008C) == 0x0088)))
				{
					word32 s5_1072;
					word32 s9_1073;
					word32 t4_1074;
					word32 s2_1071;
					word32 a7_1070;
					word32 a4_1068;
					word32 a5_1069;
					word32 a0_1065;
					word32 a2_1066;
					word32 a3_1067;
					word32 s1_1064;
					printf(ra, &g_t230B289C, (word32) s1_601->b0005, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1064, out a0_1065, out a1_398, out a2_1066, out a3_1067, out a4_1068, out a5_1069, out a7_1070, out s2_1071, out s3, out s4_104, out s5_1072, out s6_106, out s7, out s8, out s9_1073, out s10, out s11, out t4_1074);
				}
				goto l23023F70;
			}
			Eq_2 a3_274 = (word32) *((word32) a2_59 + 50);
			struct Eq_106695 * a4_112 = (struct Eq_106695 *) 0x00FF;
			if (a3_274 != 0x00FF && ((a5_34 & 0x04) != 0x00 && (word32) (*((word32) s2_102 + 112)) == 0x00))
			{
				word32 s5_1082;
				word32 t4_1083;
				word32 s3_1081;
				word32 a7_1080;
				word32 s1_1075;
				word32 a0_1076;
				word32 a5_1079;
				word32 a1_1077;
				word32 a2_1078;
				ra = printf(ra, &g_t230B28D0, a3_274, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1075, out a0_1076, out a1_1077, out a2_1078, out a3_274, out a4_112, out a5_1079, out a7_1080, out s2_102, out s3_1081, out s4_104, out s5_1082, out s6_106, out s7, out s8, out s9, out s10, out s11, out t4_1083);
			}
			if (wifi_mgmr_ext_dump_needed(a4_112) != 0x00)
			{
				uint32 s1_135 = (word32) (word16) ((word32) (word16) (int32) *((word32) a2_59 + 26) << 8 | (int32) (*((word32) a2_59 + 25)));
				word32 a5_1084;
				if (xTaskGetTickCount(out a5_1084) - g_t4200F388 > 0x00FFFFA0)
				{
					g_dw4200F38C = 0x00;
					g_dw4200F380 = 0x00;
				}
				struct Eq_274 * a0_321;
				++g_dw4200F38C;
				word32 a5_1085;
				Eq_2 a0_148 = xTaskGetTickCount(out a5_1085);
				ui32 a4_151 = (word32) *((word32) a2_59 + 18);
				g_t4200F388 = a0_148;
				Eq_2 s10_160 = (int32) *((word32) a2_59 + 23);
				if ((a4_151 & 0x07) > 0x01)
				{
					word32 * a4_323 = (word32) *((word32) a2_59 + 31);
					word32 * a4_335 = a4_323 + ((int32) ((word16) ((word32) (*((word32) a2_59 + 32)) << 8 | a4_323)) ^ 122);
					real32 fa0_333 = (real32) g_dw4200F38C;
					*a4_335 = *a4_323;
					word32 a1_1109;
					__extendsfdf2(ra, (real32) a4_335 / fa0_333, fflags, frm, out a1_1109);
					a0_321 = (struct Eq_274 *) &g_t230B28F8;
				}
				else
				{
					s0_162 = *(union Eq_2 *) 0x0D;
					ui32 a4_167 = (word32) *((word32) s0_162 + 31);
					int32 s3_168 = g_dw4200F380;
					real32 fs0_169 = (real32) g_dw4200F38C;
					if (true)
					{
						word32 s9_1119;
						word32 s7_1117;
						word32 s8_1118;
						Eq_2 a1_181;
						word32 s5_1115;
						Eq_2 a0_201;
						Eq_2 a1_202;
						word32 s3_222;
						word32 s6_1116;
						word32 s4_1114;
						word32 s2_1113;
						word32 a3_1112;
						word32 s1_1111;
						word32 s0_1110;
						Eq_2 ra_218 = __muldf3(ra, __floatsidf((int32) (word16) (0x00 - (int32) ((byte) a4_167)), out a1_181), a1_181, g_t230AA3B0, g_t230AA3B4, fflags, frm, out s0_1110, out s1_1111, out a0_201, out a1_202, out a3_1112, out s2_1113, out s3_222, out s4_1114, out s5_1115, out s6_1116, out s7_1117, out s8_1118, out s9_1119, out fflags, out frm);
						word32 a5_1122;
						word32 a4_1121;
						struct Eq_107199 * a3_232;
						word32 a1_1120;
						Eq_2 a0_229 = __fixdfsi(ra_218, a0_201, a1_202, fflags, frm, out a1_1120, out a3_232, out a4_1121, out a5_1122);
						int32 s3_236 = (word32) a0_229 + s3_222;
						s0_162 = a3_232->t0024;
						g_dw4200F380 = s3_236;
						word32 a1_1123;
						Eq_2 a0_247 = __extendsfdf2(ra_218, (real32) s3_236 / fs0_169, fflags, frm, out a1_1123);
						dwArg08 = a0_229;
						dwLoc88 = a0_247;
						word32 s1_1124;
						word32 a2_1127;
						word32 a1_1126;
						word32 a0_1125;
						word32 s5_1132;
						word32 a5_1129;
						word32 a7_1130;
						word32 s3_1131;
						word32 a4_1128;
						word32 t4_1133;
						ra = printf(ra_218, &g_t230B29D0, a3_232 >> 8 & 0x01, a0_247, dwLoc68, dwLoc20, dwLoc1C, a0_229, s3, out s1_1124, out a0_1125, out a1_1126, out a2_1127, out a3_274, out a4_1128, out a5_1129, out a7_1130, out s2_102, out s3_1131, out s4_104, out s5_1132, out s6_106, out s7, out s8, out s9, out s10, out s11, out t4_1133);
						goto l2302407E;
					}
					int32 s3_299 = s3_168 + ((int32) ((word16) ((word32) (*((word32) s0_162 + 32)) << 8 | a4_167)) ^ 122);
					g_dw4200F380 = s3_299;
					word32 a1_1134;
					__extendsfdf2(ra, (real32) s3_299 / fs0_169, fflags, frm, out a1_1134);
					a0_321 = (struct Eq_274 *) &g_t230B2964;
				}
				dwArg08 = s1_135 >> 0x09;
				word32 s1_1135;
				word32 a0_1136;
				word32 a5_1140;
				word32 a7_1141;
				word32 a2_1138;
				word32 a1_1137;
				word32 a4_1139;
				word32 s5_1143;
				word32 s3_1142;
				word32 t4_1144;
				ra = printf(ra, a0_321, s10_160, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, s1_135 >> 0x09, s3, out s1_1135, out a0_1136, out a1_1137, out a2_1138, out a3_274, out a4_1139, out a5_1140, out a7_1141, out s2_102, out s3_1142, out s4_104, out s5_1143, out s6_106, out s7, out s8, out s9, out s10, out s11, out t4_1144);
			}
l2302407E:
			if (s2_102 != 0x00)
			{
				word32 a2_1100;
				word32 a5_1102;
				word32 a4_1101;
				word32 a1_1099;
				word32 a0_1098;
				word32 t1_1097;
				Eq_2 a3_427;
				Eq_2 ra_430 = memset(ra, *((word32) s4_104 + 16), 0x00, 0x18, out t1_1097, out a0_1098, out a1_1099, out a2_1100, out a3_427, out a4_1101, out a5_1102);
				g_t23023E60 = a3_427;
				g_t23023E64 = a3_427;
				ptr32 a5_448 = (word32) (word16) ((word32) *((word32) s4_104 + 32) - s6_106);
				word32 a5_1103;
				Eq_2 a4_454;
				word32 a0_451 = pbuf_alloced_custom(0x00, a5_448, 65, a3_427, Mem440[s4_104 + 0x00:int32] + s6_106, a5_448, out a4_454, out a5_1103);
				s0_162 = (word32) s4_104 + 0x0022;
				ptr32 s1_456 = (word32) s4_104 + 4;
				s4_104 = (word32) s4_104 + 40;
				s3.u0 = 0x23023E5C;
				do
				{
					<anonymous> * a5_462 = (word32) *s0_162;
					if (a5_462 == null)
						break;
					struct Eq_107009 * a4_475;
					word32 a1_1106;
					word32 a2_1107;
					word32 a5_1108;
					word32 a0_1105;
					word32 t1_1104;
					ra_430 = memset(ra_430, a3_427, 0x00, 0x18, out t1_1104, out a0_1105, out a1_1106, out a2_1107, out a3_427, out a4_475, out a5_1108);
					*((word32) a3_427 + 16) = 0x23023E5C;
					ptr32 a5_485 = (word32) *s0_162;
					word32 s1_486 = a4_475->dw0000;
					pbuf_cat(a0_451, pbuf_alloced_custom(0x00, a5_485, 65, a3_427, a4_475, a5_485, out a4_454, out a5_462), a4_454);
					s0_162 = (word32) s0_162 + 2;
					s1_456 = s1_486 + 0x04;
				} while (s0_162 != s4_104);
				a1_398 = *((word32) s2_102 + 8);
				if (a1_398 != 0x00)
				{
					word32 a5_579;
					word32 a7_583;
					word32 a6_584;
					word32 t1_585;
					word32 t4_586;
					word32 t0_587;
					word32 fa0_588;
					word32 fa5_589;
					word32 fs0_590;
					word32 t3_591;
					word32 t2_594;
					word32 t5_595;
					word32 t6_596;
					a5_462();
l230240F4:
					struct Eq_106797 * sp_676 = sp_5->ptr0048;
					Eq_2 a4_673 = sp_5->t0020;
					ptr32 a0_674 = sp_5->ptr0004;
					ptr32 s9_678 = sp_676->ptr0198;
					ptr32 s5_679 = sp_676->ptr01B8;
					Eq_2 ra_684 = sp_676->t015C;
					Eq_45560 a3_686 = sp_676->t0008;
					s0Out = s0_162;
					a0Out = a0_674;
					a1Out = a1_398;
					a3Out = a3_686;
					a4Out = a4_673;
					s3Out = s3;
					s4Out = s4_104;
					s5Out = s5_679;
					s6Out = s6_106;
					s7Out = s7;
					s8Out = s8;
					s9Out = s9_678;
					s10Out = s10;
					s11Out = s11;
					fflagsOut = fflags;
					frmOut = frm;
					return ra_684;
				}
			}
			else
			{
				word32 s9_1095;
				word32 t4_1096;
				word32 s5_1094;
				word32 s2_1093;
				word32 a7_1092;
				word32 a5_1091;
				word32 a4_1090;
				word32 a3_1089;
				word32 a2_1088;
				word32 a0_1087;
				word32 s1_1086;
				printf(ra, &g_t230B2A4C, a3_274, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1086, out a0_1087, out a1_398, out a2_1088, out a3_1089, out a4_1090, out a5_1091, out a7_1092, out s2_1093, out s3, out s4_104, out s5_1094, out s6_106, out s7, out s8, out s9_1095, out s10, out s11, out t4_1096);
			}
l23023F70:
			goto l230240F4;
		}
	}
	s2_102.u0 = 0x00;
	goto l23023ED6;
}

Eq_2 g_t23023E60 = 
	{
		-0x0067
	};
Eq_2 g_t23023E64 = 
	{
		-0x007E
	};
// 2302424C: Register Eq_2 bl_utils_idx_lookup(Register (ptr32 Eq_106154) a0, Register Eq_2 a1, Register out (ptr32 Eq_106418) s1Out, Register out (ptr32 Eq_106418) a0Out, Register out ptr32 a3Out, Register out Eq_106421 a4Out)
// Called from:
//      bl_output
Eq_2 bl_utils_idx_lookup(struct Eq_106154 * a0, Eq_2 a1, struct Eq_106418 & s1Out, struct Eq_106418 & a0Out, ptr32 & a3Out, union Eq_106421 & a4Out)
{
	Eq_2 s0_19 = (char *) a0 + 0x00FFFC90;
	struct Eq_106418 * s1_20 = null;
	do
	{
		if ((word32) *((word32) s0_19 + 8) != 0x00)
		{
			word32 a1_103;
			word32 a2_104;
			word32 a5_105;
			if (memcmp(s0_19, a1, 0x06, out a1_103, out a2_104, out a3, out a4, out a5_105) == 0x00)
				goto l2302428E;
		}
		s1_20 = (struct Eq_106418 *) ((char *) s1_20 + 1);
		s0_19 = (word32) s0_19 + 28;
	} while (s1_20 != (struct Eq_106418 *) 0x0C);
	s1_20 = g_ptr42023EC8;
l2302428E:
	s1Out = s1_20;
	a0Out = s1_20;
	a3Out = a3;
	a4Out = a4;
	return s0_19;
}

// 2302429E: Register Eq_2 bl_ipc_init(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      bl_platform_on
Eq_2 bl_ipc_init(Eq_2 ra, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	word32 t1_153;
	word32 a0_154;
	word32 a1_155;
	word32 a2_156;
	word32 a5_157;
	Eq_2 ra_23 = memset(ra, fp + -48, 0x00, 32, out t1_153, out a0_154, out a1_155, out a2_156, out a3_20, out a4_21, out a5_157);
	Eq_2 a0_48;
	Eq_2 s2_57;
	word32 s1_158;
	word32 a1_159;
	word32 a2_160;
	word32 a3_161;
	word32 a4_162;
	word32 a5_163;
	word32 a6_164;
	word32 s3_165;
	word32 s4_166;
	word32 s8_167;
	*((word32) a0_48 + 52) = pvPortMalloc(ra_23, a1, 228, a3_20, a4_21, 587349594, mstatus, dwArg10, dwArg14, 587349594, dwArg0108, dwArg0148, out s1_158, out a0_48, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a6_164, out s2_57, out s3_165, out s4_166, out s8_167);
	g_t4200F384 = a0_48;
	Eq_2 a3_72;
	Eq_2 a4_73;
	word32 s0_78;
	Eq_2 ra_77 = ipc_host_init(ra_23, a0_48, s2_57, 0x23023E3C, dwArg18, dwArg20, dwArg24, dwArg48, dwArg6C, out s0_78, out a3_72, out a4_73);
	ptr32 a3_100;
	ptr32 s2_106;
	ptr32 s1_105 = bl_cmd_mgr_init(ra_77, s0_78 + 4, a3_72, a4_73, mstatus, 0x23023BF2, 0x23023E38, 0x00, dwArgC8, dwArg0108, dwArg0148, out a3_100, out s2_106);
	s0Out = dwArgE4;
	s1Out = s1_105;
	a0Out = 0x00;
	a3Out = a3_100;
	s2Out = s2_106;
	return ra_77;
}

// 23024326: void bl_utils_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
// Called from:
//      bl60x_fw_dump_statistic
void bl_utils_dump(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	word32 a0_250;
	word32 a1_251;
	word32 a2_252;
	word32 a4_253;
	word32 a5_254;
	word32 s4_255;
	word32 s8_256;
	puts(0x230B27B4, out a0_250, out a1_251, out a2_252, out a4_253, out a5_254, out s4_255, out s8_256);
	Eq_2 a3_41;
	Eq_2 a3_69;
	word32 s1_257;
	word32 a0_258;
	word32 a1_259;
	word32 a2_260;
	word32 a4_261;
	word32 a5_262;
	word32 a7_263;
	word32 s2_264;
	word32 s3_265;
	word32 s4_266;
	word32 s5_267;
	word32 s6_268;
	word32 s7_269;
	word32 s8_270;
	word32 s9_271;
	word32 s10_272;
	word32 s11_273;
	word32 t4_274;
	word32 s1_275;
	word32 a0_276;
	word32 a1_277;
	word32 a2_278;
	word32 a4_279;
	word32 a5_280;
	word32 a7_281;
	word32 s2_282;
	word32 s3_283;
	word32 s4_284;
	word32 s5_285;
	word32 s6_286;
	word32 s7_287;
	word32 s8_288;
	word32 s9_289;
	word32 s10_290;
	word32 s11_291;
	word32 t4_292;
	word32 s1_293;
	word32 a0_294;
	word32 a1_295;
	word32 a2_296;
	word32 a4_297;
	word32 a5_298;
	word32 a7_299;
	word32 s2_300;
	word32 s4_301;
	word32 s5_302;
	word32 s6_303;
	word32 s7_304;
	word32 s8_305;
	word32 s9_306;
	word32 s10_307;
	word32 s11_308;
	word32 t4_309;
	word32 s3_107;
	Eq_2 a3_149;
	Eq_2 ra_102 = printf(printf(printf(ra, &g_t230B27DC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_257, out a0_258, out a1_259, out a2_260, out a3_41, out a4_261, out a5_262, out a7_263, out s2_264, out s3_265, out s4_266, out s5_267, out s6_268, out s7_269, out s8_270, out s9_271, out s10_272, out s11_273, out t4_274), &g_t230B27F8, a3_41, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_275, out a0_276, out a1_277, out a2_278, out a3_69, out a4_279, out a5_280, out a7_281, out s2_282, out s3_283, out s4_284, out s5_285, out s6_286, out s7_287, out s8_288, out s9_289, out s10_290, out s11_291, out t4_292), &g_t230B2814, a3_69, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_293, out a0_294, out a1_295, out a2_296, out a3_149, out a4_297, out a5_298, out a7_299, out s2_300, out s3_107, out s4_301, out s5_302, out s6_303, out s7_304, out s8_305, out s9_306, out s10_307, out s11_308, out t4_309);
	word32 a0_310;
	word32 a2_311;
	word32 a5_312;
	word32 s4_313;
	word32 s8_314;
	word32 a1_122;
	word32 a4_123;
	puts(587933748, out a0_310, out a1_122, out a2_311, out a4_123, out a5_312, out s4_313, out s8_314);
	word32 s0_135 = 0x00;
	while (a1_122 + s0_135 != a4_123)
	{
		++s0_135;
		word32 s2_165;
		word32 s1_315;
		word32 a0_316;
		word32 a2_317;
		word32 a5_318;
		word32 a7_319;
		word32 s4_320;
		word32 s5_321;
		word32 s6_322;
		word32 s7_323;
		word32 s8_324;
		word32 s9_325;
		word32 s10_326;
		word32 s11_327;
		word32 t4_328;
		ra_102 = printf(ra_102, s3_107 + -0x07A4, a3_149, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_315, out a0_316, out a1_122, out a2_317, out a3_149, out a4_123, out a5_318, out a7_319, out s2_165, out s3_107, out s4_320, out s5_321, out s6_322, out s7_323, out s8_324, out s9_325, out s10_326, out s11_327, out t4_328);
		if (s0_135 == s2_165)
			break;
	}
	word32 a0_329;
	word32 a1_330;
	word32 a2_331;
	word32 a4_332;
	word32 a5_333;
	word32 s4_334;
	word32 s8_335;
	puts(0x230B2874, out a0_329, out a1_330, out a2_331, out a4_332, out a5_333, out s4_334, out s8_335);
}

// 230243E8: void stateSnifferGuard()
void stateSnifferGuard()
{
}

// 230243F6: void stateConnectedIPYesGuard_ip_update()
void stateConnectedIPYesGuard_ip_update()
{
}

// 23024404: void printErrMsg(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void printErrMsg(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t230B2B54, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

// 23024410: void stateSnifferExit(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateSnifferExit(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t230B32C4, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 2302441E: void stateSnifferAction(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateSnifferAction(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a3_42;
	word32 a4_43;
	word32 a5_44;
	word32 a7_45;
	word32 s2_46;
	word32 s3_47;
	word32 s4_48;
	word32 s5_49;
	word32 s6_50;
	word32 s7_51;
	word32 s8_52;
	word32 s9_53;
	word32 s10_54;
	word32 s11_55;
	word32 t4_56;
	printf(ra, &g_t230B3290, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_38, out a0_39, out a1_40, out a2_41, out a3_42, out a4_43, out a5_44, out a7_45, out s2_46, out s3_47, out s4_48, out s5_49, out s6_50, out s7_51, out s8_52, out s9_53, out s10_54, out s11_55, out t4_56);
}

// 2302442C: void stateConnectedIPNoAction_ipgot(Register Eq_2 ra, Register (ptr32 Eq_107812) a4, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void stateConnectedIPNoAction_ipgot(Eq_2 ra, struct Eq_107812 * a4, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_189;
	word32 a0_190;
	word32 a1_191;
	word32 a2_192;
	word32 a3_193;
	word32 a4_194;
	word32 a5_195;
	word32 a7_196;
	word32 s2_197;
	word32 s3_198;
	word32 s4_199;
	word32 s5_200;
	word32 s6_201;
	word32 s7_202;
	word32 s8_203;
	word32 s9_204;
	word32 s10_205;
	word32 s11_206;
	word32 t4_207;
	Eq_2 ra_117 = printf(ra, &g_t230B2B88, ((word32) a4->b000F << 16 | ((word32) a4->b000D | (word32) a4->b000E << 8)) >> 16, ((word32) a4->b0018 << 24 | (((word32) a4->b0016 << 8 | (word32) a4->b0015) | (word32) a4->b0017 << 16)) >> 0x18, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203, out s9_204, out s10_205, out s11_206, out t4_207);
	word32 s1_208;
	word32 a0_209;
	word32 a1_210;
	word32 a2_211;
	word32 a3_212;
	word32 a4_213;
	word32 a5_214;
	word32 a7_215;
	word32 s2_216;
	word32 s3_217;
	word32 s4_218;
	word32 s5_219;
	word32 s6_220;
	word32 s7_221;
	word32 s8_222;
	word32 s9_223;
	word32 s10_224;
	word32 s11_225;
	word32 t4_226;
	printf(ra_117, &g_t230B3290, dwLoc30, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_208, out a0_209, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214, out a7_215, out s2_216, out s3_217, out s4_218, out s5_219, out s6_220, out s7_221, out s8_222, out s9_223, out s10_224, out s11_225, out t4_226);
}

