pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23024944: void stateConnectedIPYesGuard_disconnect(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 byte) a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateConnectedIPYesGuard_disconnect(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, byte * a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg6C, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	stateConnectedIPNoGuard_disconnect(ra, a0, a3, a4, a5, s3, mstatus, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
}

// 23024948: void stateConnectedIPYesGuard_rcconfig(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateConnectedIPYesGuard_rcconfig(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (a0 == (word32) (*s0))
	{
		Eq_2 a3_29;
		Eq_2 a4_30;
		Eq_2 s3_37;
		word32 s1_158;
		word32 a0_159;
		word32 a1_160;
		word32 a2_161;
		word32 a5_162;
		word32 a7_163;
		word32 s2_164;
		word32 s4_165;
		word32 s5_166;
		word32 s6_167;
		word32 s7_168;
		word32 s8_169;
		word32 s9_170;
		word32 s10_171;
		word32 s11_172;
		word32 t4_173;
		bl_main_rate_config(printf(ra, &g_t230B2C6C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_158, out a0_159, out a1_160, out a2_161, out a3_29, out a4_30, out a5_162, out a7_163, out s2_164, out s3_37, out s4_165, out s5_166, out s6_167, out s7_168, out s8_169, out s9_170, out s10_171, out s11_172, out t4_173), a3_29, a4_30, (word32) *((word32) s0 + 2) << 8, s3_37, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
}

// 2302499C: void stateIdleAction_connect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void stateIdleAction_connect(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArg0128)
{
	((word32) s0 + 45)->u0 = 0x00;
	*((word32) s0 + 114) = 0x00;
	Eq_2 a3_33;
	Eq_2 a3_59;
	Eq_2 a3_95;
	Eq_2 a3_120;
	Eq_2 a3_154;
	Eq_2 a3_179;
	Eq_2 a3_213;
	Eq_2 a3_238;
	Eq_2 a3_296;
	word32 s11_535;
	word32 s10_534;
	word32 s9_533;
	word32 s8_532;
	word32 s7_531;
	word32 s6_530;
	word32 s5_529;
	word32 s4_528;
	word32 s3_527;
	word32 s2_526;
	word32 a7_525;
	word32 a5_524;
	word32 a4_523;
	word32 a2_522;
	word32 a1_521;
	word32 a0_520;
	word32 s1_519;
	word32 t4_536;
	word32 s1_537;
	word32 a0_538;
	word32 a1_539;
	word32 a2_540;
	word32 a4_541;
	word32 a5_542;
	word32 a7_543;
	word32 s2_544;
	word32 s3_545;
	word32 s4_546;
	word32 s5_547;
	word32 s6_548;
	word32 s7_549;
	word32 s8_550;
	word32 s9_551;
	word32 s10_552;
	word32 s11_553;
	word32 t4_554;
	word32 s1_555;
	word32 a0_556;
	word32 a1_557;
	word32 a2_558;
	word32 a4_559;
	word32 a5_560;
	word32 a7_561;
	word32 s2_562;
	word32 s3_563;
	word32 s4_564;
	word32 s5_565;
	word32 s6_566;
	word32 s7_567;
	word32 s8_568;
	word32 s9_569;
	word32 s10_570;
	word32 s11_571;
	word32 t4_572;
	word32 s1_573;
	word32 a0_574;
	word32 a1_575;
	word32 a2_576;
	word32 a4_577;
	word32 a5_578;
	word32 a7_579;
	word32 s2_580;
	word32 s3_581;
	word32 s4_582;
	word32 s5_583;
	word32 s6_584;
	word32 s7_585;
	word32 s8_586;
	word32 s9_587;
	word32 s10_588;
	word32 s11_589;
	word32 t4_590;
	word32 s1_591;
	word32 a0_592;
	word32 a1_593;
	word32 a2_594;
	word32 a4_595;
	word32 a5_596;
	word32 a7_597;
	word32 s2_598;
	word32 s3_599;
	word32 s4_600;
	word32 s5_601;
	word32 s6_602;
	word32 s7_603;
	word32 s8_604;
	word32 s9_605;
	word32 s10_606;
	word32 s11_607;
	word32 t4_608;
	word32 s1_609;
	word32 a0_610;
	word32 a1_611;
	word32 a2_612;
	word32 a4_613;
	word32 a5_614;
	word32 a7_615;
	word32 s2_616;
	word32 s3_617;
	word32 s4_618;
	word32 s5_619;
	word32 s6_620;
	word32 s7_621;
	word32 s8_622;
	word32 s9_623;
	word32 s10_624;
	word32 s11_625;
	word32 t4_626;
	word32 s1_627;
	word32 a0_628;
	word32 a1_629;
	word32 a2_630;
	word32 a4_631;
	word32 a5_632;
	word32 a7_633;
	word32 s2_634;
	word32 s3_635;
	word32 s4_636;
	word32 s5_637;
	word32 s6_638;
	word32 s7_639;
	word32 s8_640;
	word32 s9_641;
	word32 s10_642;
	word32 s11_643;
	word32 t4_644;
	word32 s1_645;
	word32 a0_646;
	word32 a1_647;
	word32 a2_648;
	word32 a4_649;
	word32 a5_650;
	word32 a7_651;
	word32 s2_652;
	word32 s3_653;
	word32 s4_654;
	word32 s5_655;
	word32 s6_656;
	word32 s7_657;
	word32 s8_658;
	word32 s9_659;
	word32 s10_660;
	word32 s11_661;
	word32 t4_662;
	word32 s1_663;
	word32 a0_664;
	word32 a1_665;
	word32 a2_666;
	word32 a3_667;
	word32 a4_668;
	word32 a5_669;
	word32 a7_670;
	word32 s2_671;
	word32 s3_672;
	word32 s4_673;
	word32 s5_674;
	word32 s6_675;
	word32 s7_676;
	word32 s8_677;
	word32 s9_678;
	word32 s10_679;
	word32 s11_680;
	word32 t4_681;
	word32 s1_682;
	word32 a0_683;
	word32 a1_684;
	word32 a2_685;
	word32 a4_686;
	word32 a5_687;
	word32 a7_688;
	word32 s2_689;
	word32 s3_690;
	word32 s4_691;
	word32 s5_692;
	word32 s6_693;
	word32 s7_694;
	word32 s8_695;
	word32 s9_696;
	word32 s10_697;
	word32 s11_698;
	word32 t4_699;
	Eq_2 ra_299 = printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(ra, &g_t230B319C, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_519, out a0_520, out a1_521, out a2_522, out a3_33, out a4_523, out a5_524, out a7_525, out s2_526, out s3_527, out s4_528, out s5_529, out s6_530, out s7_531, out s8_532, out s9_533, out s10_534, out s11_535, out t4_536), &g_t230B2D20, a3_33, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_537, out a0_538, out a1_539, out a2_540, out a3_59, out a4_541, out a5_542, out a7_543, out s2_544, out s3_545, out s4_546, out s5_547, out s6_548, out s7_549, out s8_550, out s9_551, out s10_552, out s11_553, out t4_554), &g_t230B2D38, a3_59, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_555, out a0_556, out a1_557, out a2_558, out a3_95, out a4_559, out a5_560, out a7_561, out s2_562, out s3_563, out s4_564, out s5_565, out s6_566, out s7_567, out s8_568, out s9_569, out s10_570, out s11_571, out t4_572), &g_t230B2D54, a3_95, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_573, out a0_574, out a1_575, out a2_576, out a3_120, out a4_577, out a5_578, out a7_579, out s2_580, out s3_581, out s4_582, out s5_583, out s6_584, out s7_585, out s8_586, out s9_587, out s10_588, out s11_589, out t4_590), &g_t230B2D68, a3_120, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_591, out a0_592, out a1_593, out a2_594, out a3_154, out a4_595, out a5_596, out a7_597, out s2_598, out s3_599, out s4_600, out s5_601, out s6_602, out s7_603, out s8_604, out s9_605, out s10_606, out s11_607, out t4_608), &g_t230B2D80, a3_154, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_609, out a0_610, out a1_611, out a2_612, out a3_179, out a4_613, out a5_614, out a7_615, out s2_616, out s3_617, out s4_618, out s5_619, out s6_620, out s7_621, out s8_622, out s9_623, out s10_624, out s11_625, out t4_626), &g_t230B2D94, a3_179, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_627, out a0_628, out a1_629, out a2_630, out a3_213, out a4_631, out a5_632, out a7_633, out s2_634, out s3_635, out s4_636, out s5_637, out s6_638, out s7_639, out s8_640, out s9_641, out s10_642, out s11_643, out t4_644), &g_t230B31B8, a3_213, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_645, out a0_646, out a1_647, out a2_648, out a3_238, out a4_649, out a5_650, out a7_651, out s2_652, out s3_653, out s4_654, out s5_655, out s6_656, out s7_657, out s8_658, out s9_659, out s10_660, out s11_661, out t4_662), &g_t230B31D8, a3_238, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_663, out a0_664, out a1_665, out a2_666, out a3_667, out a4_668, out a5_669, out a7_670, out s2_671, out s3_672, out s4_673, out s5_674, out s6_675, out s7_676, out s8_677, out s9_678, out s10_679, out s11_680, out t4_681), &g_t230B2DAC, (word32) *((word32) s0 + 191), dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_682, out a0_683, out a1_684, out a2_685, out a3_296, out a4_686, out a5_687, out a7_688, out s2_689, out s3_690, out s4_691, out s5_692, out s6_693, out s7_694, out s8_695, out s9_696, out s10_697, out s11_698, out t4_699);
	(word32) *((word32) s0 + 0x00C5) != 0x00;
	Eq_2 a3_329;
	Eq_2 s1_333;
	Eq_2 a3_353;
	Eq_2 s1_390;
	Eq_2 s2_393;
	word32 a0_700;
	word32 a1_701;
	word32 a2_702;
	word32 a4_703;
	word32 a5_704;
	word32 a7_705;
	word32 s2_706;
	word32 s3_707;
	word32 s4_708;
	word32 s5_709;
	word32 s6_710;
	word32 s7_711;
	word32 s8_712;
	word32 s9_713;
	word32 s10_714;
	word32 s11_715;
	word32 t4_716;
	word32 a0_717;
	word32 a1_718;
	word32 a2_719;
	word32 a3_720;
	word32 a4_721;
	word32 a5_722;
	word32 a7_723;
	word32 s3_724;
	word32 s4_725;
	word32 s5_726;
	word32 s6_727;
	word32 s7_728;
	word32 s8_729;
	word32 s9_730;
	word32 s10_731;
	word32 s11_732;
	word32 t4_733;
	bl_main_connect(printf(wifi_mgmr_profile_add(printf(ra_299, &g_t230B31F8, a3_296, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_333, out a0_700, out a1_701, out a2_702, out a3_329, out a4_703, out a5_704, out a7_705, out s2_706, out s3_707, out s4_708, out s5_709, out s6_710, out s7_711, out s8_712, out s9_713, out s10_714, out s11_715, out t4_716), &g_b42023F3C, s1_333, ~0x00, a3_329, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out a3_353), &g_t230B3290, a3_353, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_390, out a0_717, out a1_718, out a2_719, out a3_720, out a4_721, out a5_722, out a7_723, out s2_393, out s3_724, out s4_725, out s5_726, out s6_727, out s7_728, out s8_729, out s9_730, out s10_731, out s11_732, out t4_733), s0, s1_390, s2_393, (word32) s0 + 188, (word32) *((word32) s0 + 0x00C2), mstatus, (uint16) ((word32) *((word32) s0 + 0x00C4) << 8 | (word32) (*((word32) s0 + 0x00C3))), dwLoc18);
	0x00 = dwArg0128;
}

