pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23024B8C: void stateGlobal_cfg_req(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_109968) a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobal_cfg_req(Eq_2 ra, Eq_2 s0, struct Eq_109968 * a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgA4, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) a4->b0000 != 22)
		return;
	bl_main_cfg_task_req(ra, s0, (word32) a4->b0014 << 24 | ((word32) a4->b0013 << 16 | ((word32) a4->b0012 << 8 | (word32) a4->b0011)), (word32) a4->b0018 << 24 | ((word32) a4->b0017 << 16 | ((word32) a4->b0016 << 8 | (word32) a4->b0015)), (word32) a4->b001C << 24 | ((word32) a4->b001B << 16 | ((word32) a4->b001A << 8 | (word32) a4->b0019)), &a4->b001C + 5, s2, s3, mstatus, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgA4, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23024C3A: void stateGlobalGuard_fw_powersaving(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobalGuard_fw_powersaving(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) *s0 == 0x10)
	{
		Eq_2 a3_29;
		Eq_2 a4_30;
		Eq_2 s3_37;
		word32 s1_161;
		word32 a0_162;
		word32 a1_163;
		word32 a2_164;
		word32 a5_165;
		word32 a7_166;
		word32 s2_167;
		word32 s4_168;
		word32 s5_169;
		word32 s6_170;
		word32 s7_171;
		word32 s8_172;
		word32 s9_173;
		word32 s10_174;
		word32 s11_175;
		word32 t4_176;
		bl_main_powersaving(printf(ra, &g_t230B3024, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_161, out a0_162, out a1_163, out a2_164, out a3_29, out a4_30, out a5_165, out a7_166, out s2_167, out s3_37, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175, out t4_176), a3_29, a4_30, (word32) *((word32) s0 + 3) << 16 | ((word32) (*((word32) s0 + 2)) << 8 | (word32) (*((word32) s0 + 1))), s3_37, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
}

// 23024C9E: void stateGlobalGuard_conf_max_sta(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void stateGlobalGuard_conf_max_sta(Eq_2 ra, Eq_2 s0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if ((word32) *s0 == 0x0A)
	{
		Eq_2 a5_25;
		Eq_2 a3_29;
		Eq_2 a4_30;
		Eq_2 s3_37;
		word32 s1_153;
		word32 a0_154;
		word32 a1_155;
		word32 a2_156;
		word32 a7_157;
		word32 s2_158;
		word32 s4_159;
		word32 s5_160;
		word32 s6_161;
		word32 s7_162;
		word32 s8_163;
		word32 s9_164;
		word32 s10_165;
		word32 s11_166;
		word32 t4_167;
		bl_main_conf_max_sta(printf(ra, &g_t230B2F84, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_153, out a0_154, out a1_155, out a2_156, out a3_29, out a4_30, out a5_25, out a7_157, out s2_158, out s3_37, out s4_159, out s5_160, out s6_161, out s7_162, out s8_163, out s9_164, out s10_165, out s11_166, out t4_167), a3_29, a4_30, a5_25, s3_37, mstatus, dwLoc10, s0, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg48, dwArg58, dwArg6C, dwArg7C, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
	}
}

// 23024CEA: void stateGlobalGuard_AP(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack ptr32 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack word32 dwArgB0, Stack word32 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
void stateGlobalGuard_AP(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, ptr32 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, word32 dwArgB0, word32 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	if ((word32) *s0 == 0x08)
	{
		word32 a0_25;
		Eq_2 a3_28;
		Eq_2 a4_29;
		Eq_2 a5_30;
		ptr32 mstatus_33;
		Eq_2 s0_35;
		Eq_2 s2_39;
		Eq_2 ra_34 = bl_main_if_add(ra, s0, 0x00, a3, s2, s3, s4, mstatus, s2, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg48, ra, dwArg88, dwArg94, dwArgA8, dwArgB0, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s0_35, out a0_25, out a3_28, out a4_29, out a5_30, out s2_39, out mstatus_33);
		if (a0_25 != 0x00)
		{
			word32 s1_440;
			word32 a0_441;
			word32 a1_442;
			word32 a2_443;
			word32 a3_444;
			word32 a4_445;
			word32 a5_446;
			word32 a7_447;
			word32 s2_448;
			word32 s3_449;
			word32 s4_450;
			word32 s5_451;
			word32 s6_452;
			word32 s7_453;
			word32 s8_454;
			word32 s9_455;
			word32 s10_456;
			word32 s11_457;
			word32 t4_458;
			printf(ra_34, &g_t230B2EF0, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_440, out a0_441, out a1_442, out a2_443, out a3_444, out a4_445, out a5_446, out a7_447, out s2_448, out s3_449, out s4_450, out s5_451, out s6_452, out s7_453, out s8_454, out s9_455, out s10_456, out s11_457, out t4_458);
		}
		else
		{
			Eq_2 a3_61;
			Eq_2 a4_62;
			Eq_2 a5_63;
			Eq_2 s2_68;
			Eq_2 a3_88;
			Eq_2 a3_117;
			Eq_2 a3_143;
			Eq_2 s1_183;
			Eq_2 a0_210;
			Eq_2 a3_213;
			Eq_2 a4_214;
			ptr32 mstatus_218;
			Eq_2 s1_221;
			word32 a4_380;
			word32 a5_381;
			word32 s2_382;
			word32 s1_383;
			word32 a0_384;
			word32 a1_385;
			word32 a2_386;
			word32 a4_387;
			word32 a5_388;
			word32 a7_389;
			word32 s2_390;
			word32 s3_391;
			word32 s4_392;
			word32 s5_393;
			word32 s6_394;
			word32 s7_395;
			word32 s8_396;
			word32 s9_397;
			word32 s10_398;
			word32 s11_399;
			word32 t4_400;
			word32 s1_401;
			word32 a0_402;
			word32 a1_403;
			word32 a2_404;
			word32 a4_405;
			word32 a5_406;
			word32 a7_407;
			word32 s2_408;
			word32 s3_409;
			word32 s4_410;
			word32 s5_411;
			word32 s6_412;
			word32 s7_413;
			word32 s8_414;
			word32 s9_415;
			word32 s10_416;
			word32 s11_417;
			word32 t4_418;
			word32 a0_419;
			word32 a1_420;
			word32 a2_421;
			word32 a3_422;
			word32 a4_423;
			word32 a5_424;
			word32 a7_425;
			word32 s2_426;
			word32 s3_427;
			word32 s4_428;
			word32 s5_429;
			word32 s6_430;
			word32 s7_431;
			word32 s8_432;
			word32 s9_433;
			word32 s10_434;
			word32 s11_435;
			word32 t4_436;
			Eq_2 ra_219 = bl_main_apm_start(printf(printf(printf(ra_34, &g_t230B2F14, a3_88, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_383, out a0_384, out a1_385, out a2_386, out a3_117, out a4_387, out a5_388, out a7_389, out s2_390, out s3_391, out s4_392, out s5_393, out s6_394, out s7_395, out s8_396, out s9_397, out s10_398, out s11_399, out t4_400), &g_t230B2F38, a3_117, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_401, out a0_402, out a1_403, out a2_404, out a3_143, out a4_405, out a5_406, out a7_407, out s2_408, out s3_409, out s4_410, out s5_411, out s6_412, out s7_413, out s8_414, out s9_415, out s10_416, out s11_417, out t4_418), &g_t230B2F5C, a3_143, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_183, out a0_419, out a1_420, out a2_421, out a3_422, out a4_423, out a5_424, out a7_425, out s2_426, out s3_427, out s4_428, out s5_429, out s6_430, out s7_431, out s8_432, out s9_433, out s10_434, out s11_435, out t4_436), netifapi_netif_common(ra_34, netifapi_netif_common(ra_34, s0_35, a3_28, a4_29, a5_30, s2_39, mstatus_33, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_61, out a4_62, out a5_63, out s2_68), a3_61, a4_62, a5_63, s2_68, mstatus_33, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_88, out a4_380, out a5_381, out s2_382), s1_183, mstatus_33, s0, dwArg10, dwArg14, dwArg44, dwArg5C, s1, dwArg88, dwArgA8, dwArgC8, out s1_221, out a0_210, out a3_213, out a4_214, out mstatus_218);
			*(union Eq_2 *) 0x09 = s1_221;
			struct Eq_446 * a4_244;
			word32 s0_437;
			word32 a0_438;
			word32 a3_439;
			aos_post_event(dns_server_init(ra_219, s1_221, a0_210, a3_213, a4_214, mstatus_218, dwArg10, dwArg14, dwArg5C, dwArg0108, dwArg0148, out a4_244), 0x02, a4_244, dwArg04, out s0_437, out a0_438, out a3_439);
		}
	}
}

// 23024DF6: void stateGlobalGuard_scan_beacon(Register Eq_2 ra, Register (ptr32 Eq_110539) s0, Register word32 a0, Stack word32 dwArg0198)
void stateGlobalGuard_scan_beacon(Eq_2 ra, struct Eq_110539 * s0, word32 a0, word32 dwArg0198)
{
	if (a0 == (word32) s0->b0000)
	{
		int32 a4_37 = (word32) s0->b003B;
		if (*(int32 *) 0x43024700 < a4_37 || (a4_37 == 0x00 || (word32) s0->b000D == 0x00 && (g_dw42025708 & 0x01) == 0x00))
			goto l23024FA8;
		word32 a5_544;
		Eq_2 a0_45 = xTaskGetTickCount(out a5_544);
		struct Eq_110569 * s4_167 = &g_b42023F3C;
		word32 s8_291 = 0x00;
		int32 s7_293 = ~0x00;
		int32 s1_173 = ~0x00;
		int32 s9_161 = ~0x00;
		int32 s3_163;
		for (s3_163 = 0x00; s3_163 != 50; ++s3_163)
		{
			if (g_dw42025700 < (word32) s4_167->b02AA)
			{
				word32 a5_551;
				word32 a0_546;
				word32 t1_545;
				word32 a1_547;
				word32 a3_549;
				word32 a4_550;
				word32 a2_548;
				ra = memset(ra, (char *) s4_167 + 636, 0x00, 60, out t1_545, out a0_546, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551);
				s4_167->b02B0 = 0x00;
				goto l23024E8C;
			}
			if ((word32) s4_167->b02B0 != 0x00)
			{
				int32 a4_64 = s4_167->dw02B4;
				if (s8_291 == 0x00 || a4_64 - s7_293 < 0x00)
				{
					s7_293 = a4_64;
					s1_173 = s3_163;
				}
				s8_291 = 0x01;
				word32 a1_575;
				word32 a5_579;
				word32 a2_576;
				word32 a3_577;
				word32 a4_578;
				if (memcmp((char *) s4_167 + 676, &s0->b000D + 40, 0x06, out a1_575, out a2_576, out a3_577, out a4_578, out a5_579) == 0x00)
				{
					word32 a4_583;
					word32 a1_580;
					word32 a3_582;
					word32 a2_581;
					word32 a5_584;
					if (strcmp(&s0->b000D, (char *) s4_167 + 636, out a1_580, out a2_581, out a3_582, out a4_583, out a5_584) == 0x00)
					{
						struct Eq_110798 * s1_104 = s3_163 + 60;
						if ((int32) s0->b003C < (int32) s1_104->b420241E7)
						{
							word32 a5_585;
							if (xTaskGetTickCount(out a5_585) - s1_104->dw420241F0 <= 0x00FFFBB7)
								goto l23024FA8;
						}
						struct Eq_110820 * a0_124 = s3_163 + 60;
						a0_124->b420241E6 = (byte) (word32) s0->b003B;
						a0_124->b420241E7 = (byte) (int32) s0->b003C;
						a0_124->b420241E8 = (byte) (int32) s0->b003D;
						int32 a5_135 = (int32) s0->b003E;
						a0_124->t420241F0 = a0_45;
						a0_124->b420241E9 = (byte) a5_135;
						a0_124->b420241EA = (byte) (word32) s0->b003F;
						a0_124->b420241EB = (byte) (word32) s0->b0040;
						goto l23024FA8;
					}
				}
			}
			else
			{
l23024E8C:
				s9_161 = s3_163;
			}
			++s4_167;
		}
		if (s9_161 == ~0x00)
		{
			if (s1_173 == s9_161)
				goto l23024FA8;
		}
		else
			s1_173 = s9_161;
		struct Eq_110627 * s1_180 = s1_173 + 60;
		word32 a5_558;
		word32 a0_553;
		word32 t1_552;
		word32 a1_554;
		word32 a3_556;
		word32 a4_557;
		word32 a2_555;
		memset(ra, (char *) s1_180 + 1107444152, 0x00, 60, out t1_552, out a0_553, out a1_554, out a2_555, out a3_556, out a4_557, out a5_558);
		word32 a3_560;
		word32 a4_561;
		word32 a2_559;
		word32 a5_562;
		strncpy((char *) s1_180 + 1107444152, &s0->b000D, 32, out a2_559, out a3_560, out a4_561, out a5_562);
		s1_180->b420241D8 = 0x00;
		word32 a5_567;
		word32 a3_565;
		word32 a1_563;
		word32 a2_564;
		word32 a4_566;
		s1_180->t420241DC = strlen((char *) s1_180 + 1107444152, out a1_563, out a2_564, out a3_565, out a4_566, out a5_567);
		word32 a3_570;
		word32 a1_568;
		word32 a2_569;
		word32 a4_571;
		word32 a5_572;
		word32 a6_573;
		word32 a7_574;
		memcpy((char *) &s1_180->t420241DC + 4, &s0->b000D + 40, 0x06, out a1_568, out a2_569, out a3_570, out a4_571, out a5_572, out a6_573, out a7_574);
		s1_180->b420241E6 = (byte) (word32) s0->b003B;
		int32 a5_247 = (int32) s0->b003C;
		s1_180->t420241F0 = a0_45;
		s1_180->b420241E7 = (byte) a5_247;
		s1_180->b420241EA = (byte) (word32) s0->b003F;
		s1_180->b420241EB = (byte) (word32) s0->b0040;
		s1_180->b420241EC = 0x01;
	}
l23024FA8:
	0x00 = dwArg0198;
}

