pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23024FE2: void __reload_tsen(Register Eq_2 ra, Register (ptr32 Eq_108871) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void __reload_tsen(Eq_2 ra, struct Eq_108871 * a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	word32 a3_60;
	pvTimerGetTimerID(a0, a3, a4, mstatus, out a3_60);
	wifi_mgmr_api_fw_tsen_reload(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 23024FF2: void event_cb_wifi_event_mgmr(Register Eq_2 ra, Register (ptr32 Eq_110917) a0, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void event_cb_wifi_event_mgmr(Eq_2 ra, struct Eq_110917 * a0, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if ((word32) a0->w0006 != 0x14)
		return;
	aos_post_delayed_action(ra, 0x0055, 0x23025010, mstatus, dwArg20, dwArg24, dwArg0118, dwArg0158);
}

// 23025010: void trigger_auto_denoise(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void trigger_auto_denoise(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (g_dw4200F390 == 0x00)
		return;
	ptr32 mstatus_19;
	Eq_2 ra_20 = wifi_mgmr_api_denoise_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out mstatus_19);
	aos_post_delayed_action(ra_20, 0x0055, 0x23025010, mstatus_19, dwArg20, dwArg24, dwArg0118, dwArg0158);
}

// 2302503A: void stateDisconnect_exit(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_110985) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148)
void stateDisconnect_exit(Eq_2 ra, Eq_2 s1, struct Eq_110985 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0148)
{
	Eq_2 a3_21;
	word32 s1_207;
	word32 a0_208;
	word32 a1_209;
	word32 a2_210;
	word32 a4_211;
	word32 a5_212;
	word32 a7_213;
	word32 s2_214;
	word32 s3_215;
	word32 s4_216;
	word32 s5_217;
	word32 s6_218;
	word32 s7_219;
	word32 s8_220;
	word32 s9_221;
	word32 s10_222;
	word32 s11_223;
	word32 t4_224;
	Eq_2 ra_24 = printf(ra, &g_t230B32C4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_207, out a0_208, out a1_209, out a2_210, out a3_21, out a4_211, out a5_212, out a7_213, out s2_214, out s3_215, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220, out s9_221, out s10_222, out s11_223, out t4_224);
	if ((word32) a0->b004C == 0x00)
	{
		word32 s1_265;
		word32 a0_266;
		word32 a1_267;
		word32 a2_268;
		word32 a3_269;
		word32 a4_270;
		word32 a5_271;
		word32 a7_272;
		word32 s2_273;
		word32 s3_274;
		word32 s4_275;
		word32 s5_276;
		word32 s6_277;
		word32 s7_278;
		word32 s8_279;
		word32 s9_280;
		word32 s10_281;
		word32 s11_282;
		word32 t4_283;
		printf(ra_24, &g_t230B2E64, a3_21, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_265, out a0_266, out a1_267, out a2_268, out a3_269, out a4_270, out a5_271, out a7_272, out s2_273, out s3_274, out s4_275, out s5_276, out s6_277, out s7_278, out s8_279, out s9_280, out s10_281, out s11_282, out t4_283);
	}
	else
	{
		Eq_2 a5_70;
		word32 s1_225;
		word32 a0_226;
		word32 a1_227;
		word32 a2_228;
		word32 a3_229;
		word32 a4_230;
		word32 a7_231;
		word32 s2_232;
		word32 s3_233;
		word32 s4_234;
		word32 s5_235;
		word32 s6_236;
		word32 s7_237;
		word32 s8_238;
		word32 s9_239;
		word32 s10_240;
		word32 s11_241;
		word32 t4_242;
		printf(ra_24, &g_t230B2E54, a3_21, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_225, out a0_226, out a1_227, out a2_228, out a3_229, out a4_230, out a5_70, out a7_231, out s2_232, out s3_233, out s4_234, out s5_235, out s6_236, out s7_237, out s8_238, out s9_239, out s10_240, out s11_241, out t4_242);
		Eq_2 a5_100;
		Eq_2 s1_103;
		word32 a0_243;
		word32 a1_244;
		word32 a3_245;
		word32 a4_246;
		word32 s2_247;
		word32 s3_248;
		word32 s4_249;
		word32 s5_250;
		word32 s6_251;
		word32 s8_252;
		xTimerGenericCommand((char *) a0 + 32, 0x03, null, 0x00, a5_70, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_103, out a0_243, out a1_244, out a3_245, out a4_246, out a5_100, out s2_247, out s3_248, out s4_249, out s5_250, out s6_251, out s8_252);
		word32 s1_253;
		word32 a0_254;
		word32 a1_255;
		word32 a3_256;
		word32 a4_257;
		word32 a5_258;
		word32 s2_259;
		word32 s3_260;
		word32 s4_261;
		word32 s5_262;
		word32 s6_263;
		word32 s8_264;
		((word32) xTimerGenericCommand(s1_103, 0x05, null, 0x00, a5_100, mstatus, dwArg54, dwArgC8, dwArgD8, dwArg0108, dwArg0148, out s1_253, out a0_254, out a1_255, out a3_256, out a4_257, out a5_258, out s2_259, out s3_260, out s4_261, out s5_262, out s6_263, out s8_264) + 76)->u0 = 0x00;
	}
}

