pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230250A6: void disconnect_retry(Register Eq_2 ra, Register (ptr32 Eq_108871) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void disconnect_retry(Eq_2 ra, struct Eq_108871 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	word32 a0_18;
	Eq_2 a3_21;
	Eq_2 ra_26 = wifi_mgmr_profile_get(ra, &g_b42023F3C, pvTimerGetTimerID(a0, a3, a4, mstatus, out a3_12) + 77, a3_12, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, out a0_18, out a3_21);
	if (a0_18 == 0x00)
	{
		Eq_2 s4_61;
		word32 s1_182;
		word32 a0_183;
		word32 a1_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a7_189;
		word32 s2_190;
		word32 s3_191;
		word32 s5_192;
		word32 s6_193;
		word32 s7_194;
		word32 s8_195;
		word32 s9_196;
		word32 s10_197;
		word32 s11_198;
		word32 t4_199;
		Eq_2 ra_55 = printf(ra_26, &g_t230B2B08, a3_21, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_182, out a0_183, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a7_189, out s2_190, out s3_191, out s4_61, out s5_192, out s6_193, out s7_194, out s8_195, out s9_196, out s10_197, out s11_198, out t4_199);
		wifi_mgmr_api_reconnect(ra_55, s4_61, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
	}
	else
	{
		word32 s1_200;
		word32 a0_201;
		word32 a1_202;
		word32 a2_203;
		word32 a3_204;
		word32 a4_205;
		word32 a5_206;
		word32 a7_207;
		word32 s2_208;
		word32 s3_209;
		word32 s4_210;
		word32 s5_211;
		word32 s6_212;
		word32 s7_213;
		word32 s8_214;
		word32 s9_215;
		word32 s10_216;
		word32 s11_217;
		word32 t4_218;
		printf(ra_26, &g_t230B2AC0, a3_21, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_200, out a0_201, out a1_202, out a2_203, out a3_204, out a4_205, out a5_206, out a7_207, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214, out s9_215, out s10_216, out s11_217, out t4_218);
	}
}

// 230250E4: void stateGlobalGuard_fw_disconnect(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 byte) a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateGlobalGuard_fw_disconnect(Eq_2 ra, Eq_2 a3, byte * a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if ((word32) *a5 != 0x0F)
		return;
	Eq_2 a5_16;
	Eq_2 a3_20;
	Eq_2 a4_21;
	Eq_2 s3_28;
	word32 s1_140;
	word32 a0_141;
	word32 a1_142;
	word32 a2_143;
	word32 a7_144;
	word32 s2_145;
	word32 s4_146;
	word32 s5_147;
	word32 s6_148;
	word32 s7_149;
	word32 s8_150;
	word32 s9_151;
	word32 s10_152;
	word32 s11_153;
	word32 t4_154;
	bl_main_disconnect(printf(ra, &g_t230B3010, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_140, out a0_141, out a1_142, out a2_143, out a3_20, out a4_21, out a5_16, out a7_144, out s2_145, out s3_28, out s4_146, out s5_147, out s6_148, out s7_149, out s8_150, out s9_151, out s10_152, out s11_153, out t4_154), a3_20, a4_21, a5_16, s3_28, mstatus, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, dwArg6C, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148);
}

// 23025110: void stateConnectedIPYes_exit(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void stateConnectedIPYes_exit(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a5_15;
	Eq_2 a3_19;
	Eq_2 a4_20;
	Eq_2 s2_26;
	word32 a0_190;
	word32 s1_189;
	word32 a1_191;
	word32 a2_192;
	word32 a7_193;
	word32 s3_194;
	word32 s4_195;
	word32 s5_196;
	word32 s6_197;
	word32 s7_198;
	word32 s8_199;
	word32 s9_200;
	word32 s10_201;
	word32 s11_202;
	word32 t4_203;
	Eq_2 ra_22 = printf(ra, &g_t230B32C4, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_19, out a4_20, out a5_15, out a7_193, out s2_26, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
	Eq_2 a4_46;
	Eq_2 a5_47;
	Eq_2 s2_52;
	Eq_2 a4_73;
	Eq_2 s3_80;
	word32 a3_204;
	Eq_2 a3_72 = netifapi_netif_set_addr(ra_22, netifapi_netif_common(ra_22, 0x42024000, a3_19, a4_20, a5_15, s2_26, mstatus, dwArg68, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a3_204, out a4_46, out a5_47, out s2_52), fp + ~0x13, fp + ~0x13, fp + ~0x13, a4_46, a5_47, s2_52, mstatus, dwArg68, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out a4_73, out s3_80);
	Eq_2 a5_93 = *a4_73;
	if (a4_73 != 0x00)
	{
		*a5_93 = 0x00;
		word32 a4_205;
		bl_main_denoise(ra_22, a3_72, a4_73, a5_93, s3_80, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg10, dwArg14, dwArg20, dwArg24, dwArg38, dwArg48, dwArg5C, ra, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out a4_205);
	}
}

