pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230257D0: Register Eq_2 wifi_mgmr_event_notify(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_api_ip_update
//      wifi_mgmr_api_reconnect
//      wifi_mgmr_api_disable_autoreconnect
//      wifi_mgmr_api_enable_autoreconnect
//      wifi_mgmr_api_disconnect
//      wifi_mgmr_api_ifaceup
//      wifi_mgmr_api_sniffer_enable
//      wifi_mgmr_api_scan_item_beacon
//      wifi_mgmr_api_fw_disconnect
//      wifi_mgmr_api_fw_tsen_reload
//      wifi_mgmr_api_fw_scan
//      wifi_mgmr_api_fw_powersaving
//      wifi_mgmr_api_ap_start
//      wifi_mgmr_api_ap_stop
//      wifi_mgmr_api_idle
//      wifi_mgmr_api_raw_send
//      wifi_denoise_disable_cmd
//      wifi_denoise_enable_cmd
//      wifi_mgmr_sta_connect
//      wifi_mgmr_rate_config
//      wifi_mgmr_conf_max_sta
//      wifi_mgmr_cfg_req
//      cb_disconnect_ind
//      cb_connect_ind
//      netif_status_callback
Eq_2 wifi_mgmr_event_notify(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s0_13 = a0;
	struct Eq_113750 * s1_14 = &g_t42024000;
	Eq_2 s2_15 = 0x230B3000;
	while ((word32) s1_14->bFFFFFF3C == 0x00)
	{
		Eq_2 a5_25;
		Eq_2 a2_28;
		Eq_2 a3_29;
		Eq_2 a4_30;
		word32 s1_245;
		word32 a0_246;
		word32 a1_247;
		word32 a7_248;
		word32 s2_249;
		word32 s3_250;
		word32 s4_251;
		word32 s5_252;
		word32 s7_253;
		word32 s8_254;
		word32 s9_255;
		word32 s11_256;
		word32 t4_257;
		ra = printf(ra, (word32) s2_15 + 916, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_245, out a0_246, out a1_247, out a2_28, out a3_29, out a4_30, out a5_25, out a7_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6, out s7_253, out s8_254, out s9_255, out s10, out s11_256, out t4_257);
		word32 a0_258;
		word32 a1_259;
		word32 a2_260;
		word32 a5_261;
		word32 s3_262;
		s0_13 = vTaskDelay(0x14, a2_28, a3_29, a4_30, a5_25, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_14, out a0_258, out a1_259, out a2_260, out a3, out a4, out a5_261, out s2_15, out s3_262, out s4);
	}
	word32 a0_102;
	ptr32 mstatus_103;
	ptr32 s1_129;
	ptr32 a4_126;
	Eq_2 a3_125;
	ptr32 a1_123;
	ptr32 s5_105;
	ptr32 s4_134;
	ptr32 s2_132;
	ptr32 s3_133;
	Eq_2 ra_104 = xStreamBufferSend(ra, 0x42024D70, s0_13, (word32) *((word32) s0_13 + 0x0C) << 24 | ((word32) (*((word32) s0_13 + 11)) << 16 | ((word32) (*((word32) s0_13 + 0x0A)) << 8 | (word32) (*((word32) s0_13 + 9)))), ~0x00, a4, s2_15, s4, mstatus, dwArg08, dwArg94, dwArgB0, dwArgB4, dwArgD8, dwArg0108, dwArg0148, out s1_129, out a0_102, out a1_123, out a3_125, out a4_126, out s2_132, out s3_133, out s4_134, out s5_105, out mstatus_103);
	ptr32 a5_106 = 0x00;
	if (a0_102 == 0x00)
	{
		word32 a0_263;
		word32 a2_264;
		word32 a5_265;
		word32 a7_266;
		word32 s7_267;
		word32 s8_268;
		word32 s9_269;
		word32 s11_270;
		word32 t4_271;
		ra_104 = printf(ra_104, &g_t230B33B4, a3_125, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_129, out a0_263, out a1_123, out a2_264, out a3_125, out a4_126, out a5_265, out a7_266, out s2_132, out s3_133, out s4_134, out s5_105, out s6, out s7_267, out s8_268, out s9_269, out s10, out s11_270, out t4_271);
		a5_106 = ~0x00;
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_129;
	a1Out = a1_123;
	a2Out = dwArg10;
	a3Out = a3_125;
	a4Out = a4_126;
	a5Out = a5_106;
	s2Out = s2_132;
	s3Out = s3_133;
	s4Out = s4_134;
	s5Out = s5_105;
	s6Out = s6;
	s10Out = s10;
	mstatusOut = mstatus_103;
	return ra_104;
}

// 23025864: void wifi_mgmr_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_113940 fs1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48)
// Called from:
//      _wifi_mgmr_entry
void wifi_mgmr_start(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_113940 fs1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg48)
{
	stateM_init(&g_t42025654, &g_b230B323C, &g_t230B2E7C);
	struct Eq_446 * a4_43;
	int32 s2_47;
	int32 s3_48;
	word32 a3_420;
	word32 a5_421;
	aos_register_event_filter(ra, 0x23024FF2, 0x00, a3, a4, wifi_mgmr_event_init(), mstatus, dwLocF0, dwLocEC, dwLocE8, dwLocA4, dwArg08, dwArg48, out a3_420, out a4_43, out a5_421, out s2_47, out s3_48);
	Eq_2 a3_71;
	int32 a7_91;
	word32 t4_443;
	word32 s8_439;
	word32 s4_435;
	word32 a4_431;
	word32 a1_428;
	word32 s1_426;
	word32 a3_424;
	word32 s0_422;
	word32 s9_440;
	word32 s11_442;
	word32 s10_441;
	word32 s5_436;
	word32 s7_438;
	word32 s6_437;
	word32 a5_432;
	word32 s3_434;
	word32 s2_433;
	word32 a3_430;
	word32 a2_429;
	word32 a0_427;
	word32 s1_425;
	word32 a0_423;
	Eq_2 ra_177 = printf(hal_sys_capcode_update(aos_post_event(ra, 0x02, a4_43, dwLocFC, out s0_422, out a0_423, out a3_424), 0x00FF, 0x00FF, s2_47, s3_48, dwLoc0120, dwLoc011C, dwLocF8, dwLocD8, out s1_425, out a3_71), &g_t230B33DC, a3_71, 0x01, dwLocF8, dwLocB0, dwLocAC, dwLoc88, dwLoc64, out s1_426, out a0_427, out a1_428, out a2_429, out a3_430, out a4_431, out a5_432, out a7_91, out s2_433, out s3_434, out s4_435, out s5_436, out s6_437, out s7_438, out s8_439, out s9_440, out s10_441, out s11_442, out t4_443);
	Eq_2 s1_123;
	word32 a3_444;
	xTimerCreateStatic((struct Eq_109033 *) 0x02000710, 0x4200D43C, 0x23024FE2, &g_t4200D45C, a7_91, mstatus, 0x01, dwLoc38, dwArg08, out s1_123, out a3_444);
	Eq_2 a5_135;
	xTaskGetTickCount(out a5_135);
	Eq_2 dwLoc0118_334 = 0x01;
	word32 s8_453;
	word32 s2_449;
	word32 s1_445;
	word32 s3_450;
	word32 s6_452;
	word32 s5_451;
	word32 a0_446;
	word32 a3_448;
	word32 a1_447;
	Eq_2 s4_152;
	Eq_2 a4_157;
	Eq_2 a5_146;
	Eq_2 s0_148 = xTimerGenericCommand(s1_123, 0x01, null, ~0x00, a5_135, mstatus, dwLocBC, dwLoc48, dwLoc38, s0, dwArg38, out s1_445, out a0_446, out a1_447, out a3_448, out a4_157, out a5_146, out s2_449, out s3_450, out s4_152, out s5_451, out s6_452, out s8_453);
	do
	{
l23025936:
		while (true)
		{
			word32 s5_170 = 0x42025000;
			do
			{
				word32 a0_184;
				word32 a2_186;
				struct Eq_114110 * s1_193;
				Eq_2 s2_194;
				Eq_2 s3_195;
				word32 a1_454;
				word32 s8_455;
				ra_177 = xStreamBufferReceive(ra_177, s0_148, s5_170 + -656, s4_152, 224, ~0x00, a4_157, a5_146, mstatus, dwLoc0118_334, dwLocF8, dwLoc6C, dwLoc50, dwLoc4C, dwLoc28, dwArg08, dwArg48, out s0_148, out s1_193, out a0_184, out a1_454, out a2_186, out a4_157, out a5_146, out s2_194, out s3_195, out s4_152, out s5_170, out s8_455, out mstatus);
			} while (a0_184 == 0x00);
			up32 a4_208 = (word32) bLoc0107;
			if (a4_208 == 0x0D)
				break;
			Eq_2 a5_210 = 0x01;
			if (a4_208 > 0x0D)
				a5_210 = (word32) (a4_208 > 22) << 1;
			dwLoc0118_334 = a5_210;
			ra_177 = stateM_handleEvent(ra_177, s1_193, (word32) s0_148 + 0x0654, fp + -272, a2_186, a5_210, out s0_148, out a4_157, out a5_146, out s4_152);
		}
		a5_146 = s1_193->t0718;
		if (a5_146 == s2_194 || (a5_146 == s3_195 || (a5_146 == 0x230B2C50 || a5_146 == 0x230B3274)))
			break;
		a4_157.u0 = 0x230B2B6C;
	} while (a5_146 != 0x230B2B6C);
	word32 * a1_264;
	word32 * a3_266;
	struct Eq_7063 * s0_279;
	ra_177 = bl_tsen_adc_get(ra_177, s0_148, fp + -0x0112, 0x00, fs1, fflags, frm, dwLoc0100, dwLocFC, dwLocD8, dwLocB4, out s0_279, out a1_264, out a3_266, out fs1, out fflags, out frm);
	s0_148 = phy_tcal_callback(s0_279, 0, a1_264, a3_266, mstatus, out a4_157, out a5_146, out s4_152);
	goto l23025936;
}

// 230259BA: void _wifi_mgmr_entry(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_113940 fs1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38)
void _wifi_mgmr_entry(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_113940 fs1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38)
{
	wifi_mgmr_start(ra, s0, a3, a4, fs1, fflags, frm, mstatus, dwLoc08, dwArg28, dwArg38);
}

// 230259C2: void wifi_mgmr_start_background(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      event_cb_wifi_event
//      _wifi_mgmr_entry
void wifi_mgmr_start_background(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	ptr32 mstatus_18;
	Eq_2 s1_20;
	Eq_2 s3_24;
	word32 s1_107;
	word32 a0_108;
	word32 a2_109;
	word32 a3_110;
	word32 a4_111;
	word32 a5_112;
	word32 s2_113;
	word32 s3_114;
	xTaskCreate(wifi_mgmr_drv_init(ra, s0, a0, a3, mstatus, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg0C, dwArg10, dwArg14, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg5C, dwArg60, dwArg64, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_20, out s3_24, out mstatus_18), s1_20, 0x0300, 0x00, 0x1C, fp + ~0x13, s3_24, mstatus_18, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_107, out a0_108, out a2_109, out a3_110, out a4_111, out a5_112, out s2_113, out s3_114);
}

// 230259F0: Register Eq_2 wifi_mgmr_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 wifi_mgmr_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg0118, ptr32 & s4Out)
{
	struct Eq_114383 * s0_20;
	ptr32 s4_24;
	word32 a0_52;
	Eq_2 ra_32 = xStreamBufferGenericCreateStatic(ra, 0x00FFF8C0, 0x00, 0x01, 0x42024D94, 0x42024D70, mstatus, dwArg0118, out s0_20, out a0_52, out s4_24);
	g_b42023F3C = 0x01;
	s0_20->dw4202470C = 0x03FFFA98;
	s4Out = s4_24;
	return ra_32;
}

// 23025A3A: void wifi_mgmr_status_code_clean_internal()
// Called from:
//      wifiprov_connect_ap_ind
void wifi_mgmr_status_code_clean_internal()
{
	g_w4202568C = 0x00;
}

