pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23025A4A: Register word32 wifi_mgmr_state_get_internal(Register (ptr32 word32) a0, Register out Eq_112287 a4Out, Register out (ptr32 (ptr32 word32)) a5Out)
// Called from:
//      wifi_mgmr_state_get
word32 wifi_mgmr_state_get_internal(word32 * a0, union Eq_112287 & a4Out, word32 & a5Out)
{
	word32 ** a5_23;
	word32 ** a5_29;
	Eq_112287 a4_8 = *(union Eq_112287 *) 1124222548;
	word32 a3_11 = (word32) *(uint16 *) 1124222604;
	if (a4_8 != 0x230B3170)
	{
		if (a4_8 == 587934884)
		{
			if (g_dw42023F44 == 0x00)
			{
				a5_29 = (word32 **) 0x02;
				goto l23025A78;
			}
			a5_23 = (word32 **) 0x12;
		}
		else if (a4_8 == 0x230B2B6C)
		{
			if (g_dw42023F44 != 0x00)
				a5_23 = (word32 **) 0x13;
			else
				a5_23 = (word32 **) 0x03;
		}
		else if (a4_8 == 0x230B2C50)
		{
			if (g_dw42023F44 != 0x00)
				a5_23 = (word32 **) 0x14;
			else
				a5_23 = (word32 **) 0x04;
		}
		else if (a4_8 == 0x230B2CC0)
		{
			if (g_dw42023F44 == 0x00)
			{
				a5_29 = (word32 **) 0x05;
				goto l23025A78;
			}
			a5_23 = (word32 **) 0x15;
		}
		else if (a4_8 == 0x230B323C)
			a5_23 = (word32 **) 0x06;
		else
		{
			a5_23 = &g_ptr230B3274;
			if (a4_8 != 0x230B3274)
			{
				*a0 = 0x00;
				goto l23025A72;
			}
			a5_23 = (word32 **) 0x07;
		}
l23025A70:
		*a5_23 = a0;
		goto l23025A72;
	}
	else
	{
		if (g_dw42023F44 != 0x00)
		{
			a5_23 = (word32 **) 0x11;
			goto l23025A70;
		}
		a5_29 = (word32 **) 0x01;
l23025A78:
		*a5_29 = a0;
		if (a3_11 == 0x08)
		{
			a5_23 = (word32 **) 0x08;
			goto l23025A70;
		}
		a5_23 = (word32 **) 0x0C;
		if (a3_11 == 0x0C)
		{
			a5_23 = (word32 **) 0x09;
			goto l23025A70;
		}
l23025A72:
		a4Out = a4_8;
		a5Out = a5_23;
		return a3_11;
	}
}

// 23025B14: Register (ptr32 byte) wifi_mgmr_set_connect_stat_info(Register (ptr32 Eq_114497) a0, Register word32 a1, Register out ptr32 a4Out)
// Called from:
//      cb_connect_ind
byte * wifi_mgmr_set_connect_stat_info(struct Eq_114497 * a0, word32 a1, ptr32 & a4Out)
{
	g_w4202568C = (word16) (word32) a0->w0000;
	byte * a3_11 = &a0->w0000 + 1;
	struct Eq_114510 * a4_12 = &g_t420256F0;
	do
	{
		++a4_12;
		a4_12[0x0FFF] = (struct Eq_114510) (byte) (word32) *a3_11;
		++a3_11;
	} while (a3_11 != &a0->w0000 + 4);
	g_w420256F6 = (word16) (word32) a0->w0014;
	ptr32 a4_27 = (word32) a0->b0012;
	g_b4202568E = (byte) a1;
	g_b420256F8 = (byte) a4_27;
	a4Out = a4_27;
	return a3_11;
}

// 23025B62: Register Eq_2 wifi_mgmr_set_country_code_internal(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_api_set_country_code
Eq_2 wifi_mgmr_set_country_code_internal(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & mstatusOut)
{
	Eq_2 a1_12;
	ptr32 mstatus_19;
	Eq_2 ra_20 = bl_main_set_country_code(ra, a0, mstatus, dwLoc20, dwLoc1C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg38, dwArg40, dwArg44, dwArg4C, dwArg5C, dwArg68, dwArg8C, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out a1_12, out mstatus_19);
	word32 a2_90;
	word32 a3_91;
	word32 a4_92;
	word32 a5_93;
	strncpy(1107449594, a1_12, 0x03, out a2_90, out a3_91, out a4_92, out a5_93);
	g_b420256FC = 0x00;
	g_dw42025700 = bl_main_get_channel_nums();
	mstatusOut = mstatus_19;
	return ra_20;
}

// 23025B9C: void wifi_mgmr_ap_sta_cnt_get_internal(Register (ptr32 byte) a0)
// Called from:
//      wifi_mgmr_ap_sta_cnt_get
void wifi_mgmr_ap_sta_cnt_get_internal(byte * a0)
{
	bl_main_apm_sta_cnt_get(a0);
}

// 23025BAC: Register Eq_2 wifi_mgmr_ap_sta_info_get_internal(Register Eq_2 ra, Register (ptr32 Eq_114604) a0, Register Eq_2 a1, Register out ptr32 s0Out, Register out Eq_2 s1Out)
// Called from:
//      wifi_mgmr_ap_sta_info_get
Eq_2 wifi_mgmr_ap_sta_info_get_internal(Eq_2 ra, struct Eq_114604 * a0, Eq_2 a1, ptr32 & s0Out, union Eq_2 & s1Out)
{
	word32 t1_84;
	word32 a0_85;
	word32 a1_86;
	word32 a2_87;
	word32 a3_88;
	word32 a4_89;
	word32 a5_90;
	Eq_2 ra_23 = memset(ra, fp + -40, 0x00, 0x18, out t1_84, out a0_85, out a1_86, out a2_87, out a3_88, out a4_89, out a5_90);
	bl_main_apm_sta_info_get(fp + -40, a1);
	struct Eq_114635 * a5_42 = (word32) wLoc28;
	a0->w0000 = (word16) a5_42;
	a5_42->ptr0010 = a0;
	a5_42->ptr000C = a0;
	a5_42->ptr0008 = a0;
	a0->b0014 = (byte) (word32) bLoc14;
	word32 a1_91;
	word32 a2_92;
	word32 a3_93;
	word32 a4_94;
	word32 a5_95;
	word32 a6_96;
	word32 a7_97;
	memcpy(&a0->w0000 + 1, fp + -38, 0x06, out a1_91, out a2_92, out a3_93, out a4_94, out a5_95, out a6_96, out a7_97);
	s0Out = dwArgE4;
	s1Out = a1;
	return ra_23;
}

// 23025C00: void wifi_mgmr_ap_sta_delete_internal(Register Eq_2 ra, Register (ptr32 Eq_98932) s0, Register Eq_2 s1, Register (ptr32 Eq_98932) a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      wifi_mgmr_ap_sta_delete
void wifi_mgmr_ap_sta_delete_internal(Eq_2 ra, struct Eq_98932 * s0, Eq_2 s1, struct Eq_98932 * a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg3C, Eq_2 dwArg6C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	word32 s0_55;
	word32 s1_56;
	word32 s2_57;
	word32 s3_58;
	word32 s4_59;
	word32 mstatus_60;
	bl_main_apm_sta_delete(ra, s0, s1, a0, s4, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwArg20, dwArg24, dwArg3C, dwArg6C, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_55, out s1_56, out s2_57, out s3_58, out s4_59, out mstatus_60);
}

