pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23025C10: Register Eq_2 wifi_mgmr_scan_complete_notify(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Register out ptr32 a4Out)
// Called from:
//      cb_event_ind
Eq_2 wifi_mgmr_scan_complete_notify(Eq_2 ra, Eq_2 a3, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, ptr32 & a4Out)
{
	ptr32 a4_11;
	Eq_2 ra_14 = wifi_mgmr_scan_complete_callback(ra, a3, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out a4_11);
	a4Out = a4_11;
	return ra_14;
}

// 23025C20: Register Eq_2 wifi_mgmr_api_connect(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Register out ptr32 s0Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_connect
Eq_2 wifi_mgmr_api_connect(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, ptr32 & s0Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	word32 t1_513;
	word32 a1_515;
	word32 a3_517;
	word32 a0_514;
	word32 a2_516;
	word32 a4_518;
	word32 a5_519;
	Eq_2 ra_197 = memset(ra, fp + -232, 0x00, 0x00C6, out t1_513, out a0_514, out a1_515, out a2_516, out a3_517, out a4_518, out a5_519);
	word32 a1_520;
	word32 a2_521;
	word32 a3_522;
	word32 a4_523;
	word32 a5_524;
	Eq_2 a0_66 = strlen(a0, out a1_520, out a2_521, out a3_522, out a4_523, out a5_524);
	word32 a1_525;
	word32 a2_526;
	word32 a7_529;
	word32 a6_528;
	word32 a5_527;
	Eq_2 a4_104;
	Eq_2 a3_109;
	memcpy(fp + -0x00DB, a0, a0_66, out a1_525, out a2_526, out a3_109, out a4_104, out a5_527, out a6_528, out a7_529);
	Eq_2 s3_241 = a3;
	Eq_2 s4_203 = a4;
	Eq_2 dwLocB8_359 = SEQ(wLocB6, (word16) (a0_66 >> 0x10));
	Eq_2 dwLocDC_388 = SEQ(nLocDB, 0x00);
	if (a1 != 0x00)
	{
		word32 a2_571;
		word32 a5_572;
		word32 a1_570;
		Eq_2 a0_93 = strlen(a1, out a1_570, out a2_571, out a3_109, out a4_104, out a5_572);
		if (a0_93 > 64)
			goto l23025D26;
		if (a0_93 != 0x00)
		{
			word32 a7_577;
			word32 a2_574;
			word32 a5_575;
			word32 a6_576;
			word32 a1_573;
			memcpy(fp + -0x00B6, a1, a0_93, out a1_573, out a2_574, out a3_109, out a4_104, out a5_575, out a6_576, out a7_577);
		}
	}
	Eq_2 dwLoc90_294;
	if (a2 == 0x00)
	{
		dwLoc90_294.u0 = 0x00;
		goto l23025CD0;
	}
	word32 a1_562;
	word32 a2_563;
	word32 a5_564;
	Eq_2 a0_122 = strlen(a2, out a1_562, out a2_563, out a3_109, out a4_104, out a5_564);
	dwLoc90_294 = a0_122;
	if (a0_122 == 0x00)
	{
l23025CD0:
		if (a3 != 0x00)
		{
			word32 a6_533;
			word32 a7_534;
			word32 a5_532;
			word32 a2_531;
			word32 a1_530;
			memcpy(fp + -44, a3, 0x06, out a1_530, out a2_531, out a3_109, out a4_104, out a5_532, out a6_533, out a7_534);
		}
		if (a5 != 0x00)
		{
			word32 t4_550;
			word32 s8_546;
			word32 s9_547;
			word32 s10_548;
			word32 s11_549;
			word32 s7_545;
			word32 s2_541;
			word32 s3_542;
			word32 s5_543;
			word32 s6_544;
			word32 a1_537;
			word32 a2_538;
			word32 a5_539;
			word32 a7_540;
			word32 s1_535;
			word32 a0_536;
			ra_197 = printf(ra_197, &g_t230B3414, a3_109, 0x22334401, dwLocC8, s2, s0, dwLoc58, dwLoc34, out s1_535, out a0_536, out a1_537, out a2_538, out a3_109, out a4_104, out a5_539, out a7_540, out s2_541, out s3_542, out s4_203, out s5_543, out s6_544, out s7_545, out s8_546, out s9_547, out s10_548, out s11_549, out t4_550);
		}
		word32 s4_558;
		word32 s5_559;
		word32 s6_560;
		word32 s10_561;
		word32 a3_554;
		word32 a4_555;
		word32 a5_556;
		word32 s2_557;
		word32 s1_551;
		word32 a1_552;
		word32 a2_553;
		ra_197 = wifi_mgmr_event_notify(ra_197, fp + -232, a3_109, a4_104, s4_203, mstatus, 0x22334401, dwLocDC_388, dwLocD8, dwLocB8_359, dwLoc90_294, dwLoc8C, dwLoc68, dwLoc5C, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg18, dwArg38, dwArg58, dwArg78, out s1_551, out a1_552, out a2_553, out a3_554, out a4_555, out a5_556, out s2_557, out s3_241, out s4_558, out s5_559, out s6_560, out s10_561, out mstatus);
l23025D28:
		s0Out = a5;
		s3Out = s3_241;
		mstatusOut = mstatus;
		return ra_197;
	}
	if (a0_122 == 64)
	{
		word32 a6_568;
		word32 a7_569;
		word32 a1_565;
		word32 a2_566;
		word32 a5_567;
		memcpy(fp + -117, a2, 64, out a1_565, out a2_566, out a3_109, out a4_104, out a5_567, out a6_568, out a7_569);
		goto l23025CD0;
	}
l23025D26:
	goto l23025D28;
}

// 23025D6A: void wifi_mgmr_api_cfg_req(Register Eq_2 ra, Register Eq_2 s1, Register uint32 a0, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
// Called from:
//      wifi_mgmr_cfg_req
void wifi_mgmr_api_cfg_req(Eq_2 ra, Eq_2 s1, uint32 a0, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	if (a4 > 32)
		return;
	Eq_2 a4_108 = (word32) a4 + 0x00C6 >> 24;
	word32 t1_292;
	word32 a0_293;
	word32 a1_294;
	word32 a2_295;
	word32 a4_296;
	word32 a5_297;
	Eq_2 a3_113;
	Eq_2 ra_41 = memset(ra, fp + -100, 0x00, 65, out t1_292, out a0_293, out a1_294, out a2_295, out a3_113, out a4_296, out a5_297);
	Eq_2 dwLoc58_228 = SEQ((byte) (a0 >> 0x10), (byte) (a0 >> 0x08), (byte) a0, (byte) a4_108);
	Eq_2 dwLoc5C_231 = SEQ((byte) ((word32) a4 + 0x00C6 >> 0x10), (byte) ((word32) a4 + 0x00C6 >> 0x08), (byte) ((word32) a4 + 0x00C6), 0x55);
	if (a4 != 0x00)
	{
		word32 a1_298;
		word32 a2_299;
		word32 a5_300;
		word32 a6_301;
		word32 a7_302;
		memcpy(fp + -67, a5, a4, out a1_298, out a2_299, out a3_113, out a4_108, out a5_300, out a6_301, out a7_302);
	}
	word32 s1_303;
	word32 a1_304;
	word32 a2_305;
	word32 a3_306;
	word32 a4_307;
	word32 a5_308;
	word32 s2_309;
	word32 s3_310;
	word32 s4_311;
	word32 s5_312;
	word32 s6_313;
	word32 s10_314;
	word32 mstatus_315;
	wifi_mgmr_event_notify(ra_41, fp + -100, a3_113, a4_108, a0 >> 0x18, mstatus, dwLoc68, dwLoc5C_231, dwLoc58_228, dwLoc38, dwLoc10, dwLoc0C, dwArg18, dwArg24, s3, s1, ra, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgF8, out s1_303, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out s2_309, out s3_310, out s4_311, out s5_312, out s6_313, out s10_314, out mstatus_315);
}

// 23025EB2: void wifi_mgmr_api_ip_got(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      netif_status_callback
void wifi_mgmr_api_ip_got(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	uint32 a3_28;
	uint32 a4_29;
	word32 t1_190;
	word32 a0_191;
	word32 a1_192;
	word32 a2_193;
	word32 a5_194;
	word32 s1_195;
	word32 a1_196;
	word32 a2_197;
	word32 a3_198;
	word32 a4_199;
	word32 a5_200;
	word32 s2_201;
	word32 s3_202;
	word32 s4_203;
	word32 s5_204;
	word32 s6_205;
	word32 s10_206;
	word32 mstatus_207;
	wifi_mgmr_event_notify(memset(ra, fp + -52, 0x00, 33, out t1_190, out a0_191, out a1_192, out a2_193, out a3_28, out a4_29, out a5_194), fp + -52, a3_28 >> 24, a4_29 >> 24, s4, mstatus, dwLoc48, dwLoc3C, dwLoc38, SEQ((byte) (a4_29 >> 0x10), (byte) (a4_29 >> 0x08), (byte) a4_29, (byte) (a3_28 >> 24)), dwArg10, dwArg14, dwArg38, dwArg44, dwArg5C, dwArg60, dwArg64, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s1_195, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200, out s2_201, out s3_202, out s4_203, out s5_204, out s6_205, out s10_206, out mstatus_207);
}

// 23025FC6: Register Eq_2 wifi_mgmr_api_ip_update(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_ip_set
//      netif_status_callback
Eq_2 wifi_mgmr_api_ip_update(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a1Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a1_45;
	ptr32 a3_47;
	ptr32 mstatus_52;
	word32 t1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a5_113;
	word32 s1_114;
	word32 a2_115;
	word32 a4_116;
	word32 a5_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s5_121;
	word32 s6_122;
	word32 s10_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_109, out a0_110, out a1_111, out a2_112, out a3_12, out a4_13, out a5_113), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_114, out a1_45, out a2_115, out a3_47, out a4_116, out a5_117, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s10_123, out mstatus_52);
	a1Out = a1_45;
	a3Out = a3_47;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026038: void wifi_mgmr_api_reconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      disconnect_retry
void wifi_mgmr_api_reconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s5_120;
	word32 s6_121;
	word32 s10_122;
	word32 mstatus_123;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a2_113, out a3_114, out a4_115, out a5_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s10_122, out mstatus_123);
}

// 230260AA: Register Eq_2 wifi_mgmr_api_disable_autoreconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_autoconnect_disable
Eq_2 wifi_mgmr_api_disable_autoreconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_52;
	ptr32 s1_54;
	ptr32 s2_57;
	ptr32 s3_58;
	ptr32 s4_59;
	ptr32 s5_60;
	ptr32 s6_61;
	word32 t1_113;
	word32 a0_114;
	word32 a1_115;
	word32 a2_116;
	word32 a5_117;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	word32 a5_122;
	word32 s10_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_113, out a0_114, out a1_115, out a2_116, out a3_12, out a4_13, out a5_117), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_54, out a1_118, out a2_119, out a3_120, out a4_121, out a5_122, out s2_57, out s3_58, out s4_59, out s5_60, out s6_61, out s10_123, out mstatus_52);
	s1Out = s1_54;
	s2Out = s2_57;
	s3Out = s3_58;
	s4Out = s4_59;
	s5Out = s5_60;
	s6Out = s6_61;
	mstatusOut = mstatus_52;
	return ra_53;
}

