pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302611C: Register Eq_2 wifi_mgmr_api_enable_autoreconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_autoconnect_enable
Eq_2 wifi_mgmr_api_enable_autoreconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_52;
	ptr32 s1_54;
	ptr32 s2_57;
	ptr32 s3_58;
	ptr32 s4_59;
	ptr32 s5_60;
	ptr32 s6_61;
	word32 t1_113;
	word32 a0_114;
	word32 a1_115;
	word32 a2_116;
	word32 a5_117;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	word32 a5_122;
	word32 s10_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_113, out a0_114, out a1_115, out a2_116, out a3_12, out a4_13, out a5_117), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_54, out a1_118, out a2_119, out a3_120, out a4_121, out a5_122, out s2_57, out s3_58, out s4_59, out s5_60, out s6_61, out s10_123, out mstatus_52);
	s1Out = s1_54;
	s2Out = s2_57;
	s3Out = s3_58;
	s4Out = s4_59;
	s5Out = s5_60;
	s6Out = s6_61;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 2302618E: Register Eq_2 wifi_mgmr_api_disconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_disconnect
Eq_2 wifi_mgmr_api_disconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a3_47;
	ptr32 a4_48;
	ptr32 a5_49;
	ptr32 mstatus_52;
	word32 t1_110;
	word32 a0_111;
	word32 a1_112;
	word32 a2_113;
	word32 a5_114;
	word32 s1_115;
	word32 a1_116;
	word32 a2_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s5_121;
	word32 s6_122;
	word32 s10_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_110, out a0_111, out a1_112, out a2_113, out a3_12, out a4_13, out a5_114), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_115, out a1_116, out a2_117, out a3_47, out a4_48, out a5_49, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s10_123, out mstatus_52);
	a3Out = a3_47;
	a4Out = a4_48;
	a5Out = a5_49;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026200: void wifi_mgmr_api_rate_config(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_rate_config
void wifi_mgmr_api_rate_config(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	word32 t1_110;
	word32 a0_111;
	word32 a1_112;
	word32 a2_113;
	word32 a5_114;
	word32 s1_115;
	word32 a1_116;
	word32 a2_117;
	word32 a3_118;
	word32 a4_119;
	word32 a5_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s10_126;
	word32 mstatus_127;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_110, out a0_111, out a1_112, out a2_113, out a3_16, out a4_17, out a5_114), fp + ~0x1F, a3_16, a4_17, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_115, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s10_126, out mstatus_127);
}

// 2302626C: void wifi_mgmr_api_conf_max_sta(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_conf_max_sta
void wifi_mgmr_api_conf_max_sta(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	word32 t1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a5_113;
	word32 s1_114;
	word32 a1_115;
	word32 a2_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 s2_120;
	word32 s3_121;
	word32 s4_122;
	word32 s5_123;
	word32 s6_124;
	word32 s10_125;
	word32 mstatus_126;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_109, out a0_110, out a1_111, out a2_112, out a3_16, out a4_17, out a5_113), fp + ~0x1F, a3_16, a4_17, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_114, out a1_115, out a2_116, out a3_117, out a4_118, out a5_119, out s2_120, out s3_121, out s4_122, out s5_123, out s6_124, out s10_125, out mstatus_126);
}

