pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230262D6: Register Eq_2 wifi_mgmr_api_ifaceup(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 wifi_mgmr_api_ifaceup(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_52;
	ptr32 s1_54;
	ptr32 s3_58;
	word32 t1_109;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a5_113;
	word32 a1_114;
	word32 a2_115;
	word32 a3_116;
	word32 a4_117;
	word32 a5_118;
	word32 s2_119;
	word32 s4_120;
	word32 s5_121;
	word32 s6_122;
	word32 s10_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_109, out a0_110, out a1_111, out a2_112, out a3_12, out a4_13, out a5_113), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_54, out a1_114, out a2_115, out a3_116, out a4_117, out a5_118, out s2_119, out s3_58, out s4_120, out s5_121, out s6_122, out s10_123, out mstatus_52);
	s1Out = s1_54;
	s3Out = s3_58;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026348: void wifi_mgmr_api_sniffer_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sniffer_enable
void wifi_mgmr_api_sniffer_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s5_120;
	word32 s6_121;
	word32 s10_122;
	word32 mstatus_123;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a2_113, out a3_114, out a4_115, out a5_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s10_122, out mstatus_123);
}

// 230263BA: void wifi_mgmr_api_scan_item_beacon(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8)
// Called from:
//      cb_beacon_ind
void wifi_mgmr_api_scan_item_beacon(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8)
{
	Eq_2 a4_37;
	word32 t1_209;
	word32 a0_210;
	word32 a1_211;
	word32 a2_212;
	word32 a3_213;
	word32 a5_214;
	Eq_2 ra_39 = memset(ra, fp + -0x006C, 0x00, 73, out t1_209, out a0_210, out a1_211, out a2_212, out a3_213, out a4_37, out a5_214);
	Eq_2 a3_74;
	word32 a1_215;
	word32 a2_216;
	word32 a4_217;
	word32 a5_218;
	word32 a6_219;
	word32 a7_220;
	memcpy(fp + -95, a4_37, dwArg44, out a1_215, out a2_216, out a3_74, out a4_217, out a5_218, out a6_219, out a7_220);
	Eq_2 a4_94;
	Eq_2 a3_99;
	word32 a1_221;
	word32 a2_222;
	word32 a5_223;
	word32 a6_224;
	word32 a7_225;
	memcpy(fp + -55, a3_74, 0x06, out a1_221, out a2_222, out a3_99, out a4_94, out a5_223, out a6_224, out a7_225);
	0x00 = dwLoc58;
	word32 s1_226;
	word32 a1_227;
	word32 a2_228;
	word32 a3_229;
	word32 a4_230;
	word32 a5_231;
	word32 s2_232;
	word32 s3_233;
	word32 s4_234;
	word32 s5_235;
	word32 s6_236;
	word32 s10_237;
	word32 mstatus_238;
	wifi_mgmr_event_notify(ra_39, fp + -0x006C, a3_99, a4_94, s4, mstatus, dwLoc78, 0x22334418, 0x66778811, s2, dwLoc20, dwLoc1C, dwArg08, dwArg14, dwArg2C, dwArg30, s3, dwArg58, dwArg88, dwArgA8, dwArgC8, dwArgE8, out s1_226, out a1_227, out a2_228, out a3_229, out a4_230, out a5_231, out s2_232, out s3_233, out s4_234, out s5_235, out s6_236, out s10_237, out mstatus_238);
}

// 230264AA: void wifi_mgmr_api_fw_disconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      ip_obtaining_timeout
void wifi_mgmr_api_fw_disconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a2_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s5_120;
	word32 s6_121;
	word32 s10_122;
	word32 mstatus_123;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_106, out a0_107, out a1_108, out a2_109, out a3_12, out a4_13, out a5_110), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a2_113, out a3_114, out a4_115, out a5_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s10_122, out mstatus_123);
}

// 2302651C: void wifi_mgmr_api_fw_tsen_reload(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      __reload_tsen
void wifi_mgmr_api_fw_tsen_reload(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	word32 t1_105;
	word32 a0_106;
	word32 a1_107;
	word32 a2_108;
	word32 a4_109;
	word32 a5_110;
	word32 s1_111;
	word32 a1_112;
	word32 a2_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s5_120;
	word32 s6_121;
	word32 s10_122;
	word32 mstatus_123;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_105, out a0_106, out a1_107, out a2_108, out a3_12, out a4_109, out a5_110), fp + ~0x1F, a3_12, 0x0055, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_111, out a1_112, out a2_113, out a3_114, out a4_115, out a5_116, out s2_117, out s3_118, out s4_119, out s5_120, out s6_121, out s10_122, out mstatus_123);
}

// 2302658C: Register Eq_2 wifi_mgmr_api_fw_scan(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_scan
//      wifi_mgmr_all_ap_scan
Eq_2 wifi_mgmr_api_fw_scan(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a2_46;
	ptr32 a3_47;
	ptr32 a4_48;
	ptr32 a5_49;
	ptr32 mstatus_52;
	ptr32 s10_55;
	word32 t1_112;
	word32 a0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a5_116;
	word32 s1_117;
	word32 a1_118;
	word32 s2_119;
	word32 s3_120;
	word32 s4_121;
	word32 s5_122;
	word32 s6_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_112, out a0_113, out a1_114, out a2_115, out a3_12, out a4_13, out a5_116), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_117, out a1_118, out a2_46, out a3_47, out a4_48, out a5_49, out s2_119, out s3_120, out s4_121, out s5_122, out s6_123, out s10_55, out mstatus_52);
	a2Out = a2_46;
	a3Out = a3_47;
	a4Out = a4_48;
	a5Out = a5_49;
	s10Out = s10_55;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 230265FE: void wifi_mgmr_api_fw_powersaving(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_sta_powersaving
void wifi_mgmr_api_fw_powersaving(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	word32 t1_112;
	word32 a0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a5_116;
	word32 s1_117;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	word32 a5_122;
	word32 s2_123;
	word32 s3_124;
	word32 s4_125;
	word32 s5_126;
	word32 s6_127;
	word32 s10_128;
	word32 mstatus_129;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_112, out a0_113, out a1_114, out a2_115, out a3_16, out a4_17, out a5_116), fp + ~0x1F, a3_16, a4_17, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_117, out a1_118, out a2_119, out a3_120, out a4_121, out a5_122, out s2_123, out s3_124, out s4_125, out s5_126, out s6_127, out s10_128, out mstatus_129);
}

