pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23026672: Register Eq_2 wifi_mgmr_api_ap_start(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8)
// Called from:
//      wifi_mgmr_ap_start
Eq_2 wifi_mgmr_api_ap_start(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8)
{
	if (a0 == 0x00)
		return s0;
	word32 a5_397;
	word32 a4_396;
	word32 a3_395;
	word32 a2_394;
	word32 a1_393;
	word32 a0_392;
	word32 t1_391;
	Eq_2 ra_33 = memset(ra, fp + -0x009C, 0x00, 0x007C, out t1_391, out a0_392, out a1_393, out a2_394, out a3_395, out a4_396, out a5_397);
	word32 a3_400;
	word32 a4_401;
	word32 a5_402;
	word32 a2_399;
	word32 a1_398;
	Eq_2 a0_37 = strlen(a0, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402);
	Eq_2 s0_12 = a2;
	byte bLoc69_195 = (byte) a0_37;
	Eq_2 dwLoc68_245 = SEQ(bLoc65, (byte) (a0_37 >> 0x18), (byte) (a0_37 >> 0x10), (byte) (a0_37 >> 0x08));
	if (a0_37 > 32)
		return s0_12;
	if (a1 != 0x00)
	{
		word32 a1_403;
		word32 a2_404;
		word32 a3_405;
		word32 a4_406;
		word32 a5_407;
		if (strlen(a1, out a1_403, out a2_404, out a3_405, out a4_406, out a5_407) > 32)
			return s0_12;
	}
	Eq_2 a2_95;
	word32 a1_408;
	word32 a5_409;
	word32 a6_410;
	word32 a7_411;
	Eq_2 a4_108;
	Eq_2 a3_113;
	memcpy(fp + -0x008B, a0, (word32) bLoc69_195 | 0x7C00, out a1_408, out a2_95, out a3_113, out a4_108, out a5_409, out a6_410, out a7_411);
	if (a1 != 0x00)
	{
		word32 a1_412;
		word32 a2_413;
		word32 a5_414;
		word32 a6_415;
		word32 a7_416;
		memcpy(fp + -101, a1, a2_95, out a1_412, out a2_413, out a3_113, out a4_108, out a5_414, out a6_415, out a7_416);
	}
	word32 s1_417;
	word32 a1_418;
	word32 a2_419;
	word32 a3_420;
	word32 a4_421;
	word32 a5_422;
	word32 s2_423;
	word32 s3_424;
	word32 s4_425;
	word32 s5_426;
	word32 s6_427;
	word32 s10_428;
	word32 mstatus_429;
	wifi_mgmr_event_notify(ra_33, fp + -0x009C, a3_113, a4_108, 32, mstatus, 0x66778811, SEQ(nLoc8B, (byte) (a2 >> 24)), dwLoc88, dwLoc68_245, dwLoc40, dwLoc3C, dwLoc18, dwLoc0C, dwArg0C, dwArg10, dwArg14, dwArg38, dwArg68, dwArg88, dwArgA8, dwArgC8, out s1_417, out a1_418, out a2_419, out a3_420, out a4_421, out a5_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s10_428, out mstatus_429);
	s0_12 = a2 >> 24;
	return s0_12;
}

// 2302678E: Register Eq_2 wifi_mgmr_api_ap_stop(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_ap_stop
Eq_2 wifi_mgmr_api_ap_stop(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 a3_47;
	ptr32 mstatus_52;
	ptr32 s1_54;
	ptr32 s2_57;
	word32 t1_110;
	word32 a0_111;
	word32 a1_112;
	word32 a2_113;
	word32 a5_114;
	word32 a1_115;
	word32 a2_116;
	word32 a4_117;
	word32 a5_118;
	word32 s3_119;
	word32 s4_120;
	word32 s5_121;
	word32 s6_122;
	word32 s10_123;
	Eq_2 ra_53 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_110, out a0_111, out a1_112, out a2_113, out a3_12, out a4_13, out a5_114), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_54, out a1_115, out a2_116, out a3_47, out a4_117, out a5_118, out s2_57, out s3_119, out s4_120, out s5_121, out s6_122, out s10_123, out mstatus_52);
	s1Out = s1_54;
	a3Out = a3_47;
	s2Out = s2_57;
	mstatusOut = mstatus_52;
	return ra_53;
}

// 23026800: Register Eq_2 wifi_mgmr_api_idle(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_sta_disable
//      wifi_mgmr_sniffer_disable
Eq_2 wifi_mgmr_api_idle(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_51;
	ptr32 s4_58;
	word32 t1_107;
	word32 a0_108;
	word32 a1_109;
	word32 a2_110;
	word32 a5_111;
	word32 s1_112;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	word32 a5_117;
	word32 s2_118;
	word32 s3_119;
	word32 s5_120;
	word32 s6_121;
	word32 s10_122;
	Eq_2 ra_52 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_107, out a0_108, out a1_109, out a2_110, out a3_12, out a4_13, out a5_111), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_112, out a1_113, out a2_114, out a3_115, out a4_116, out a5_117, out s2_118, out s3_119, out s4_58, out s5_120, out s6_121, out s10_122, out mstatus_51);
	s4Out = s4_58;
	mstatusOut = mstatus_51;
	return ra_52;
}

// 23026870: Register Eq_2 wifi_mgmr_api_denoise_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 mstatusOut)
// Called from:
//      trigger_auto_denoise
//      wifi_denoise_enable_cmd
Eq_2 wifi_mgmr_api_denoise_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & mstatusOut)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	ptr32 mstatus_49;
	word32 t1_104;
	word32 a0_105;
	word32 a1_106;
	word32 a2_107;
	word32 a5_108;
	word32 s1_109;
	word32 a1_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	word32 s2_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	word32 s6_119;
	word32 s10_120;
	Eq_2 ra_50 = wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_104, out a0_105, out a1_106, out a2_107, out a3_12, out a4_13, out a5_108), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_109, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s10_120, out mstatus_49);
	mstatusOut = mstatus_49;
	return ra_50;
}

// 230268D6: void wifi_mgmr_api_denoise_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_denoise_disable_cmd
void wifi_mgmr_api_denoise_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_12;
	Eq_2 a4_13;
	word32 t1_102;
	word32 a0_103;
	word32 a1_104;
	word32 a2_105;
	word32 a5_106;
	word32 s1_107;
	word32 a1_108;
	word32 a2_109;
	word32 a3_110;
	word32 a4_111;
	word32 a5_112;
	word32 s2_113;
	word32 s3_114;
	word32 s4_115;
	word32 s5_116;
	word32 s6_117;
	word32 s10_118;
	word32 mstatus_119;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_102, out a0_103, out a1_104, out a2_105, out a3_12, out a4_13, out a5_106), fp + ~0x1F, a3_12, a4_13, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_107, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out s2_113, out s3_114, out s4_115, out s5_116, out s6_117, out s10_118, out mstatus_119);
}

// 2302693A: void wifi_mgmr_api_raw_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_116622 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_mgmr_raw_80211_send
void wifi_mgmr_api_raw_send(Eq_2 ra, Eq_2 s1, Eq_116622 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	word32 t1_117;
	word32 a0_118;
	word32 a1_119;
	word32 a2_120;
	word32 a5_121;
	word32 s1_122;
	word32 a1_123;
	word32 a2_124;
	word32 a3_125;
	word32 a4_126;
	word32 a5_127;
	word32 s2_128;
	word32 s3_129;
	word32 s4_130;
	word32 s5_131;
	word32 s6_132;
	word32 s10_133;
	word32 mstatus_134;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_117, out a0_118, out a1_119, out a2_120, out a3_20, out a4_21, out a5_121), fp + ~0x1F, a3_20, a4_21, s4, mstatus, SEQ(0x00, 0x00, 0x0D, (byte) (a1 >> 24)), dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_122, out a1_123, out a2_124, out a3_125, out a4_126, out a5_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s10_133, out mstatus_134);
}

// 230269AE: Register Eq_2 wifi_mgmr_api_set_country_code(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 wifi_mgmr_api_set_country_code(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & mstatusOut)
{
	ptr32 mstatus_16;
	Eq_2 ra_17 = wifi_mgmr_set_country_code_internal(ra, a0, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg18, dwArg28, dwArg30, dwArg34, dwArg3C, dwArg4C, dwArg58, dwArg7C, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out mstatus_16);
	mstatusOut = mstatus_16;
	return ra_17;
}

// 230269BE: void cmd_rf_dump()
void cmd_rf_dump()
{
}

// 230269C0: void cmd_dump_reset()
void cmd_dump_reset()
{
	g_dw4200F398 = 0x0A;
}

// 230269CC: void cmd_wifi_power_table_update()
void cmd_wifi_power_table_update()
{
	word32 a1_39;
	word32 a2_40;
	word32 a3_41;
	word32 a4_42;
	word32 a5_43;
	word32 a6_44;
	word32 a7_45;
	memcpy(fp + -56, 587936908, 38, out a1_39, out a2_40, out a3_41, out a4_42, out a5_43, out a6_44, out a7_45);
	bl_tpc_update_power_table(fp + -56);
}

// 230269EE: void cmd_wifi_state_get(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cmd_wifi_state_get(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	uint32 a5_12;
	word32 a4_109;
	Eq_2 a3_10 = wifi_mgmr_state_get(fp + ~0x13, out a4_109, out a5_12);
	if (a5_12 <= 0x15)
	{
		struct Eq_274 * a0_21;
		switch (g_a230B3434[a5_12 * 0x04])
		{
		case 0x00:
			a0_21 = (struct Eq_274 *) &g_t230B3648;
			break;
		case 0x01:
			a0_21 = (struct Eq_274 *) &g_t230B3660;
			break;
		}
		word32 s1_110;
		word32 a0_111;
		word32 a1_112;
		word32 a2_113;
		word32 a3_114;
		word32 a4_115;
		word32 a5_116;
		word32 a7_117;
		word32 s2_118;
		word32 s3_119;
		word32 s4_120;
		word32 s5_121;
		word32 s6_122;
		word32 s7_123;
		word32 s8_124;
		word32 s9_125;
		word32 s10_126;
		word32 s11_127;
		word32 t4_128;
		printf(ra, a0_21, a3_10, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_110, out a0_111, out a1_112, out a2_113, out a3_114, out a4_115, out a5_116, out a7_117, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s7_123, out s8_124, out s9_125, out s10_126, out s11_127, out t4_128);
	}
}

// 23026AB0: void wifi_sta_get_state_cmd(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void wifi_sta_get_state_cmd(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_274 * a0_56;
	word32 a5_19;
	Eq_2 a3_23;
	word32 a4_139;
	word32 a2_138;
	word32 a1_137;
	word32 a0_136;
	word32 s1_135;
	word32 a5_134;
	word32 a4_133;
	word32 a7_140;
	word32 s2_141;
	word32 s3_142;
	word32 s4_143;
	word32 s5_144;
	word32 s6_145;
	word32 s7_146;
	word32 s8_147;
	word32 s9_148;
	word32 s10_149;
	word32 s11_150;
	word32 t4_151;
	Eq_2 ra_26 = printf(ra, &g_t230B44BC, wifi_mgmr_state_get(fp + ~0x13, out a4_133, out a5_134), dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_135, out a0_136, out a1_137, out a2_138, out a3_23, out a4_139, out a5_19, out a7_140, out s2_141, out s3_142, out s4_143, out s5_144, out s6_145, out s7_146, out s8_147, out s9_148, out s10_149, out s11_150, out t4_151);
	if (a5_19 == 0x00)
		a0_56 = (struct Eq_274 *) &g_t230B44D4;
	else if (a5_19 == 0x01)
		a0_56 = (struct Eq_274 *) &g_t230B4500;
	else if (a5_19 == 0x02)
		a0_56 = (struct Eq_274 *) &g_t230B4528;
	else if (a5_19 == 0x03)
		a0_56 = (struct Eq_274 *) &g_t230B4554;
	else if (a5_19 == 0x04)
		a0_56 = (struct Eq_274 *) &g_t230B458C;
	else if (a5_19 == 0x05)
		a0_56 = (struct Eq_274 *) &g_t230B45C0;
	else if (a5_19 == 0x11)
		a0_56 = (struct Eq_274 *) &g_t230B45EC;
	else if (a5_19 == 0x12)
		a0_56 = (struct Eq_274 *) &g_t230B461C;
	else if (a5_19 == 0x13)
		a0_56 = (struct Eq_274 *) &g_t230B4650;
	else if (a5_19 == 0x14)
		a0_56 = (struct Eq_274 *) &g_t230B4690;
	else if (a5_19 == 0x15)
		a0_56 = (struct Eq_274 *) &g_t230B46CC;
	else if (a5_19 == 0x06)
		a0_56 = (struct Eq_274 *) &g_t230B4700;
	else if (a5_19 == 0x07)
		a0_56 = (struct Eq_274 *) &g_t230B4728;
	else if (a5_19 == 0x08)
		a0_56 = (struct Eq_274 *) &g_t230B4754;
	else if (a5_19 == 0x09)
		a0_56 = (struct Eq_274 *) &g_t230B4780;
	else
		a0_56 = (struct Eq_274 *) &g_t230B47B0;
	word32 s1_152;
	word32 a0_153;
	word32 a1_154;
	word32 a2_155;
	word32 a3_156;
	word32 a4_157;
	word32 a5_158;
	word32 a7_159;
	word32 s2_160;
	word32 s3_161;
	word32 s4_162;
	word32 s5_163;
	word32 s6_164;
	word32 s7_165;
	word32 s8_166;
	word32 s9_167;
	word32 s10_168;
	word32 s11_169;
	word32 t4_170;
	printf(ra_26, a0_56, a3_23, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_158, out a7_159, out s2_160, out s3_161, out s4_162, out s5_163, out s6_164, out s7_165, out s8_166, out s9_167, out s10_168, out s11_169, out t4_170);
}

// 23026BD2: void wifi_edca_dump_cmd(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void wifi_edca_dump_cmd(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	word32 a0_235;
	word32 a1_236;
	word32 a2_237;
	word32 a4_238;
	word32 a5_239;
	word32 s4_240;
	word32 s8_241;
	puts(0x230B4264, out a0_235, out a1_236, out a2_237, out a4_238, out a5_239, out s4_240, out s8_241);
	bl60x_edca_get(0x00, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_242;
	word32 a1_243;
	word32 a2_244;
	word32 a4_245;
	word32 a5_246;
	word32 s4_247;
	word32 s8_248;
	puts(0x230B4278, out a0_242, out a1_243, out a2_244, out a4_245, out a5_246, out s4_247, out s8_248);
	Eq_2 dwLoc18_230 = (uint32) nLoc18;
	word32 s1_249;
	word32 a0_250;
	word32 a1_251;
	word32 a2_252;
	word32 a3_253;
	word32 a4_254;
	word32 a5_255;
	word32 a7_256;
	word32 s2_257;
	word32 s3_258;
	word32 s4_259;
	word32 s5_260;
	word32 s6_261;
	word32 s7_262;
	word32 s8_263;
	word32 s9_264;
	word32 s10_265;
	word32 s11_266;
	word32 t4_267;
	Eq_2 ra_59 = printf(ra, &g_t230B4284, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_249, out a0_250, out a1_251, out a2_252, out a3_253, out a4_254, out a5_255, out a7_256, out s2_257, out s3_258, out s4_259, out s5_260, out s6_261, out s7_262, out s8_263, out s9_264, out s10_265, out s11_266, out t4_267);
	bl60x_edca_get(0x01, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_268;
	word32 a1_269;
	word32 a2_270;
	word32 a4_271;
	word32 a5_272;
	word32 s4_273;
	word32 s8_274;
	puts(0x230B42B0, out a0_268, out a1_269, out a2_270, out a4_271, out a5_272, out s4_273, out s8_274);
	word32 s1_275;
	word32 a0_276;
	word32 a1_277;
	word32 a2_278;
	word32 a3_279;
	word32 a4_280;
	word32 a5_281;
	word32 a7_282;
	word32 s2_283;
	word32 s3_284;
	word32 s4_285;
	word32 s5_286;
	word32 s6_287;
	word32 s7_288;
	word32 s8_289;
	word32 s9_290;
	word32 s10_291;
	word32 s11_292;
	word32 t4_293;
	Eq_2 ra_107 = printf(ra_59, &g_t230B4284, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_275, out a0_276, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a7_282, out s2_283, out s3_284, out s4_285, out s5_286, out s6_287, out s7_288, out s8_289, out s9_290, out s10_291, out s11_292, out t4_293);
	bl60x_edca_get(0x02, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_294;
	word32 a1_295;
	word32 a2_296;
	word32 a4_297;
	word32 a5_298;
	word32 s4_299;
	word32 s8_300;
	puts(0x230B42BC, out a0_294, out a1_295, out a2_296, out a4_297, out a5_298, out s4_299, out s8_300);
	word32 s1_301;
	word32 a0_302;
	word32 a1_303;
	word32 a2_304;
	word32 a3_305;
	word32 a4_306;
	word32 a5_307;
	word32 a7_308;
	word32 s2_309;
	word32 s3_310;
	word32 s4_311;
	word32 s5_312;
	word32 s6_313;
	word32 s7_314;
	word32 s8_315;
	word32 s9_316;
	word32 s10_317;
	word32 s11_318;
	word32 t4_319;
	Eq_2 ra_155 = printf(ra_107, &g_t230B4284, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a2_304, out a3_305, out a4_306, out a5_307, out a7_308, out s2_309, out s3_310, out s4_311, out s5_312, out s6_313, out s7_314, out s8_315, out s9_316, out s10_317, out s11_318, out t4_319);
	bl60x_edca_get(0x03, fp + ~0x14, fp + ~0x13, fp + ~0x12, fp + ~0x11);
	word32 a0_320;
	word32 a1_321;
	word32 a2_322;
	word32 a4_323;
	word32 a5_324;
	word32 s4_325;
	word32 s8_326;
	puts(587940552, out a0_320, out a1_321, out a2_322, out a4_323, out a5_324, out s4_325, out s8_326);
	word32 s1_327;
	word32 a0_328;
	word32 a1_329;
	word32 a2_330;
	word32 a3_331;
	word32 a4_332;
	word32 a5_333;
	word32 a7_334;
	word32 s2_335;
	word32 s3_336;
	word32 s4_337;
	word32 s5_338;
	word32 s6_339;
	word32 s7_340;
	word32 s8_341;
	word32 s9_342;
	word32 s10_343;
	word32 s11_344;
	word32 t4_345;
	printf(ra_155, &g_t230B4284, 0x00, dwLoc18_230, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_327, out a0_328, out a1_329, out a2_330, out a3_331, out a4_332, out a5_333, out a7_334, out s2_335, out s3_336, out s4_337, out s5_338, out s6_339, out s7_340, out s8_341, out s9_342, out s10_343, out s11_344, out t4_345);
}

