pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23026CE0: void wifi_ap_sta_list_get_cmd(Register Eq_2 ra, Register ui32 a1, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C)
void wifi_ap_sta_list_get_cmd(Eq_2 ra, ui32 a1, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg4C)
{
	struct Eq_274 * a0_262;
	byte bLoc47_447 = SLICE(s6, byte, 8);
	byte bLoc48_450 = (byte) s6;
	byte bLoc46_475 = SLICE(s6, byte, 16);
	word32 a4_551;
	word32 a5_552;
	Eq_2 a3_27 = wifi_mgmr_state_get(fp + -76, out a4_551, out a5_552);
	if ((a1 & 16) == 0x00)
		a0_262 = (struct Eq_274 *) &g_t230B4098;
	else
	{
		wifi_mgmr_ap_sta_cnt_get(fp + -77);
		if (false)
		{
			Eq_2 a3_44;
			Eq_2 a3_57;
			Eq_2 a3_81;
			Eq_2 a3_105;
			word32 a2_616;
			word32 a3_617;
			word32 a0_614;
			word32 a1_615;
			word32 t4_612;
			word32 s1_613;
			word32 s10_610;
			word32 s11_611;
			word32 s4_568;
			word32 s8_608;
			word32 s9_609;
			word32 s6_606;
			word32 s7_607;
			word32 s4_604;
			word32 s5_605;
			word32 s2_602;
			word32 s3_603;
			word32 a5_600;
			word32 a7_601;
			word32 a2_598;
			word32 a4_599;
			word32 a0_596;
			word32 a1_597;
			word32 t4_594;
			word32 s1_595;
			word32 s11_593;
			word32 s10_592;
			word32 s9_591;
			word32 s8_590;
			word32 s7_589;
			word32 s6_588;
			word32 a5_582;
			word32 s5_587;
			word32 a7_583;
			word32 s2_584;
			word32 s3_585;
			word32 s4_586;
			word32 t4_576;
			word32 a4_581;
			word32 s1_577;
			word32 a0_578;
			word32 a1_579;
			word32 a2_580;
			word32 s6_570;
			word32 s11_575;
			word32 s7_571;
			word32 s8_572;
			word32 s9_573;
			word32 s10_574;
			word32 a0_554;
			word32 s5_569;
			word32 t1_553;
			word32 a1_555;
			word32 a2_556;
			word32 a4_557;
			word32 a5_558;
			word32 s1_559;
			word32 a0_560;
			word32 a1_561;
			word32 a7_565;
			word32 a2_562;
			word32 a5_564;
			word32 s2_566;
			word32 a4_563;
			word32 s3_567;
			word32 a4_618;
			word32 a5_619;
			word32 a7_620;
			word32 s2_621;
			word32 s4_622;
			word32 s5_623;
			word32 s6_624;
			word32 s7_625;
			word32 s8_626;
			word32 s9_627;
			word32 s10_628;
			word32 s11_629;
			word32 t4_630;
			word32 s3_137;
			Eq_2 ra_132 = printf(printf(printf(printf(memset(ra, fp + -72, 0x00, 0x18, out t1_553, out a0_554, out a1_555, out a2_556, out a3_44, out a4_557, out a5_558), &g_t230B40EC, a3_44, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_559, out a0_560, out a1_561, out a2_562, out a3_57, out a4_563, out a5_564, out a7_565, out s2_566, out s3_567, out s4_568, out s5_569, out s6_570, out s7_571, out s8_572, out s9_573, out s10_574, out s11_575, out t4_576), &g_t230B40F8, a3_57, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_577, out a0_578, out a1_579, out a2_580, out a3_81, out a4_581, out a5_582, out a7_583, out s2_584, out s3_585, out s4_586, out s5_587, out s6_588, out s7_589, out s8_590, out s9_591, out s10_592, out s11_593, out t4_594), &g_t230B4150, a3_81, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_595, out a0_596, out a1_597, out a2_598, out a3_105, out a4_599, out a5_600, out a7_601, out s2_602, out s3_603, out s4_604, out s5_605, out s6_606, out s7_607, out s8_608, out s9_609, out s10_610, out s11_611, out t4_612), &g_t230B40F8, a3_105, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_613, out a0_614, out a1_615, out a2_616, out a3_617, out a4_618, out a5_619, out a7_620, out s2_621, out s3_137, out s4_622, out s5_623, out s6_624, out s7_625, out s8_626, out s9_627, out s10_628, out s11_629, out t4_630);
			Eq_2 s1_147 = 0x00;
			ui32 s6_150 = 0x0C;
			word32 s7_151 = 0x230B4000;
			while (s1_147 < 0x00)
			{
				Eq_2 a3_162;
				word32 s4_170;
				word32 s0_650;
				word32 a2_651;
				word32 a4_652;
				word32 s1_169;
				ra_132 = wifi_mgmr_ap_sta_info_get(ra_132, s1_147, out s0_650, out s1_169, out a2_651, out a3_162, out a4_652, out s4_170);
				if ((word32) bLoc47_447 != 0x00 && (word32) bLoc48_450 != s4_170)
				{
					word32 a1_183 = (word32) bLoc34;
					struct Eq_117580 * a5_185 = s3_137 + 2040;
					ui32 s0_186 = 0x00;
					while ((word32) a5_185->b0000 != a1_183)
					{
						ui32 s0_192 = s0_186 + 0x01;
						s0_186 = s0_192 & 0x00FF;
						++a5_185;
						if ((s0_192 & 0x00FF) == s6_150)
							break;
					}
					word32 a0_653;
					word32 a1_654;
					word32 a2_655;
					word32 a3_656;
					word32 a4_657;
					word32 a5_658;
					word32 a7_659;
					word32 s2_660;
					word32 s4_661;
					word32 s5_662;
					word32 s8_663;
					word32 s9_664;
					word32 s10_665;
					word32 s11_666;
					word32 t4_667;
					ra_132 = printf(ra_132, s7_151 + 424, (word32) bLoc46_475, a3_162, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_169, out a0_653, out a1_654, out a2_655, out a3_656, out a4_657, out a5_658, out a7_659, out s2_660, out s3_137, out s4_661, out s5_662, out s6_150, out s7_151, out s8_663, out s9_664, out s10_665, out s11_666, out t4_667);
				}
				s1_147 = s1_169 + 0x01 & 0x00FF;
			}
			return;
		}
		a0_262 = (struct Eq_274 *) &g_t230B40C0;
	}
	word32 s1_631;
	word32 a0_632;
	word32 a1_633;
	word32 a2_634;
	word32 a3_635;
	word32 a4_636;
	word32 a5_637;
	word32 a7_638;
	word32 s2_639;
	word32 s3_640;
	word32 s4_641;
	word32 s5_642;
	word32 s6_643;
	word32 s7_644;
	word32 s8_645;
	word32 s9_646;
	word32 s10_647;
	word32 s11_648;
	word32 t4_649;
	printf(ra, a0_262, a3_27, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_631, out a0_632, out a1_633, out a2_634, out a3_635, out a4_636, out a5_637, out a7_638, out s2_639, out s3_640, out s4_641, out s5_642, out s6_643, out s7_644, out s8_645, out s9_646, out s10_647, out s11_648, out t4_649);
}

// 23026E12: void wifi_ap_sta_delete_cmd(Register Eq_2 ra, Register (ptr32 Eq_2) a1, Register word32 a2, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8)
void wifi_ap_sta_delete_cmd(Eq_2 ra, union Eq_2 * a1, word32 a2, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8)
{
	byte bLoc27_368 = SLICE(dwLoc28, byte, 8);
	byte bLoc28_369 = (byte) dwLoc28;
	byte bLoc26_388 = SLICE(dwLoc28, byte, 16);
	struct Eq_274 * a0_276;
	Eq_2 a3_148;
	if (a2 != 0x02)
	{
		a3_148 = *a1;
		a0_276 = (struct Eq_274 *) &g_t230B3F90;
	}
	else
	{
		word32 a5_525;
		word32 a4_524;
		a3_148 = wifi_mgmr_state_get(fp + -44, out a4_524, out a5_525);
		if ((a1 & 16) == 0x00)
			a0_276 = (struct Eq_274 *) &g_t230B4098;
		else
		{
			Eq_2 a4_32;
			word32 s1_526;
			word32 a0_527;
			word32 a7_532;
			word32 a1_528;
			word32 a2_529;
			word32 a3_530;
			word32 a5_531;
			word32 s5_536;
			word32 s6_537;
			word32 s2_533;
			word32 s3_534;
			word32 s4_535;
			word32 s8_539;
			word32 s7_538;
			word32 s9_540;
			word32 s11_542;
			word32 t4_543;
			word32 s10_541;
			Eq_2 ra_34 = printf(ra, &g_t230B3FA8, a3_148, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_526, out a0_527, out a1_528, out a2_529, out a3_530, out a4_32, out a5_531, out a7_532, out s2_533, out s3_534, out s4_535, out s5_536, out s6_537, out s7_538, out s8_539, out s9_540, out s10_541, out s11_542, out t4_543);
			word32 a4_54;
			word32 a5_547;
			word32 a3_546;
			word32 a2_545;
			word32 a1_544;
			Eq_2 a0_52 = strlen(a4_32, out a1_544, out a2_545, out a3_546, out a4_54, out a5_547);
			struct Eq_117738 * a0_61 = (word32) a0_52 + a4_54;
			a0_61->b0000 = 0x00;
			ui32 s0_49 = 0x00;
			word32 a6_103 = 0x01;
			struct Eq_117738 * a1_63 = a0_61;
			while (a0_61 - a1_63 < a0_52)
			{
				word32 a3_72 = (word32) a1_63->bFFFFFFFF;
				uint32 a5_74 = a3_72 + -48 & 0x00FF;
				if (a5_74 > 0x09)
				{
					ui32 a5_82;
					if ((a3_72 + -97 & 0x00FF) <= 0x05)
					{
						a5_82 = a3_72 + -87;
						goto l23026EE8;
					}
					a5_74 = 0x00;
					if ((a3_72 + -65 & 0x00FF) <= 0x05)
					{
						a5_82 = a3_72 + -55;
l23026EE8:
						a5_74 = a5_82 & 0x00FF;
					}
				}
				a1_63 = (struct Eq_117738 *) &a1_63->bFFFFFFFF;
				s0_49 = (word32) (word16) (s0_49 + (a5_74 + a6_103));
				a6_103 += 0x0A;
			}
			Eq_2 s0_104 = s0_49 & 0x00FF;
			word32 a1_569;
			Eq_2 a3_123;
			word32 a0_568;
			word32 s1_567;
			word32 a2_570;
			word32 a4_571;
			word32 a5_572;
			word32 a7_573;
			word32 s2_574;
			word32 s3_575;
			word32 s4_576;
			word32 s5_577;
			word32 s6_578;
			word32 s7_579;
			word32 s8_580;
			word32 s9_581;
			word32 s10_582;
			word32 s11_583;
			word32 t4_584;
			word32 s1_585;
			word32 a0_586;
			word32 a1_587;
			word32 a2_588;
			word32 a4_589;
			word32 a5_590;
			word32 a7_591;
			word32 s2_592;
			word32 s3_593;
			word32 s4_594;
			word32 s5_595;
			word32 s6_596;
			word32 s7_597;
			word32 s8_598;
			word32 s9_599;
			word32 s10_600;
			word32 s11_601;
			word32 t4_602;
			ra = printf(printf(ra_34, &g_t230B3FBC, s0_104, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_567, out a0_568, out a1_569, out a2_570, out a3_123, out a4_571, out a5_572, out a7_573, out s2_574, out s3_575, out s4_576, out s5_577, out s6_578, out s7_579, out s8_580, out s9_581, out s10_582, out s11_583, out t4_584), &g_t230B3FEC, a3_123, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_585, out a0_586, out a1_587, out a2_588, out a3_148, out a4_589, out a5_590, out a7_591, out s2_592, out s3_593, out s4_594, out s5_595, out s6_596, out s7_597, out s8_598, out s9_599, out s10_600, out s11_601, out t4_602);
			wifi_mgmr_ap_sta_cnt_get(fp + -45);
			if (false && s0_104 <= 0x00)
			{
				struct Eq_98932 * s0_193;
				word32 t1_603;
				word32 a0_604;
				word32 a1_605;
				word32 a2_606;
				word32 a3_607;
				word32 a4_608;
				word32 a5_609;
				word32 s1_610;
				word32 a2_611;
				word32 a4_612;
				word32 s4_613;
				ra = wifi_mgmr_ap_sta_info_get(memset(ra, fp + -40, 0x00, 0x18, out t1_603, out a0_604, out a1_605, out a2_606, out a3_607, out a4_608, out a5_609), s0_104, out s0_193, out s1_610, out a2_611, out a3_148, out a4_612, out s4_613);
				if ((word32) bLoc27_368 != 0x00)
				{
					byte bLoc28_396 = (byte) (word16) dwLoc28;
					if ((word32) bLoc28_369 != 0x00EF)
					{
						Eq_2 s1_228;
						Eq_2 s4_233;
						word32 a0_614;
						word32 a1_615;
						word32 a2_616;
						word32 a3_617;
						word32 a4_618;
						word32 a5_619;
						word32 a7_620;
						word32 s2_621;
						word32 s3_622;
						word32 s5_623;
						word32 s6_624;
						word32 s7_625;
						word32 s8_626;
						word32 s9_627;
						word32 s10_628;
						word32 s11_629;
						word32 t4_630;
						wifi_mgmr_ap_sta_delete(printf(ra, &g_t230B4048, (word32) bLoc26_388, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_228, out a0_614, out a1_615, out a2_616, out a3_617, out a4_618, out a5_619, out a7_620, out s2_621, out s3_622, out s4_233, out s5_623, out s6_624, out s7_625, out s8_626, out s9_627, out s10_628, out s11_629, out t4_630), s0_193, s1_228, (word32) bLoc28_396, s4_233, mstatus, dwLoc40, dwLoc3C, dwLoc24, dwArg0C, dwArg38, dwArg58, dwArg78, dwArg98, dwArgB8);
						return;
					}
				}
				a0_276 = (struct Eq_274 *) &g_t230B4030;
			}
			else
				a0_276 = (struct Eq_274 *) &g_t230B3FFC;
		}
	}
	word32 a1_550;
	word32 s1_548;
	word32 a0_549;
	word32 a4_553;
	word32 s2_556;
	word32 a2_551;
	word32 a3_552;
	word32 s5_559;
	word32 a5_554;
	word32 a7_555;
	word32 s4_558;
	word32 s3_557;
	word32 s8_562;
	word32 s7_561;
	word32 s6_560;
	word32 s9_563;
	word32 s11_565;
	word32 s10_564;
	word32 t4_566;
	printf(ra, a0_276, a3_148, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_548, out a0_549, out a1_550, out a2_551, out a3_552, out a4_553, out a5_554, out a7_555, out s2_556, out s3_557, out s4_558, out s5_559, out s6_560, out s7_561, out s8_562, out s9_563, out s10_564, out s11_565, out t4_566);
}

// 23026F78: void cmd_wifi_coex_pta_force_off(Register (ptr32 word32) a3, Register ptr32 mstatus)
void cmd_wifi_coex_pta_force_off(word32 * a3, ptr32 mstatus)
{
	word32 s0_23;
	word32 a0_24;
	word32 a2_25;
	word32 a3_26;
	word32 s2_27;
	word32 s3_28;
	word32 mstatus_29;
	coex_wifi_pta_forece_enable(0x00, a3, mstatus, out s0_23, out a0_24, out a2_25, out a3_26, out s2_27, out s3_28, out mstatus_29);
}

// 23026F7E: void cmd_wifi_coex_pta_force_on(Register (ptr32 word32) a3, Register ptr32 mstatus)
void cmd_wifi_coex_pta_force_on(word32 * a3, ptr32 mstatus)
{
	word32 s0_23;
	word32 a0_24;
	word32 a2_25;
	word32 a3_26;
	word32 s2_27;
	word32 s3_28;
	word32 mstatus_29;
	coex_wifi_pta_forece_enable(0x01, a3, mstatus, out s0_23, out a0_24, out a2_25, out a3_26, out s2_27, out s3_28, out mstatus_29);
}

