pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23026F84: void cmd_wifi_coex_pti_force_off()
void cmd_wifi_coex_pti_force_off()
{
	coex_wifi_pti_forece_enable(0x00);
}

// 23026F8A: void cmd_wifi_coex_pti_force_on()
void cmd_wifi_coex_pti_force_on()
{
	coex_wifi_pti_forece_enable(0x01);
}

// 23026F90: void cmd_wifi_coex_rf_force_off()
void cmd_wifi_coex_rf_force_off()
{
	coex_wifi_rf_forece_enable(0x00);
}

// 23026F96: void cmd_wifi_coex_rf_force_on()
void cmd_wifi_coex_rf_force_on()
{
	coex_wifi_rf_forece_enable(0x01);
}

// 23026F9C: void cmd_wifi_mib(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArg0198)
void cmd_wifi_mib(Eq_2 ra, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArg0198)
{
	union Eq_2 * a0_8;
	Eq_2 s1_16;
	Eq_2 s10_17;
	Eq_2 ra_15 = hal_mib_dump(ra, a3, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_16, out a0_8, out s10_17);
	Eq_2 a3_34 = *a0_8;
	word32 s0_73;
	word32 a2_74;
	word32 a3_75;
	word32 a4_76;
	word32 s2_77;
	utils_hexdump(ra_15, s1_16, 0x1E, a3_34, s10_17, dwArg30, dwArg34, dwArg7C, dwArg0198, out s0_73, out a2_74, out a3_75, out a4_76, out s2_77);
}

// 23026FB4: void cmd_wifi_cfg(Register Eq_2 ra, Register (ptr32 Eq_118136) a2, Register (ptr32 (arr (ptr32 Eq_442586))) a3, Register (ptr32 Eq_118136) a4, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack up32 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98)
void cmd_wifi_cfg(Eq_2 ra, struct Eq_118136 * a2, struct Eq_442586 * (* a3)[], struct Eq_118136 * a4, Eq_2 s2, Eq_2 s4, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg5C, up32 dwArg64, Eq_2 dwArg78, Eq_2 dwArg98)
{
	utils_getopt_init(fp + -84, null);
	struct Eq_118136 * s6_33 = a2;
	struct Eq_442586 * (* s4_35)[] = a3;
	word32 s7_42 = 0x230B3000;
	ra_57 = ra;
	while (true)
	{
		Eq_2 ra_57;
		Eq_2 a0_59;
		Eq_2 a1_66;
		word32 s10_71;
		word32 s11_72;
		Eq_2 s3_74;
		Eq_2 s5_76;
		word32 s8_79;
		word32 s9_80;
		ra_57 = utils_getopt(ra_57, fp + -84, s6_33, s4_35, s7_42 + 0x055C, a4, s10, dwArg00, dwArg04, dwArg28, ra, out a0_59, out a1_66, out s3_74, out s4_35, out s5_76, out s6_33, out s7_42, out s8_79, out s9_80, out s10_71, out s11_72);
		a4 = (struct Eq_118136 *) 118;
		if (a0_59 == ~0x00)
			break;
		if (a0_59 != s5_76)
		{
			if (s5_76 < a0_59)
			{
				if (a0_59 != 116)
				{
					if (a0_59 != 118)
					{
						if (a0_59 == 101)
						{
							word32 a1_726;
							word32 a2_727;
							word32 a3_728;
							word32 a5_729;
							atoi(a0_59, out a1_726, out a2_727, out a3_728, out a4, out a5_729);
						}
					}
					else
					{
						word32 a1_722;
						word32 a2_723;
						word32 a3_724;
						word32 a5_725;
						atoi(a0_59, out a1_722, out a2_723, out a3_724, out a4, out a5_725);
					}
				}
				else
				{
					word32 a1_718;
					word32 a2_719;
					word32 a3_720;
					word32 a5_721;
					atoi(a0_59, out a1_718, out a2_719, out a3_720, out a4, out a5_721);
				}
				continue;
			}
			if (a0_59 == 63)
			{
				word32 s1_695;
				word32 a0_696;
				word32 a1_697;
				word32 a2_698;
				word32 a3_699;
				word32 a4_700;
				word32 a5_701;
				word32 a7_702;
				word32 s2_703;
				word32 s3_704;
				word32 s4_705;
				word32 s5_706;
				word32 s6_707;
				word32 s7_708;
				word32 s8_709;
				word32 s9_710;
				word32 s10_711;
				word32 s11_712;
				word32 t4_713;
				printf(ra_57, &g_t230B3544, ~0x00, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_695, out a0_696, out a1_697, out a2_698, out a3_699, out a4_700, out a5_701, out a7_702, out s2_703, out s3_704, out s4_705, out s5_706, out s6_707, out s7_708, out s8_709, out s9_710, out s10_711, out s11_712, out t4_713);
				return;
			}
			else
			{
				if (a0_59 == 84)
				{
					word32 a1_714;
					word32 a2_715;
					word32 a3_716;
					word32 a5_717;
					atoi(a0_59, out a1_714, out a2_715, out a3_716, out a4, out a5_717);
				}
				continue;
			}
		}
		Eq_2 a1_92;
		word32 a2_692;
		word32 a3_693;
		word32 a5_694;
		if (strcmp(s8_79 + -412, a1_66, out a1_92, out a2_692, out a3_693, out a4, out a5_694) != 0x00)
		{
			Eq_2 a1_104;
			word32 a2_730;
			word32 a3_731;
			word32 a5_732;
			if (strcmp(s9_80 + -472, a1_92, out a1_104, out a2_730, out a3_731, out a4, out a5_732) != 0x00)
			{
				Eq_2 a1_116;
				word32 a2_733;
				word32 a3_734;
				word32 a5_735;
				if (strcmp(s10_71 + -432, a1_104, out a1_116, out a2_733, out a3_734, out a4, out a5_735) != 0x00)
				{
					word32 a1_736;
					word32 a2_737;
					word32 a3_738;
					word32 a5_739;
					strcmp(s11_72 + -812, a1_116, out a1_736, out a2_737, out a3_738, out a4, out a5_739) != 0x00;
				}
			}
		}
	}
	Eq_2 a5_286;
	Eq_2 ra_272;
	Eq_2 s1_273;
	uint32 a0_291;
	Eq_2 s3_277;
	Eq_2 a4_287;
	Eq_2 a3_242;
	word32 t4_640;
	word32 s8_636;
	word32 s11_639;
	word32 s9_637;
	word32 s10_638;
	word32 s4_632;
	word32 s7_635;
	word32 s5_633;
	word32 s6_634;
	word32 a5_628;
	word32 s3_631;
	word32 a7_629;
	word32 s2_630;
	word32 a4_627;
	word32 s1_623;
	word32 a1_625;
	word32 a2_626;
	word32 a0_624;
	Eq_2 ra_245 = printf(ra_57, &g_t230B3568, s3_74, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_623, out a0_624, out a1_625, out a2_626, out a3_242, out a4_627, out a5_628, out a7_629, out s2_630, out s3_631, out s4_632, out s5_633, out s6_634, out s7_635, out s8_636, out s9_637, out s10_638, out s11_639, out t4_640);
	if (dwArg64 == 0x02)
	{
		word32 s11_656;
		word32 t4_657;
		word32 s7_652;
		word32 s10_655;
		word32 s8_653;
		word32 s9_654;
		word32 s4_649;
		word32 s5_650;
		word32 s6_651;
		word32 s2_648;
		word32 a3_644;
		word32 a7_647;
		word32 a4_645;
		word32 a5_646;
		word32 a2_643;
		word32 a0_641;
		word32 a1_642;
		ra_272 = printf(ra_245, &g_t230B35B0, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_641, out a1_642, out a2_643, out a3_644, out a4_645, out a5_646, out a7_647, out s2_648, out s3_277, out s4_649, out s5_650, out s6_651, out s7_652, out s8_653, out s9_654, out s10_655, out s11_656, out t4_657);
		a5_286.u0 = 0x00;
		a4_287.u0 = 0x00;
		a0_291 = 0x02;
		goto l23027068;
	}
	if (dwArg64 <= 0x02)
	{
		if (dwArg64 == 0x01)
		{
			word32 t4_674;
			word32 s9_671;
			word32 s10_672;
			word32 s11_673;
			word32 s6_668;
			word32 s7_669;
			word32 s8_670;
			word32 s5_667;
			word32 a7_664;
			word32 s2_665;
			word32 s4_666;
			word32 a4_662;
			word32 a5_663;
			word32 a1_659;
			word32 a2_660;
			word32 a3_661;
			word32 a0_658;
			ra_272 = printf(ra_245, &g_t230B35B0, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_658, out a1_659, out a2_660, out a3_661, out a4_662, out a5_663, out a7_664, out s2_665, out s3_277, out s4_666, out s5_667, out s6_668, out s7_669, out s8_670, out s9_671, out s10_672, out s11_673, out t4_674);
			a5_286 = fp + -88;
			a4_287.u0 = 0x04;
			a0_291 = 0x01;
			goto l23027068;
		}
	}
	else
	{
		if (dwArg64 == 0x03)
		{
			word32 a0_740;
			word32 a1_741;
			word32 a2_742;
			word32 a3_743;
			word32 a4_744;
			word32 a5_745;
			word32 a7_746;
			word32 s2_747;
			word32 s4_748;
			word32 s5_749;
			word32 s6_750;
			word32 s7_751;
			word32 s8_752;
			word32 s9_753;
			word32 s10_754;
			word32 s11_755;
			word32 t4_756;
			ra_272 = printf(ra_245, &g_t230B35B0, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_740, out a1_741, out a2_742, out a3_743, out a4_744, out a5_745, out a7_746, out s2_747, out s3_277, out s4_748, out s5_749, out s6_750, out s7_751, out s8_752, out s9_753, out s10_754, out s11_755, out t4_756);
			a5_286.u0 = 0x00;
			a4_287.u0 = 0x00;
			a0_291 = 0x03;
l23027068:
			wifi_mgmr_cfg_req(ra_272, s1_273, a0_291, a4_287, a5_286, s3_277, mstatus, s10, s4, dwArg08, s9, dwArg58, dwArg78, dwArg98);
			return;
		}
		if (dwArg64 == 0x04)
		{
			word32 s1_757;
			word32 a0_758;
			word32 a1_759;
			word32 a2_760;
			word32 a3_761;
			word32 a4_762;
			word32 a5_763;
			word32 a7_764;
			word32 s2_765;
			word32 s3_766;
			word32 s4_767;
			word32 s5_768;
			word32 s6_769;
			word32 s7_770;
			word32 s8_771;
			word32 s9_772;
			word32 s10_773;
			word32 s11_774;
			word32 t4_775;
			printf(ra_245, &g_t230B35C0, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_757, out a0_758, out a1_759, out a2_760, out a3_761, out a4_762, out a5_763, out a7_764, out s2_765, out s3_766, out s4_767, out s5_768, out s6_769, out s7_770, out s8_771, out s9_772, out s10_773, out s11_774, out t4_775);
			return;
		}
	}
	word32 a5_680;
	word32 a4_679;
	word32 a3_678;
	word32 a2_677;
	word32 a1_676;
	word32 a0_675;
	word32 a7_681;
	word32 s2_682;
	word32 s4_683;
	word32 s5_684;
	word32 s6_685;
	word32 s7_686;
	word32 s8_687;
	word32 s9_688;
	word32 s10_689;
	word32 s11_690;
	word32 t4_691;
	ra_272 = printf(ra_245, &g_t230B35B0, a3_242, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_273, out a0_675, out a1_676, out a2_677, out a3_678, out a4_679, out a5_680, out a7_681, out s2_682, out s3_277, out s4_683, out s5_684, out s6_685, out s7_686, out s8_687, out s9_688, out s10_689, out s11_690, out t4_691);
	a5_286 = fp + -88;
	a4_287.u0 = 0x04;
	a0_291 = 0x00;
	goto l23027068;
}

// 230271A2: void cmd_wifi_ap_stop(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void cmd_wifi_ap_stop(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a3_12;
	word32 s1_80;
	word32 s2_81;
	word32 mstatus_82;
	Eq_2 ra_18 = wifi_mgmr_ap_stop(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s1_80, out a3_12, out s2_81, out mstatus_82);
	word32 s1_83;
	word32 a0_84;
	word32 a1_85;
	word32 a2_86;
	word32 a3_87;
	word32 a4_88;
	word32 a5_89;
	word32 a7_90;
	word32 s2_91;
	word32 s3_92;
	word32 s4_93;
	word32 s5_94;
	word32 s6_95;
	word32 s7_96;
	word32 s8_97;
	word32 s9_98;
	word32 s10_99;
	word32 s11_100;
	word32 t4_101;
	printf(ra_18, &g_t230B3528, a3_12, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_83, out a0_84, out a1_85, out a2_86, out a3_87, out a4_88, out a5_89, out a7_90, out s2_91, out s3_92, out s4_93, out s5_94, out s6_95, out s7_96, out s8_97, out s9_98, out s10_99, out s11_100, out t4_101);
}

// 230271BC: void cmd_wifi_ap_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0128)
void cmd_wifi_ap_start(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0128)
{
	Eq_2 a4_134;
	Eq_2 a3_137;
	word32 a0_266;
	word32 t1_265;
	word32 a1_267;
	word32 a2_268;
	word32 a3_269;
	word32 a4_270;
	word32 a5_271;
	Eq_2 ra_25 = memset(ra, fp + -56, 0x00, 0x06, out t1_265, out a0_266, out a1_267, out a2_268, out a3_269, out a4_270, out a5_271);
	bl_wifi_mac_addr_get(fp + -56);
	Eq_2 s1_71;
	Eq_2 s2_74;
	ptr32 mstatus_95;
	word32 s0_97;
	struct Eq_118819 * s2_99;
	word32 t1_272;
	word32 a0_273;
	word32 a1_274;
	word32 a2_275;
	word32 a3_276;
	word32 a4_277;
	word32 a5_278;
	word32 s0_279;
	word32 a0_280;
	word32 a1_281;
	word32 a2_282;
	word32 a3_283;
	word32 a4_284;
	word32 a5_285;
	word32 a7_286;
	word32 s3_287;
	word32 s4_288;
	word32 s5_289;
	word32 s6_290;
	word32 s7_291;
	word32 s8_292;
	word32 s9_293;
	word32 s10_294;
	word32 s11_295;
	word32 a0_296;
	Eq_2 ra_96 = wifi_mgmr_ap_enable(snprintf(memset(ra_25, fp + -48, 0x00, 32, out t1_272, out a0_273, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278), fp + -48, 32, &g_t230B3504, s2, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_279, out s1_71, out a0_280, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a7_286, out s2_74, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295), s1_71, s2_74, mstatus, dwLoc3C, dwLoc08, dwArg08, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArg0128, out s0_97, out a0_296, out s2_99, out mstatus_95);
	if (s0_97 == 0x01)
	{
		a4_134.u0 = 0x01;
		a3_137.u0 = 0x00;
	}
	else
	{
		word32 a1_297;
		word32 a2_298;
		word32 a3_299;
		word32 a4_300;
		word32 a5_301;
		Eq_2 a0_117 = atoi(s2_99->t0004, out a1_297, out a2_298, out a3_299, out a4_300, out a5_301);
		a4_134 = a0_117;
		if (a0_117 > ~0x0A)
			return;
		a3_137.u0 = 587937052;
	}
	wifi_mgmr_ap_start(ra_96, fp + -48, a3_137, a4_134, mstatus_95, dwLoc40, dwLoc3C, dwLoc18, dwArg18, dwArg38, s1, dwArg78);
}

// 23027256: void wifi_sniffer_off_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void wifi_sniffer_off_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	wifi_mgmr_sniffer_disable(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
	wifi_mgmr_sniffer_unregister();
}

