pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23027268: void wifi_sniffer_on_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void wifi_sniffer_on_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	wifi_mgmr_sniffer_enable(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128);
	wifi_mgmr_sniffer_register(0x00, &g_t23027450);
}

// 23027282: void wifi_denoise_disable_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void wifi_denoise_disable_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_api_denoise_disable(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 23027286: void wifi_denoise_enable_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void wifi_denoise_enable_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	word32 mstatus_48;
	wifi_mgmr_api_denoise_enable(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out mstatus_48);
}

// 2302728A: void wifi_power_saving_off_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_power_saving_off_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_sta_powersaving(ra, 0x00, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027290: void wifi_power_saving_on_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_power_saving_on_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_sta_powersaving(ra, 0x02, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027296: void wifi_rc_fixed_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void wifi_rc_fixed_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_rate_config(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 2302729E: void wifi_disable_autoreconnect_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_disable_autoreconnect_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 s1_48;
	word32 s2_49;
	word32 s3_50;
	word32 s4_51;
	word32 s5_52;
	word32 s6_53;
	word32 mstatus_54;
	wifi_mgmr_sta_autoconnect_disable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_48, out s2_49, out s3_50, out s4_51, out s5_52, out s6_53, out mstatus_54);
}

// 230272A2: void wifi_enable_autoreconnect_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_enable_autoreconnect_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 s1_48;
	word32 s2_49;
	word32 s3_50;
	word32 s4_51;
	word32 s5_52;
	word32 s6_53;
	word32 mstatus_54;
	wifi_mgmr_sta_autoconnect_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_48, out s2_49, out s3_50, out s4_51, out s5_52, out s6_53, out mstatus_54);
}

// 230272A6: void wifi_disconnect_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168)
void wifi_disconnect_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168)
{
	Eq_2 a2_10;
	Eq_2 a3_11;
	Eq_2 a4_12;
	Eq_2 a5_13;
	ptr32 mstatus_16;
	Eq_2 ra_17 = wifi_mgmr_sta_disconnect(ra, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a2_10, out a3_11, out a4_12, out a5_13, out mstatus_16);
	Eq_2 s4_48;
	word32 s1_113;
	word32 a0_114;
	word32 a1_115;
	word32 a2_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 s2_120;
	word32 s3_121;
	vTaskDelay(1000, a2_10, a3_11, a4_12, a5_13, mstatus_16, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_113, out a0_114, out a1_115, out a2_116, out a3_117, out a4_118, out a5_119, out s2_120, out s3_121, out s4_48);
	word32 s4_122;
	word32 mstatus_123;
	wifi_mgmr_sta_disable(ra_17, s4_48, mstatus_16, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s4_122, out mstatus_123);
}

// 230272C0: void wifi_sta_ip_unset_cmd(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack (ptr32 Eq_119431) dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void wifi_sta_ip_unset_cmd(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, struct Eq_119431 * dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	wifi_mgmr_sta_ip_unset(ra, mstatus, dwArg10, dwArg14, dwArg38, dwArg44, dwArg60, dwArg88, dwArg94, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
}

// 230272C4: void wifi_sta_ip_info(Register Eq_2 ra, Register (ptr32 Eq_665) a4, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C)
void wifi_sta_ip_info(Eq_2 ra, struct Eq_665 * a4, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg5C)
{
	int8 bLoc36_411 = SLICE(dwLoc38, int8, 16);
	wifi_mgmr_sta_ip_get(fp + -80, fp + -76, fp + -72, a4);
	wifi_mgmr_sta_dns_get(fp + -0x0044, fp + -64);
	wifi_mgmr_rssi_get(fp + -60);
	word32 s1_434;
	word32 a0_435;
	word32 a1_436;
	word32 a2_437;
	word32 a3_438;
	word32 a4_439;
	word32 a5_440;
	word32 a7_441;
	word32 s2_442;
	word32 s3_443;
	word32 s4_444;
	word32 s5_445;
	word32 s6_446;
	word32 s7_447;
	word32 s8_448;
	word32 s9_449;
	word32 s10_450;
	word32 s11_451;
	word32 t4_452;
	Eq_2 ra_50 = printf(ra, &g_t230B47D0, bl_tpc_power_table_get(fp + -56), dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_434, out a0_435, out a1_436, out a2_437, out a3_438, out a4_439, out a5_440, out a7_441, out s2_442, out s3_443, out s4_444, out s5_445, out s6_446, out s7_447, out s8_448, out s9_449, out s10_450, out s11_451, out t4_452);
	Eq_2 a3_68;
	word32 a2_453;
	word32 a4_454;
	word32 a5_455;
	ip4addr_ntoa(out a2_453, out a3_68, out a4_454, out a5_455);
	word32 s1_456;
	word32 a0_457;
	word32 a1_458;
	word32 a2_459;
	word32 a3_460;
	word32 a4_461;
	word32 a5_462;
	word32 a7_463;
	word32 s2_464;
	word32 s3_465;
	word32 s4_466;
	word32 s5_467;
	word32 s6_468;
	word32 s7_469;
	word32 s8_470;
	word32 s9_471;
	word32 s10_472;
	word32 s11_473;
	word32 t4_474;
	Eq_2 ra_91 = printf(ra_50, &g_t230B47E0, a3_68, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_456, out a0_457, out a1_458, out a2_459, out a3_460, out a4_461, out a5_462, out a7_463, out s2_464, out s3_465, out s4_466, out s5_467, out s6_468, out s7_469, out s8_470, out s9_471, out s10_472, out s11_473, out t4_474);
	Eq_2 a3_109;
	word32 a2_475;
	word32 a4_476;
	word32 a5_477;
	ip4addr_ntoa(out a2_475, out a3_109, out a4_476, out a5_477);
	word32 s1_478;
	word32 a0_479;
	word32 a1_480;
	word32 a2_481;
	word32 a3_482;
	word32 a4_483;
	word32 a5_484;
	word32 a7_485;
	word32 s2_486;
	word32 s3_487;
	word32 s4_488;
	word32 s5_489;
	word32 s6_490;
	word32 s7_491;
	word32 s8_492;
	word32 s9_493;
	word32 s10_494;
	word32 s11_495;
	word32 t4_496;
	Eq_2 ra_132 = printf(ra_91, &g_t230B47F0, a3_109, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_478, out a0_479, out a1_480, out a2_481, out a3_482, out a4_483, out a5_484, out a7_485, out s2_486, out s3_487, out s4_488, out s5_489, out s6_490, out s7_491, out s8_492, out s9_493, out s10_494, out s11_495, out t4_496);
	Eq_2 a3_150;
	word32 a2_497;
	word32 a4_498;
	word32 a5_499;
	ip4addr_ntoa(out a2_497, out a3_150, out a4_498, out a5_499);
	word32 s1_500;
	word32 a0_501;
	word32 a1_502;
	word32 a2_503;
	word32 a3_504;
	word32 a4_505;
	word32 a5_506;
	word32 a7_507;
	word32 s2_508;
	word32 s3_509;
	word32 s4_510;
	word32 s5_511;
	word32 s6_512;
	word32 s7_513;
	word32 s8_514;
	word32 s9_515;
	word32 s10_516;
	word32 s11_517;
	word32 t4_518;
	Eq_2 ra_173 = printf(ra_132, &g_t230B4800, a3_150, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_500, out a0_501, out a1_502, out a2_503, out a3_504, out a4_505, out a5_506, out a7_507, out s2_508, out s3_509, out s4_510, out s5_511, out s6_512, out s7_513, out s8_514, out s9_515, out s10_516, out s11_517, out t4_518);
	Eq_2 a3_191;
	word32 a2_519;
	word32 a4_520;
	word32 a5_521;
	ip4addr_ntoa(out a2_519, out a3_191, out a4_520, out a5_521);
	word32 s1_522;
	word32 a0_523;
	word32 a1_524;
	word32 a2_525;
	word32 a3_526;
	word32 a4_527;
	word32 a5_528;
	word32 a7_529;
	word32 s2_530;
	word32 s3_531;
	word32 s4_532;
	word32 s5_533;
	word32 s6_534;
	word32 s7_535;
	word32 s8_536;
	word32 s9_537;
	word32 s10_538;
	word32 s11_539;
	word32 t4_540;
	Eq_2 ra_214 = printf(ra_173, &g_t230B4810, a3_191, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_522, out a0_523, out a1_524, out a2_525, out a3_526, out a4_527, out a5_528, out a7_529, out s2_530, out s3_531, out s4_532, out s5_533, out s6_534, out s7_535, out s8_536, out s9_537, out s10_538, out s11_539, out t4_540);
	Eq_2 a3_232;
	word32 a2_541;
	word32 a4_542;
	word32 a5_543;
	ip4addr_ntoa(out a2_541, out a3_232, out a4_542, out a5_543);
	word32 s1_544;
	word32 a0_545;
	word32 a1_546;
	word32 a2_547;
	word32 a3_548;
	word32 a4_549;
	word32 a5_550;
	word32 a7_551;
	word32 s2_552;
	word32 s3_553;
	word32 s4_554;
	word32 s5_555;
	word32 s6_556;
	word32 s7_557;
	word32 s8_558;
	word32 s9_559;
	word32 s10_560;
	word32 s11_561;
	word32 t4_562;
	Eq_2 ra_255 = printf(ra_214, &g_t230B4820, a3_232, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_544, out a0_545, out a1_546, out a2_547, out a3_548, out a4_549, out a5_550, out a7_551, out s2_552, out s3_553, out s4_554, out s5_555, out s6_556, out s7_557, out s8_558, out s9_559, out s10_560, out s11_561, out t4_562);
	word32 a0_563;
	word32 a1_564;
	word32 a2_565;
	word32 a4_566;
	word32 a5_567;
	word32 s4_568;
	word32 s8_569;
	puts(0x230B4830, out a0_563, out a1_564, out a2_565, out a4_566, out a5_567, out s4_568, out s8_569);
	word32 a0_570;
	word32 a1_571;
	word32 a2_572;
	word32 a4_573;
	word32 a5_574;
	word32 s4_575;
	word32 s8_576;
	puts(0x230B4430, out a0_570, out a1_571, out a2_572, out a4_573, out a5_574, out s4_575, out s8_576);
	word32 s1_577;
	word32 a0_578;
	word32 a1_579;
	word32 a2_580;
	word32 a3_581;
	word32 a4_582;
	word32 a5_583;
	word32 a7_584;
	word32 s2_585;
	word32 s3_586;
	word32 s4_587;
	word32 s5_588;
	word32 s6_589;
	word32 s7_590;
	word32 s8_591;
	word32 s9_592;
	word32 s10_593;
	word32 s11_594;
	word32 t4_595;
	word32 s1_596;
	word32 a0_597;
	word32 a1_598;
	word32 a2_599;
	word32 a3_600;
	word32 a4_601;
	word32 a5_602;
	word32 a7_603;
	word32 s2_604;
	word32 s3_605;
	word32 s4_606;
	word32 s5_607;
	word32 s6_608;
	word32 s7_609;
	word32 s8_610;
	word32 s9_611;
	word32 s10_612;
	word32 s11_613;
	word32 t4_614;
	word32 s1_615;
	word32 a0_616;
	word32 a1_617;
	word32 a2_618;
	word32 a3_619;
	word32 a4_620;
	word32 a5_621;
	word32 a7_622;
	word32 s2_623;
	word32 s3_624;
	word32 s4_625;
	word32 s5_626;
	word32 s6_627;
	word32 s7_628;
	word32 s8_629;
	word32 s9_630;
	word32 s10_631;
	word32 s11_632;
	word32 t4_633;
	printf(printf(printf(ra_255, &g_t230B4848, (int32) bLoc36_411, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_577, out a0_578, out a1_579, out a2_580, out a3_581, out a4_582, out a5_583, out a7_584, out s2_585, out s3_586, out s4_587, out s5_588, out s6_589, out s7_590, out s8_591, out s9_592, out s10_593, out s11_594, out t4_595), &g_t230B4888, (int32) bLoc2E, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_596, out a0_597, out a1_598, out a2_599, out a3_600, out a4_601, out a5_602, out a7_603, out s2_604, out s3_605, out s4_606, out s5_607, out s6_608, out s7_609, out s8_610, out s9_611, out s10_612, out s11_613, out t4_614), &g_t230B48E4, (int32) bLoc26, dwLoc58, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_615, out a0_616, out a1_617, out a2_618, out a3_619, out a4_620, out a5_621, out a7_622, out s2_623, out s3_624, out s4_625, out s5_626, out s6_627, out s7_628, out s8_629, out s9_630, out s10_631, out s11_632, out t4_633);
	word32 a0_634;
	word32 a1_635;
	word32 a2_636;
	word32 a4_637;
	word32 a5_638;
	word32 s4_639;
	word32 s8_640;
	puts(0x230B4430, out a0_634, out a1_635, out a2_636, out a4_637, out a5_638, out s4_639, out s8_640);
}

// 230273FA: void cmd_wifi_raw_send(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_119974) a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg54, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void cmd_wifi_raw_send(Eq_2 ra, Eq_2 s1, struct Eq_119974 * a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg54, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a0_52;
	word32 a5_8 = a4->dw0000;
	g_b4200D49E = (byte) (a4 << 0x04);
	g_b4200D49F = (byte) (a4 << 0x04 >> 8);
	a4->dw0001 = a5_8;
	if (wifi_mgmr_raw_80211_send(ra, s1, 0x18, s4, mstatus, dwLoc08, dwArg20, dwArg24, dwArg54, dwArg6C, dwArg70, ra, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128) != 0x00)
		a0_52.u0 = 0x230B3620;
	else
		a0_52.u0 = 0x230B3634;
	word32 s8_109;
	word32 s4_108;
	word32 a5_107;
	word32 a4_106;
	word32 a2_105;
	word32 a1_104;
	word32 a0_103;
	puts(a0_52, out a0_103, out a1_104, out a2_105, out a4_106, out a5_107, out s4_108, out s8_109);
}

// 23027448: void wifi_scan_cmd(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_scan_cmd(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_scan(ra, 0x00, null, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027450: void sniffer_cb(Register (ptr32 Eq_120087) a4)
void sniffer_cb(struct Eq_120087 * a4)
{
	a4->dw0001 = a4->dw0000;
	word32 * a5_16;
	Eq_2 a0_15 = xTaskGetTickCount(out a5_16);
	word32 s0_17 = *a5_16;
	if (a0_15 - a5_16 > 0x02000710)
	{
		word32 a5_37;
		*xTaskGetTickCount(out a5_37) = s0_17;
	}
}

// 2302748C: void cmd_wifi_dump(Register Eq_2 ra, Register int32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack word32 dwArg0108)
void cmd_wifi_dump(Eq_2 ra, int32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, word32 dwArg0108)
{
	Eq_2 a4_22;
	word32 a0_23;
	if (a2 > 0x01)
	{
		Eq_2 a4_31;
		word32 a0_97;
		word32 a1_98;
		word32 a2_99;
		word32 a5_100;
		word32 s4_101;
		word32 s8_102;
		puts(0x230B35D0, out a0_97, out a1_98, out a2_99, out a4_31, out a5_100, out s4_101, out s8_102);
		word32 a5_103;
		a4_22 = vTaskEnterCritical(a4_31, mstatus, out a5_103);
		a0_23 = 0x01;
	}
	else
	{
		Eq_2 a4_15;
		word32 s4_94;
		word32 s8_95;
		word32 a5_93;
		word32 a2_92;
		word32 a1_91;
		word32 a0_90;
		puts(587937272, out a0_90, out a1_91, out a2_92, out a4_15, out a5_93, out s4_94, out s8_95);
		word32 a5_96;
		a4_22 = vTaskEnterCritical(a4_15, mstatus, out a5_96);
		a0_23 = 0x00;
	}
	Eq_2 a3_52 = bl60x_fw_dump_statistic(ra, a0_23, a3, a4_22, mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108);
	word32 a4_104;
	word32 a5_105;
	vTaskExitCritical(a3_52, mstatus, out a4_104, out a5_105);
}

// 230274C8: void cmd_wifi_ap_conf_max_sta(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void cmd_wifi_ap_conf_max_sta(Eq_2 ra, Eq_2 a0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a2 == 0x02)
	{
		Eq_2 a3_16;
		word32 a1_176;
		word32 a2_177;
		word32 a4_178;
		word32 a5_179;
		atoi(a0, out a1_176, out a2_177, out a3_16, out a4_178, out a5_179);
		Eq_2 s4_46;
		word32 s1_180;
		word32 a0_181;
		word32 a1_182;
		word32 a2_183;
		word32 a3_184;
		word32 a4_185;
		word32 a5_186;
		word32 a7_187;
		word32 s2_188;
		word32 s3_189;
		word32 s5_190;
		word32 s6_191;
		word32 s7_192;
		word32 s8_193;
		word32 s9_194;
		word32 s10_195;
		word32 s11_196;
		word32 t4_197;
		Eq_2 ra_40 = printf(ra, &g_t230B34EC, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_46, out s5_190, out s6_191, out s7_192, out s8_193, out s9_194, out s10_195, out s11_196, out t4_197);
		wifi_mgmr_conf_max_sta(ra_40, s4_46, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, ra, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
	}
	else
	{
		word32 s1_198;
		word32 a0_199;
		word32 a1_200;
		word32 a2_201;
		word32 a3_202;
		word32 a4_203;
		word32 a5_204;
		word32 a7_205;
		word32 s2_206;
		word32 s3_207;
		word32 s4_208;
		word32 s5_209;
		word32 s6_210;
		word32 s7_211;
		word32 s8_212;
		word32 s9_213;
		word32 s10_214;
		word32 s11_215;
		word32 t4_216;
		printf(ra, &g_t230B34CC, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_198, out a0_199, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a7_205, out s2_206, out s3_207, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216);
	}
}

