pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23027504: void wifi_mon_cmd(Register Eq_2 ra, Register int32 a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void wifi_mon_cmd(Eq_2 ra, int32 a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a2 <= 0x01)
		wifi_mgmr_sniffer_register(0x00, &g_t23027450);
	else
		wifi_mgmr_sniffer_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 2302751C: void wifi_rc_fixed_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void wifi_rc_fixed_enable(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	if (a2 == 0x04)
	{
		word32 a5_347;
		word32 a4_346;
		word32 a3_345;
		word32 a2_344;
		word32 a1_343;
		Eq_2 a0_23 = atoi(a0, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347);
		word32 a2_354;
		word32 a3_355;
		word32 a1_353;
		word32 a5_352;
		word32 a4_351;
		word32 a3_350;
		word32 a2_349;
		word32 a1_348;
		word32 a4_356;
		word32 a5_357;
		Eq_2 a0_59 = atoi(atoi(a0_23, out a1_348, out a2_349, out a3_350, out a4_351, out a5_352), out a1_353, out a2_354, out a3_355, out a4_356, out a5_357);
		Eq_2 a3_94;
		word32 s1_98;
		word32 s2_101;
		word32 s3_102;
		word32 s4_103;
		word32 a0_377;
		word32 a1_378;
		word32 a2_379;
		word32 a4_380;
		word32 a5_381;
		word32 a7_382;
		word32 s5_383;
		word32 s6_384;
		word32 s7_385;
		word32 s8_386;
		word32 s9_387;
		word32 s10_388;
		word32 s11_389;
		word32 t4_390;
		Eq_2 ra_97 = printf(ra, &g_t230B4488, a0_59 & 0x00FF, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_98, out a0_377, out a1_378, out a2_379, out a3_94, out a4_380, out a5_381, out a7_382, out s2_101, out s3_102, out s4_103, out s5_383, out s6_384, out s7_385, out s8_386, out s9_387, out s10_388, out s11_389, out t4_390);
		word32 s1_391;
		word32 a0_392;
		word32 a1_393;
		word32 a2_394;
		word32 a3_395;
		word32 a4_396;
		word32 a5_397;
		word32 a7_398;
		word32 s2_399;
		word32 s3_400;
		word32 s4_401;
		word32 s5_402;
		word32 s6_403;
		word32 s7_404;
		word32 s8_405;
		word32 s9_406;
		word32 s10_407;
		word32 s11_408;
		word32 t4_409;
		Eq_2 ra_141 = printf(ra_97, &g_t230B44AC, a3_94, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_391, out a0_392, out a1_393, out a2_394, out a3_395, out a4_396, out a5_397, out a7_398, out s2_399, out s3_400, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out t4_409);
		wifi_mgmr_rate_config(ra_141, dwArg04, mstatus, dwArg18, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
	}
	else
	{
		word32 s1_358;
		word32 a0_359;
		word32 a1_360;
		word32 a2_361;
		word32 a3_362;
		word32 a4_363;
		word32 a5_364;
		word32 a7_365;
		word32 s2_366;
		word32 s3_367;
		word32 s4_368;
		word32 s5_369;
		word32 s6_370;
		word32 s7_371;
		word32 s8_372;
		word32 s9_373;
		word32 s10_374;
		word32 s11_375;
		word32 t4_376;
		printf(ra, &g_t230B4468, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_358, out a0_359, out a1_360, out a2_361, out a3_362, out a4_363, out a5_364, out a7_365, out s2_366, out s3_367, out s4_368, out s5_369, out s6_370, out s7_371, out s8_372, out s9_373, out s10_374, out s11_375, out t4_376);
	}
}

// 230275E6: void wifi_connect_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register (ptr32 Eq_2) a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack word32 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158)
void wifi_connect_cmd(Eq_2 ra, Eq_2 s0, Eq_2 s1, union Eq_2 * a1, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, word32 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0158)
{
	if (a2 == 0x03)
	{
		Eq_2 a1_16;
		ptr32 mstatus_23;
		Eq_2 s2_29;
		word32 a0_178;
		word32 s3_179;
		Eq_2 ra_24 = wifi_mgmr_sta_enable(ra, s1, a3, s2, mstatus, s0, dwLoc08, dwArg28, dwArg38, dwArg40, dwArg44, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0158, out a0_178, out a1_16, out s2_29, out s3_179, out mstatus_23);
		word32 s0_199;
		word32 s3_200;
		word32 mstatus_201;
		wifi_mgmr_sta_connect(ra_24, a1_16, dwArg10, 0x00, s2_29, mstatus_23, dwArg18, dwArg38, dwArg58, dwArg78, dwArg84, dwArgC4, out s0_199, out s3_200, out mstatus_201);
	}
	else
	{
		Eq_2 a3_86 = *a1;
		word32 s1_180;
		word32 a0_181;
		word32 a1_182;
		word32 a2_183;
		word32 a3_184;
		word32 a4_185;
		word32 a5_186;
		word32 a7_187;
		word32 s2_188;
		word32 s3_189;
		word32 s4_190;
		word32 s5_191;
		word32 s6_192;
		word32 s7_193;
		word32 s8_194;
		word32 s9_195;
		word32 s10_196;
		word32 s11_197;
		word32 t4_198;
		printf(ra, &g_t230B4244, a3_86, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
	}
}

// 2302761A: void wifi_sta_ip_set_cmd(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register (ptr32 Eq_119431) s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8)
void wifi_sta_ip_set_cmd(Eq_2 ra, Eq_2 a0, word32 a2, struct Eq_119431 * s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8)
{
	if (a2 != 0x06)
	{
		word32 a0_639;
		word32 a1_640;
		word32 a2_641;
		word32 a4_642;
		word32 a5_643;
		word32 s4_644;
		word32 s8_645;
		puts(0x230B4914, out a0_639, out a1_640, out a2_641, out a4_642, out a5_643, out s4_644, out s8_645);
	}
	else
	{
		Eq_2 a0_23;
		word32 a3_505;
		word32 s4_506;
		word32 s8_507;
		ipaddr_addr(a0, out a0_23, out a3_505, out s4_506, out s8_507);
		Eq_2 a0_43;
		word32 a3_508;
		word32 s4_509;
		word32 s8_510;
		ipaddr_addr(a0_23, out a0_43, out a3_508, out s4_509, out s8_510);
		Eq_2 a0_63;
		word32 a3_511;
		word32 s4_512;
		word32 s8_513;
		ipaddr_addr(a0_43, out a0_63, out a3_511, out s4_512, out s8_513);
		Eq_2 a0_83;
		word32 a3_514;
		word32 s4_515;
		word32 s8_516;
		ipaddr_addr(a0_63, out a0_83, out a3_514, out s4_515, out s8_516);
		Eq_2 a0_104;
		word32 a3_517;
		word32 s4_518;
		word32 s8_519;
		Eq_2 s0_112 = ipaddr_addr(a0_83, out a0_104, out a3_517, out s4_518, out s8_519);
		word32 a3_520;
		word32 a4_521;
		word32 a5_522;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_520, out a4_521, out a5_522);
		word32 a0_523;
		word32 a1_524;
		word32 a2_525;
		word32 a4_526;
		word32 a5_527;
		word32 s4_528;
		word32 s8_529;
		puts(587942188, out a0_523, out a1_524, out a2_525, out a4_526, out a5_527, out s4_528, out s8_529);
		word32 a0_530;
		word32 a1_531;
		word32 a2_532;
		word32 a4_533;
		word32 a5_534;
		word32 s4_535;
		word32 s8_536;
		puts(fp + -52, out a0_530, out a1_531, out a2_532, out a4_533, out a5_534, out s4_535, out s8_536);
		word32 a0_537;
		word32 a1_538;
		word32 a2_539;
		word32 a4_540;
		word32 a5_541;
		word32 s4_542;
		word32 s8_543;
		puts((word32) s0_112 - 0x0700, out a0_537, out a1_538, out a2_539, out a4_540, out a5_541, out s4_542, out s8_543);
		word32 a3_544;
		word32 a4_545;
		word32 a5_546;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_544, out a4_545, out a5_546);
		word32 a0_547;
		word32 a1_548;
		word32 a2_549;
		word32 a4_550;
		word32 a5_551;
		word32 s4_552;
		word32 s8_553;
		puts(0x230B4934, out a0_547, out a1_548, out a2_549, out a4_550, out a5_551, out s4_552, out s8_553);
		word32 a0_554;
		word32 a1_555;
		word32 a2_556;
		word32 a4_557;
		word32 a5_558;
		word32 s4_559;
		word32 s8_560;
		puts(fp + -52, out a0_554, out a1_555, out a2_556, out a4_557, out a5_558, out s4_559, out s8_560);
		word32 a0_561;
		word32 a1_562;
		word32 a2_563;
		word32 a4_564;
		word32 a5_565;
		word32 s4_566;
		word32 s8_567;
		puts((word32) s0_112 - 0x0700, out a0_561, out a1_562, out a2_563, out a4_564, out a5_565, out s4_566, out s8_567);
		word32 a3_568;
		word32 a4_569;
		word32 a5_570;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_568, out a4_569, out a5_570);
		word32 a0_571;
		word32 a1_572;
		word32 a2_573;
		word32 a4_574;
		word32 a5_575;
		word32 s4_576;
		word32 s8_577;
		puts(0x230B493C, out a0_571, out a1_572, out a2_573, out a4_574, out a5_575, out s4_576, out s8_577);
		word32 a0_578;
		word32 a1_579;
		word32 a2_580;
		word32 a4_581;
		word32 a5_582;
		word32 s4_583;
		word32 s8_584;
		puts(fp + -52, out a0_578, out a1_579, out a2_580, out a4_581, out a5_582, out s4_583, out s8_584);
		word32 a0_585;
		word32 a1_586;
		word32 a2_587;
		word32 a4_588;
		word32 a5_589;
		word32 s4_590;
		word32 s8_591;
		puts((word32) s0_112 - 0x0700, out a0_585, out a1_586, out a2_587, out a4_588, out a5_589, out s4_590, out s8_591);
		word32 a3_592;
		word32 a4_593;
		word32 a5_594;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_592, out a4_593, out a5_594);
		word32 a0_595;
		word32 a1_596;
		word32 a2_597;
		word32 a4_598;
		word32 a5_599;
		word32 s4_600;
		word32 s8_601;
		puts(0x230B4944, out a0_595, out a1_596, out a2_597, out a4_598, out a5_599, out s4_600, out s8_601);
		word32 a0_602;
		word32 a1_603;
		word32 a2_604;
		word32 a4_605;
		word32 a5_606;
		word32 s4_607;
		word32 s8_608;
		puts(fp + -52, out a0_602, out a1_603, out a2_604, out a4_605, out a5_606, out s4_607, out s8_608);
		word32 a0_609;
		word32 a1_610;
		word32 a2_611;
		word32 a4_612;
		word32 a5_613;
		word32 s4_614;
		word32 s8_615;
		puts((word32) s0_112 - 0x0700, out a0_609, out a1_610, out a2_611, out a4_612, out a5_613, out s4_614, out s8_615);
		word32 a3_616;
		word32 a4_617;
		word32 a5_618;
		ip4addr_ntoa_r(fp + -52, 0x14, out a3_616, out a4_617, out a5_618);
		word32 a0_619;
		word32 a1_620;
		word32 a2_621;
		word32 a4_622;
		word32 a5_623;
		word32 s4_624;
		word32 s8_625;
		puts(587942220, out a0_619, out a1_620, out a2_621, out a4_622, out a5_623, out s4_624, out s8_625);
		word32 a0_626;
		word32 a1_627;
		word32 a2_628;
		word32 a4_629;
		word32 a5_630;
		word32 s4_631;
		word32 s8_632;
		puts(fp + -52, out a0_626, out a1_627, out a2_628, out a4_629, out a5_630, out s4_631, out s8_632);
		Eq_2 s4_375;
		word32 a0_633;
		word32 a1_634;
		word32 a2_635;
		word32 a4_636;
		word32 a5_637;
		word32 s8_638;
		wifi_mgmr_sta_ip_set(ra, puts((word32) s0_112 - 0x0700, out a0_633, out a1_634, out a2_635, out a4_636, out a5_637, out s4_375, out s8_638), a0_43, s4_375, a0_104, mstatus, dwLoc30, s4, dwLoc08, dwArg04, dwArg20, dwArg48, s3, dwArg78, dwArg98, dwArgB8, dwArgD8);
	}
}

// 23027748: void wifi_scan_filter_cmd(Register word32 a2, Register Eq_2 a4, Register ptr32 mstatus)
void wifi_scan_filter_cmd(word32 a2, Eq_2 a4, ptr32 mstatus)
{
	if (a2 != 0x02)
		return;
	Eq_2 a3_6 = *(union Eq_2 *) 0x06;
	word32 a0_9 = (word32) ((word32) *(union Eq_2 *) 0x02 < -50);
	wifi_mgmr_scan_filter_hidden_ssid(a0_9, a3_6, a4, mstatus);
}

// 23027762: void wifi_capcode_cmd(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register up32 a2, Register Eq_2 a3, Stack ui32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
void wifi_capcode_cmd(Eq_2 ra, Eq_2 a0, union Eq_2 * a1, up32 a2, Eq_2 a3, ui32 dwArg00, word32 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_81;
	if (a2 > ~0x01)
	{
		a3 = *a1;
		a0_81 = (struct Eq_274 *) &g_t230B41FC;
	}
	else
	{
		dwArg74 = ra;
		if (a2 != 0x01)
		{
			Eq_2 a3_16;
			word32 a1_199;
			word32 a2_200;
			word32 a4_201;
			word32 a5_202;
			Eq_2 a0_13 = atoi(a0, out a1_199, out a2_200, out a3_16, out a4_201, out a5_202);
			int32 s2_44;
			int32 s3_45;
			word32 s1_203;
			word32 a0_204;
			word32 a1_205;
			word32 a2_206;
			word32 a3_207;
			word32 a4_208;
			word32 a5_209;
			word32 a7_210;
			word32 s4_211;
			word32 s5_212;
			word32 s6_213;
			word32 s7_214;
			word32 s8_215;
			word32 s9_216;
			word32 s10_217;
			word32 s11_218;
			word32 t4_219;
			Eq_2 ra_40 = printf(ra, &g_t230B422C, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_203, out a0_204, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out a7_210, out s2_44, out s3_45, out s4_211, out s5_212, out s6_213, out s7_214, out s8_215, out s9_216, out s10_217, out s11_218, out t4_219);
			if (a0_13 <= 0x00)
				return;
			word32 s1_220;
			word32 a3_221;
			hal_sys_capcode_update(ra_40, a0_13 & 0x00FF, a0_13 & 0x00FF, s2_44, s3_45, dwArg00, dwArg04, dwArg28, dwArg48, out s1_220, out a3_221);
			return;
		}
		hal_sys_capcode_get();
		a0_81 = (struct Eq_274 *) &g_t230B4210;
	}
	word32 a2_183;
	word32 a1_182;
	word32 a0_181;
	word32 s1_180;
	word32 a3_184;
	word32 a4_185;
	word32 a5_186;
	word32 a7_187;
	word32 s2_188;
	word32 s3_189;
	word32 s4_190;
	word32 s5_191;
	word32 s6_192;
	word32 s7_193;
	word32 s8_194;
	word32 s9_195;
	word32 s10_196;
	word32 s11_197;
	word32 t4_198;
	printf(ra, a0_81, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
}

