pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230277CC: Register Eq_2 wifi_mgmr_cli_scanlist(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s10, Stack Eq_2 dwArg18, Stack Eq_2 dwArgB8, Register out ptr32 s1Out, Register out ptr32 a4Out)
// Called from:
//      wifi_mgmr_all_ap_scan
Eq_2 wifi_mgmr_cli_scanlist(Eq_2 ra, Eq_2 a3, Eq_2 s10, Eq_2 dwArg18, Eq_2 dwArgB8, ptr32 & s1Out, ptr32 & a4Out)
{
	Eq_2 s0_155 = 0x42023F3C;
	Eq_2 a3_38;
	word32 s2_72;
	word32 s11_390;
	word32 s10_389;
	word32 s9_388;
	word32 s8_387;
	word32 s5_384;
	word32 s2_381;
	word32 a4_378;
	word32 a0_375;
	word32 s11_407;
	word32 t4_408;
	word32 s8_404;
	word32 s9_405;
	word32 s10_406;
	word32 s5_401;
	word32 s6_402;
	word32 s7_403;
	word32 s4_400;
	word32 a5_397;
	word32 a7_398;
	word32 s3_399;
	word32 a1_394;
	word32 a2_395;
	word32 a4_396;
	word32 t4_391;
	word32 s1_392;
	word32 a0_393;
	word32 s6_385;
	word32 s7_386;
	word32 s3_382;
	word32 s4_383;
	word32 a5_379;
	word32 a7_380;
	word32 a1_376;
	word32 a2_377;
	word32 s1_374;
	Eq_2 a3_106;
	Eq_2 ra_104 = printf(printf(ra, &g_t230B42D4, a3, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_374, out a0_375, out a1_376, out a2_377, out a3_38, out a4_378, out a5_379, out a7_380, out s2_381, out s3_382, out s4_383, out s5_384, out s6_385, out s7_386, out s8_387, out s9_388, out s10_389, out s11_390, out t4_391), &g_t230B42E8, a3_38, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_392, out a0_393, out a1_394, out a2_395, out a3_106, out a4_396, out a5_397, out a7_398, out s2_72, out s3_399, out s4_400, out s5_401, out s6_402, out s7_403, out s8_404, out s9_405, out s10_406, out s11_407, out t4_408);
	word32 s4_101 = 0x230B4000;
	struct Eq_121348 * s2_122 = s2_72 + 0x42023F3C;
	word32 s5_125 = 0x230B4000;
	do
	{
		word32 s3_123;
		word32 s1_119;
		if ((word32) s0_155.u24->b02B0 != 0x00)
		{
			word32 a5_422;
			if (xTaskGetTickCount(out a5_422) - (s0_155.u24)->t02B4 >= s2_122->t07D0)
				goto l230278D6;
			Eq_2 a4_134 = (word32) s0_155.u24->b02A5;
			Eq_2 a3_133 = (word32) s0_155.u24->b02A4;
			Eq_2 a0_149 = wifi_mgmr_auth_to_str((word32) s0_155.u24->b02AE);
			wifi_mgmr_cipher_to_str((word32) s0_155.u24->b02AF);
			dwArg18 = a4_134;
			s0_155 = dwArgB8;
			dwLoc78 = a0_149;
			word32 t4_435;
			word32 s11_434;
			word32 s10_433;
			word32 s9_432;
			word32 s8_431;
			word32 s7_430;
			word32 s6_429;
			word32 a7_428;
			word32 a2_425;
			word32 a4_426;
			word32 a5_427;
			word32 a0_423;
			word32 a1_424;
			ra_104 = printf(ra_104, s5_125 + 848, a3_133, a0_149, s10, dwLoc10, dwLoc0C, a4_134, ra, out s1_119, out a0_423, out a1_424, out a2_425, out a3_106, out a4_426, out a5_427, out a7_428, out s2_122, out s3_123, out s4_101, out s5_125, out s6_429, out s7_430, out s8_431, out s9_432, out s10_433, out s11_434, out t4_435);
		}
		else
		{
l230278D6:
			word32 s10_419;
			word32 s11_420;
			word32 t4_421;
			word32 s7_416;
			word32 s8_417;
			word32 s9_418;
			word32 a5_413;
			word32 a7_414;
			word32 s6_415;
			word32 a1_410;
			word32 a2_411;
			word32 a4_412;
			word32 a0_409;
			ra_104 = printf(ra_104, s4_101 + 980, a3_106, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_119, out a0_409, out a1_410, out a2_411, out a3_106, out a4_412, out a5_413, out a7_414, out s2_122, out s3_123, out s4_101, out s5_125, out s6_415, out s7_416, out s8_417, out s9_418, out s10_419, out s11_420, out t4_421);
		}
		++s0_155.u24;
	} while (s1_119 + 0x01 != s3_123);
	ptr32 a4_211;
	word32 a0_437;
	word32 s1_436;
	word32 a1_438;
	word32 a2_439;
	word32 a3_440;
	word32 a5_441;
	word32 a7_442;
	word32 s2_443;
	word32 s3_444;
	word32 s4_445;
	word32 s5_446;
	word32 s6_447;
	word32 s7_448;
	word32 s8_449;
	word32 s9_450;
	word32 s10_451;
	word32 s11_452;
	word32 t4_453;
	printf(ra_104, &g_t230B43EC, a3_106, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18, ra, out s1_436, out a0_437, out a1_438, out a2_439, out a3_440, out a4_211, out a5_441, out a7_442, out s2_443, out s3_444, out s4_445, out s5_446, out s6_447, out s7_448, out s8_449, out s9_450, out s10_451, out s11_452, out t4_453);
	s1Out = dwArg0118;
	a4Out = a4_211;
	return dwArg0158;
}

// 230278E2: Register word32 wifi_mgmr_ext_dump_needed(Register (ptr32 Eq_106695) a4)
// Called from:
//      tcpip_stack_input
word32 wifi_mgmr_ext_dump_needed(struct Eq_106695 * a4)
{
	word32 a5_6 = a4->dw0000;
	word32 a0_10 = 0x00;
	if (a4 > null)
	{
		a4->dwFFFFFFFF = a5_6;
		a0_10 = 0x01;
	}
	return a0_10;
}

// 230278FA: void wifi_mgmr_cli_init()
// Called from:
//      aos_loop_proc
void wifi_mgmr_cli_init()
{
}

// 230278FE: Register (ptr32 byte) mac_is_unvalid(Register (ptr32 byte) a0)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
//      wifi_mgmr_ap_mac_get
byte * mac_is_unvalid(byte * a0)
{
	word32 a5_5 = (word32) *a0;
	int32 a4_15;
	for (a4_15 = 0x01; a4_15 != 0x06; ++a4_15)
	{
		if ((word32) a0[a4_15] != a5_5)
			return null;
	}
	return (word32) ((a5_5 + -1 & 0x00FF) < 0x00FE) ^ 1;
}

// 2302792E: void cb_scan_item_parse(Register (ptr32 Eq_121557) a0, Register (ptr32 (ptr32 Eq_121560)) a1, Register Eq_2 a2)
void cb_scan_item_parse(struct Eq_121557 * a0, struct Eq_121560 ** a1, Eq_2 a2)
{
	struct Eq_121560 * s2_15 = *a1;
	if (s2_15 <= (struct Eq_121560 *) 49)
	{
		word32 s0_26 = s2_15 + 52 + a0;
		*((word32) s0_26 + 46) = (byte) (word32) *((word32) a2 + 46);
		*((word32) s0_26 + 48) = (byte) (int32) *((word32) a2 + 48);
		word32 a1_119;
		word32 a2_120;
		word32 a3_121;
		word32 a4_122;
		word32 a5_123;
		word32 a6_124;
		word32 a7_125;
		memcpy(s0_26 + 40, a2 + 40, 0x06, out a1_119, out a2_120, out a3_121, out a4_122, out a5_123, out a6_124, out a7_125);
		word32 a1_126;
		word32 a2_127;
		word32 a3_128;
		word32 a4_129;
		word32 a5_130;
		word32 a6_131;
		word32 a7_132;
		memcpy(s0_26, a2, 32, out a1_126, out a2_127, out a3_128, out a4_129, out a5_130, out a6_131, out a7_132);
		((word32) s0_26 + 32)->u0 = 0x00;
		word32 a1_133;
		word32 a2_134;
		word32 a3_135;
		word32 a4_136;
		word32 a5_137;
		*((word32) strlen(s0_26, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137) + 36) = s0_26;
		*((word32) s0_26 + 47) = (byte) (word32) *((word32) a2 + 47);
		Mem72[a1 + 0x00:word32] = s2_15 + 0x01;
	}
}

// 230279A6: void cb_scan_complete(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void cb_scan_complete(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a4_19;
	word32 a3_121;
	word32 a2_120;
	word32 a1_119;
	word32 a0_118;
	word32 s1_117;
	word32 a5_122;
	word32 a7_123;
	word32 s2_124;
	word32 s3_125;
	word32 s4_126;
	word32 s5_127;
	word32 s6_128;
	word32 s7_129;
	word32 s8_130;
	word32 s9_131;
	word32 s10_132;
	word32 s11_133;
	word32 t4_134;
	printf(ra, &g_t230B49BC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_117, out a0_118, out a1_119, out a2_120, out a3_121, out a4_19, out a5_122, out a7_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s7_129, out s8_130, out s9_131, out s10_132, out s11_133, out t4_134);
	Eq_2 a0_36 = g_t42025710;
	if (a0_36 == 0x00)
		return;
	word32 s1_135;
	word32 a0_136;
	word32 a1_137;
	word32 a2_138;
	word32 a3_139;
	word32 a4_140;
	word32 a5_141;
	word32 a7_142;
	word32 s2_143;
	word32 s3_144;
	word32 s4_145;
	word32 s5_146;
	word32 s6_147;
	word32 s8_148;
	xQueueGenericSend(a0_36, 0x00, 0x00, a4_19, 0x42025000, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_135, out a0_136, out a1_137, out a2_138, out a3_139, out a4_140, out a5_141, out a7_142, out s2_143, out s3_144, out s4_145, out s5_146, out s6_147, out s8_148);
}

// 230279D8: Register Eq_2 wifi_mgmr_drv_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_start_background
Eq_2 wifi_mgmr_drv_init(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_20;
	Eq_2 s0_22;
	ptr32 mstatus_51;
	Eq_2 s4_84;
	ptr32 mstatus_98;
	ptr32 s1_100;
	ptr32 s3_104;
	Eq_2 ra_99 = wifi_mgmr_api_ifaceup(wifi_mgmr_init(wifi_mgmr_api_set_country_code(bl606a0_wifi_init(ra, a0, a3, mstatus, dwLoc10, s0, dwLoc08, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg2C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_22, out mstatus_20), s0_22, mstatus_20, dwLoc10, s0, dwArg08, dwArg18, dwArg20, dwArg24, dwArg2C, dwArg3C, dwArg48, dwArg6C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out mstatus_51), mstatus_51, dwArg0108, out s4_84), s4_84, mstatus_51, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_100, out s3_104, out mstatus_98);
	s1Out = s1_100;
	s3Out = s3_104;
	mstatusOut = mstatus_98;
	return ra_99;
}

// 230279FC: Register Eq_2 wifi_mgmr_sta_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      event_cb_wifi_event
//      wifi_connect_cmd
//      __wifimode_set
Eq_2 wifi_mgmr_sta_enable(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 a1_175;
	Eq_2 ra_180;
	ptr32 s2_182;
	ptr32 s3_183;
	Eq_2 a5_14 = *a3;
	if (a3 == 0x01)
	{
		word32 s1_369;
		word32 a0_370;
		word32 a2_371;
		word32 a3_372;
		word32 a4_373;
		word32 a5_374;
		word32 a7_375;
		word32 s4_376;
		word32 s5_377;
		word32 s6_378;
		word32 s7_379;
		word32 s8_380;
		word32 s9_381;
		word32 s10_382;
		word32 s11_383;
		word32 t4_384;
		ra_180 = printf(ra, &g_t230B4AAC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_369, out a0_370, out a1_175, out a2_371, out a3_372, out a4_373, out a5_374, out a7_375, out s2_182, out s3_183, out s4_376, out s5_377, out s6_378, out s7_379, out s8_380, out s9_381, out s10_382, out s11_383, out t4_384);
	}
	else
	{
		*(union Eq_2 *) 0x01 = a5_14;
		word32 s4_353;
		word32 s5_354;
		word32 s2_351;
		word32 s3_352;
		word32 a5_349;
		word32 a7_350;
		word32 a3_347;
		word32 a4_348;
		word32 a1_345;
		word32 a2_346;
		word32 s1_343;
		word32 a0_344;
		word32 s6_355;
		word32 s7_356;
		word32 s8_357;
		word32 s9_358;
		word32 s10_359;
		word32 s11_360;
		word32 t4_361;
		Eq_2 ra_28 = printf(ra, &g_t230B4AD8, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_343, out a0_344, out a1_345, out a2_346, out a3_347, out a4_348, out a5_349, out a7_350, out s2_351, out s3_352, out s4_353, out s5_354, out s6_355, out s7_356, out s8_357, out s9_358, out s10_359, out s11_360, out t4_361);
		g_dw42023F48 = 0x00;
		word32 a1_362;
		word32 a2_363;
		word32 a3_364;
		word32 a4_365;
		word32 a5_366;
		word32 a6_367;
		word32 a7_368;
		memcpy(0x42023FA2, 0x42023F4D, 0x06, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a6_367, out a7_368);
		if (mac_is_unvalid(&g_w42023FA2) != 0x00)
		{
			bl_wifi_mac_addr_get(0x42023FA2);
			if (mac_is_unvalid(&g_w42023FA2) != 0x00)
			{
				g_w42023FA2 = 0xC0;
				*(word32 *) 16828843 = 0x42023F3C;
			}
			word32 a1_385;
			word32 a2_386;
			word32 a3_387;
			word32 a4_388;
			word32 a5_389;
			word32 a6_390;
			word32 a7_391;
			memcpy(0x42023F4D, 0x42023FA2, 0x06, out a1_385, out a2_386, out a3_387, out a4_388, out a5_389, out a6_390, out a7_391);
		}
		word32 s1_148;
		Eq_2 s0_147 = netifapi_netif_add(ra_28, 0x42023F3C, fp + ~0x1B, fp + ~0x17, fp + ~0x13, 0x00, 0x23028D82, 0x42024000, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out s1_148);
		*((word32) s0_147 + 110) = 1139;
		*((word32) s0_147 + 0x006D) = (byte) ((word32) *((word32) s0_147 + 0x006D) | 36);
		netif_set_default(s1_148 + -0x0098);
		ra_180 = netif_set_up(ra_28, s0_147, s1_148 + -0x0098, mstatus, s2, dwLoc10, dwArg04, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out a1_175, out s2_182, out s3_183, out mstatus);
	}
	a0Out = 0x42023F48;
	a1Out = a1_175;
	s2Out = s2_182;
	s3Out = s3_183;
	mstatusOut = mstatus;
	return ra_180;
}

// 23027AFA: Register Eq_2 wifi_mgmr_sta_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_disconnect_cmd
//      cwqap
//      __wifimode_set
Eq_2 wifi_mgmr_sta_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & s4Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_16;
	ptr32 s4_23;
	Eq_2 ra_17 = wifi_mgmr_api_idle(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s4_23, out mstatus_16);
	s4Out = s4_23;
	mstatusOut = mstatus_16;
	return ra_17;
}

// 23027B0A: void wifi_mgmr_sta_ip_get(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2, Register (ptr32 Eq_665) a4)
// Called from:
//      wifiprov_wifi_state_get
//      wifi_sta_ip_info
//      cipsta_ip_get
//      cipsta_ip
//      cwjap_info
void wifi_mgmr_sta_ip_get(ptr32 a0, ptr32 a1, ptr32 a2, struct Eq_665 * a4)
{
	a4->ptr0000 = a0;
	struct Eq_122091 * a5_9 = a4->ptr0034;
	a4->ptr0000 = a2;
	*a5_9->ptr0038 = a1;
}

// 23027B22: void wifi_mgmr_sta_dns_get(Register ptr32 a0, Register ptr32 a1)
// Called from:
//      wifi_sta_ip_info
//      cipsta_ip_get
//      cipsta_ip
void wifi_mgmr_sta_dns_get(ptr32 a0, ptr32 a1)
{
	*dns_getserver(0x00) = a0;
	*dns_getserver(0x01) = a1;
}

