pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23027B4C: void wifi_mgmr_sta_ip_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack (ptr32 Eq_119431) dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      wifi_sta_ip_set_cmd
//      wifi_mgmr_sta_ip_unset
//      cipsta_ip
void wifi_mgmr_sta_ip_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, struct Eq_119431 * dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	word32 a5_86;
	Eq_2 a4_18 = vTaskEnterCritical(a4, mstatus, out a5_86);
	*((word32) a0 + 24) = 0x42023F3C;
	*((word32) a1 + 28) = 0x42023F3C;
	dwArg94->dw0020 = 0x42023F3C;
	((word32) a3 + 36)->u0 = 0x42023F3C;
	((word32) a4_18 + 40)->u0 = 0x42023F3C;
	word32 a4_87;
	word32 a5_88;
	vTaskExitCritical(a3, mstatus, out a4_87, out a5_88);
	word32 a1_89;
	word32 a3_90;
	word32 mstatus_91;
	wifi_mgmr_api_ip_update(ra, a4, mstatus, dwLoc18, dwArg10, dwArg14, dwArg38, dwArg44, a0, dwArg60, ra, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out a1_89, out a3_90, out mstatus_91);
}

// 23027B8A: void wifi_mgmr_sta_ip_unset(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack (ptr32 Eq_119431) dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
// Called from:
//      wifi_sta_ip_unset_cmd
void wifi_mgmr_sta_ip_unset(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg88, struct Eq_119431 * dwArg94, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	wifi_mgmr_sta_ip_set(ra, 0x00, 0x00, 0x00, 0x00, mstatus, dwArg10, dwArg14, dwArg38, dwArg44, dwArg60, dwArg88, dwArg94, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
}

// 23027B98: Register Eq_2 wifi_mgmr_sta_disconnect(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_disconnect_cmd
//      cwqap
//      __wifimode_set
Eq_2 wifi_mgmr_sta_disconnect(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	ptr32 mstatus_16;
	Eq_2 ra_17 = wifi_mgmr_api_disconnect(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a3_11, out a4_12, out a5_13, out mstatus_16);
	a2Out = dwArg10;
	a3Out = a3_11;
	a4Out = a4_12;
	a5Out = a5_13;
	mstatusOut = mstatus_16;
	return ra_17;
}

// 23027BA8: void wifi_mgmr_sta_powersaving(Register Eq_2 ra, Register word32 a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_power_saving_off_cmd
//      wifi_power_saving_on_cmd
void wifi_mgmr_sta_powersaving(Eq_2 ra, word32 a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a0 != 0x01 && a0 != 0x02)
	{
		if (a0 == 0x00)
			wifi_mgmr_api_fw_powersaving(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
	}
	else
		wifi_mgmr_api_fw_powersaving(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027BD8: Register Eq_2 wifi_mgmr_sta_autoconnect_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_enable_autoreconnect_cmd
//      at_key_value_set
//      cwjap_cur
Eq_2 wifi_mgmr_sta_autoconnect_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_16;
	ptr32 s1_18;
	ptr32 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	ptr32 s5_24;
	ptr32 s6_25;
	Eq_2 ra_17 = wifi_mgmr_api_enable_autoreconnect(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_18, out s2_21, out s3_22, out s4_23, out s5_24, out s6_25, out mstatus_16);
	s1Out = s1_18;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	s5Out = s5_24;
	s6Out = s6_25;
	mstatusOut = mstatus_16;
	return ra_17;
}

// 23027BE8: Register Eq_2 wifi_mgmr_sta_autoconnect_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_disable_autoreconnect_cmd
//      at_key_value_set
//      cwjap_cur
Eq_2 wifi_mgmr_sta_autoconnect_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_16;
	ptr32 s1_18;
	ptr32 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	ptr32 s5_24;
	ptr32 s6_25;
	Eq_2 ra_17 = wifi_mgmr_api_disable_autoreconnect(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_18, out s2_21, out s3_22, out s4_23, out s5_24, out s6_25, out mstatus_16);
	s1Out = s1_18;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	s5Out = s5_24;
	s6Out = s6_25;
	mstatusOut = mstatus_16;
	return ra_17;
}

// 23027BF8: Register Eq_2 wifi_mgmr_sta_connect_ind_stat_get(Register Eq_2 ra, Register (ptr32 Eq_696) a0, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      wifiprov_wifi_state_get
//      cwjap_info
Eq_2 wifi_mgmr_sta_connect_ind_stat_get(Eq_2 ra, struct Eq_696 * a0, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 a5_256;
	word32 a3_254;
	word32 a4_255;
	word32 a1_252;
	word32 a2_253;
	Eq_2 a0_20 = strlen(1107449487, out a1_252, out a2_253, out a3_254, out a4_255, out a5_256);
	if (a0_20 > 0x00)
	{
		word32 a7_268;
		word32 a5_266;
		word32 a6_267;
		word32 a3_264;
		word32 a4_265;
		word32 a1_262;
		word32 a2_263;
		memcpy(&a0->b0002 + 1, 1107449487, a0_20, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a6_267, out a7_268);
		Mem45[a0_20 + a0 + 3:byte] = 0x00;
	}
	word32 a4_260;
	word32 a5_261;
	word32 a2_258;
	word32 a3_259;
	word32 a1_257;
	Eq_2 a0_48 = strlen(1107449519, out a1_257, out a2_258, out a3_259, out a4_260, out a5_261);
	if (a0_48 > 0x00)
	{
		word32 a1_313;
		word32 a2_314;
		word32 a3_315;
		word32 a4_316;
		word32 a5_317;
		word32 a6_318;
		word32 a7_319;
		memcpy(&a0->b0002 + 33, 1107449519, a0_48, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out a6_318, out a7_319);
		Mem74[a0_48 + a0 + 35:byte] = 0x00;
	}
	Eq_2 a3_85;
	word32 a7_274;
	word32 a5_272;
	word32 a6_273;
	word32 a2_270;
	word32 a4_271;
	word32 a1_269;
	memcpy(&a0->b0002 + 0x00A2, 0x420256F0, 0x06, out a1_269, out a2_270, out a3_85, out a4_271, out a5_272, out a6_273, out a7_274);
	a0->w0000 = (word16) (word32) g_w4202568C;
	a0->b00AC = (byte) (word32) g_b420256F8;
	a0->w00AA = (word16) (word32) g_w420256F6;
	a0->b0002 = (byte) (word32) g_b4202568E;
	word32 a4_280;
	word32 a5_281;
	word32 a2_278;
	word32 a3_279;
	word32 a0_276;
	word32 a1_277;
	word32 s1_275;
	word32 a7_282;
	word32 s2_283;
	word32 s3_284;
	word32 s4_285;
	word32 s5_286;
	word32 s6_287;
	word32 s7_288;
	word32 s8_289;
	word32 s9_290;
	word32 s10_291;
	word32 s11_292;
	word32 t4_293;
	word32 s1_294;
	word32 a0_295;
	word32 a1_296;
	word32 a2_297;
	word32 a3_298;
	word32 a4_299;
	word32 a5_300;
	word32 a7_301;
	word32 s2_302;
	word32 s3_303;
	word32 s4_304;
	word32 s5_305;
	word32 s6_306;
	word32 s7_307;
	word32 s8_308;
	word32 s9_309;
	word32 s10_310;
	word32 s11_311;
	word32 t4_312;
	Eq_2 ra_148 = printf(printf(ra, &g_t230B4A2C, a3_85, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_275, out a0_276, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a7_282, out s2_283, out s3_284, out s4_285, out s5_286, out s6_287, out s7_288, out s8_289, out s9_290, out s10_291, out s11_292, out t4_293), &g_t230B4A50, (word32) a0->b00AC, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_294, out a0_295, out a1_296, out a2_297, out a3_298, out a4_299, out a5_300, out a7_301, out s2_302, out s3_303, out s4_304, out s5_305, out s6_306, out s7_307, out s8_308, out s9_309, out s10_310, out s11_311, out t4_312);
	Eq_2 a3_165 = (word32) a0->b00A6;
	ptr32 a3_182;
	ptr32 a4_183;
	word32 s1_320;
	word32 a0_321;
	word32 a1_322;
	word32 a2_323;
	word32 a5_324;
	word32 a7_325;
	word32 s2_326;
	word32 s3_327;
	word32 s4_328;
	word32 s5_329;
	word32 s6_330;
	word32 s7_331;
	word32 s8_332;
	word32 s9_333;
	word32 s10_334;
	word32 s11_335;
	word32 t4_336;
	Eq_2 ra_185 = printf(ra_148, &g_t230B4A88, a3_165, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_320, out a0_321, out a1_322, out a2_323, out a3_182, out a4_183, out a5_324, out a7_325, out s2_326, out s3_327, out s4_328, out s5_329, out s6_330, out s7_331, out s8_332, out s9_333, out s10_334, out s11_335, out t4_336);
	a3Out = a3_182;
	a4Out = a4_183;
	return ra_185;
}

