pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23027CEC: void wifi_mgmr_sta_ssid_set(Register Eq_2 a0)
// Called from:
//      wifi_mgmr_sta_connect
void wifi_mgmr_sta_ssid_set(Eq_2 a0)
{
	word32 a1_73;
	word32 a2_74;
	word32 a3_75;
	word32 a4_76;
	word32 a5_77;
	if (strlen(a0, out a1_73, out a2_74, out a3_75, out a4_76, out a5_77) == 0x00)
		return;
	word32 a1_78;
	word32 a2_79;
	word32 a3_80;
	word32 a4_81;
	word32 a5_82;
	Eq_2 a0_20 = strlen(a0, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82);
	word32 a1_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a6_88;
	word32 a7_89;
	memcpy(1107449487, a0, a0_20, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a6_88, out a7_89);
}

// 23027D1E: Register word32 wifi_mgmr_sta_psk_set(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      wifi_mgmr_sta_connect
word32 wifi_mgmr_sta_psk_set(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	word32 a1_75;
	word32 a2_76;
	if (strlen(a0, out a1_75, out a2_76, out a3_11, out a4_12, out a5_13) == 0x00)
	{
		a4Out = a4_12;
		a5Out = a5_13;
		return a3_11;
	}
	else
	{
		word32 a1_77;
		word32 a2_78;
		word32 a3_79;
		word32 a4_80;
		word32 a5_81;
		Eq_2 a0_20 = strlen(a0, out a1_77, out a2_78, out a3_79, out a4_80, out a5_81);
		ptr32 a4_33;
		ptr32 a5_34;
		word32 a3_38;
		word32 a1_82;
		word32 a2_83;
		word32 a6_84;
		word32 a7_85;
		memcpy(1107449519, a0, a0_20, out a1_82, out a2_83, out a3_38, out a4_33, out a5_34, out a6_84, out a7_85);
		a4Out = a4_33;
		a5Out = a5_34;
		return a3_38;
	}
}

// 23027D50: Register Eq_2 wifi_mgmr_sta_connect(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack word32 dwArgC4, Register out ptr32 s0Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      event_cb_wifi_event
//      wifi_connect_cmd
//      cwjap_cur
Eq_2 wifi_mgmr_sta_connect(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, word32 dwArgC4, ptr32 & s0Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	wifi_mgmr_sta_ssid_set(a1);
	Eq_2 a4_42;
	ptr32 a5_43;
	Eq_2 a3_41 = wifi_mgmr_sta_psk_set(a2, out a4_42, out a5_43);
	0x00 = dwArgC4;
	ptr32 mstatus_72;
	ptr32 s0_74;
	ptr32 s3_79;
	Eq_2 ra_73 = wifi_mgmr_api_connect(ra, dwArg84, a1, a2, a3, a3_41, a4_42, a5_43, s2, mstatus, dwArg18, dwArg38, dwArg58, dwArg78, out s0_74, out s3_79, out mstatus_72);
	s0Out = s0_74;
	s3Out = s3_79;
	mstatusOut = mstatus_72;
	return ra_73;
}

// 23027D88: Register Eq_2 wifi_mgmr_ap_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_wifi_ap_start
//      __wifimode_set
Eq_2 wifi_mgmr_ap_enable(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0168, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	*(word32 *) 0x7D = 0x42023F3C;
	word32 a7_252;
	word32 a5_250;
	word32 a6_251;
	word32 a3_248;
	word32 a4_249;
	word32 a1_246;
	word32 a2_247;
	memcpy(0x42024012, 0x42023FBD, 0x06, out a1_246, out a2_247, out a3_248, out a4_249, out a5_250, out a6_251, out a7_252);
	if (mac_is_unvalid(&g_w42024012) != 0x00)
	{
		bl_wifi_mac_addr_get(0x42024012);
		if (mac_is_unvalid(&g_w42024012) != 0x00)
		{
			g_w42024012 = 0xC0;
			g_dw42024014 = 0x0100C943;
		}
		word32 a6_260;
		word32 a7_261;
		word32 a4_258;
		word32 a5_259;
		word32 a2_256;
		word32 a3_257;
		word32 a1_255;
		memcpy(0x42023FBD, 0x42024012, 0x06, out a1_255, out a2_256, out a3_257, out a4_258, out a5_259, out a6_260, out a7_261);
	}
	struct Eq_122629 * s1_122;
	Eq_2 s0_121 = netifapi_netif_add(ra, 0x42024000, fp + ~0x1B, fp + ~0x17, fp + ~0x13, 0x00, 0x23028D82, 0x42024000, mstatus, s1, dwArg78, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, out s1_122);
	s1_122->w00DE = 0x61;
	netif_set_default((word32) s0_121 - 40);
	ptr32 mstatus_150;
	ptr32 s2_153;
	word32 s3_254;
	word32 a1_253;
	Eq_2 ra_151 = netif_set_up(ra, s0_121, (word32) s0_121 - 40, mstatus, s2, dwLoc10, dwArg04, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out a1_253, out s2_153, out s3_254, out mstatus_150);
	s0Out = s0_121;
	a0Out = 1107443640;
	s2Out = s2_153;
	mstatusOut = mstatus_150;
	return ra_151;
}

// 23027E5E: Register Eq_2 wifi_mgmr_ap_mac_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out)
// Called from:
//      ap_sta_get
Eq_2 wifi_mgmr_ap_mac_get(Eq_2 ra, Eq_2 a0, Eq_2 s2, word32 s3, word32 s4, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out)
{
	word32 s0_24;
	Eq_2 s1_25;
	ptr32 s3_27;
	word32 s2_90;
	word32 s4_91;
	Eq_2 ra_23 = bl_efuse_read_mac(ra, &g_t42024000, a0, 0x42023FBD, s2, s3, s4, out s0_24, out s1_25, out s2_90, out s3_27, out s4_91);
	if (mac_is_unvalid(s0_24 + -67) != 0x00)
	{
		g_b42023FBD = 0xC0;
		g_w42023FBE = 848;
		g_w42023FC0 = 0xC9;
		g_b42023FC2 = 0x01;
	}
	ptr32 a4_53;
	ptr32 a3_58;
	word32 a1_92;
	word32 a2_93;
	word32 a5_94;
	word32 a6_95;
	word32 a7_96;
	memcpy(s1_25, s0_24 + -67, 0x06, out a1_92, out a2_93, out a3_58, out a4_53, out a5_94, out a6_95, out a7_96);
	a2Out = dwArg10;
	a3Out = a3_58;
	a4Out = a4_53;
	s3Out = s3_27;
	return ra_23;
}

// 23027EBE: void wifi_mgmr_ap_ip_get(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2)
// Called from:
//      ap_sta_get
void wifi_mgmr_ap_ip_get(ptr32 a0, ptr32 a1, ptr32 a2)
{
	*g_ptr42023FDC = a0;
	*g_ptr42023FE0 = a1;
	*g_ptr42023FE4 = a2;
}

