pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23027EDC: Register word32 wifi_mgmr_ap_start(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8)
// Called from:
//      cmd_wifi_ap_start
//      set_apcfg
word32 wifi_mgmr_ap_start(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8)
{
	return wifi_mgmr_api_ap_start(ra, a1, a3, a4, mstatus, dwLoc04, dwArg00, dwArg04, dwArg28, dwArg58, dwArg78, dwArg98, dwArgB8);
}

// 23027EF6: Register Eq_2 wifi_mgmr_ap_stop(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_wifi_ap_stop
//      __wifimode_set
Eq_2 wifi_mgmr_ap_stop(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	ptr32 a3_11;
	ptr32 mstatus_16;
	ptr32 s1_18;
	ptr32 s2_21;
	Eq_2 ra_17 = wifi_mgmr_api_ap_stop(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_18, out a3_11, out s2_21, out mstatus_16);
	s1Out = s1_18;
	a3Out = a3_11;
	s2Out = s2_21;
	mstatusOut = mstatus_16;
	return ra_17;
}

// 23027F06: void wifi_mgmr_ap_sta_cnt_get(Register (ptr32 byte) a0)
// Called from:
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      ap_sta_get
void wifi_mgmr_ap_sta_cnt_get(byte * a0)
{
	wifi_mgmr_ap_sta_cnt_get_internal(a0);
}

// 23027F16: Register Eq_2 wifi_mgmr_ap_sta_info_get(Register Eq_2 ra, Register Eq_2 a1, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out)
// Called from:
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      ap_sta_get
Eq_2 wifi_mgmr_ap_sta_info_get(Eq_2 ra, Eq_2 a1, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s4Out)
{
	struct Eq_122814 * s0_37;
	ptr32 s1_38;
	word32 t1_94;
	word32 a0_95;
	word32 a1_96;
	word32 a2_97;
	word32 a3_98;
	word32 a4_99;
	word32 a5_100;
	Eq_2 ra_36 = wifi_mgmr_ap_sta_info_get_internal(memset(ra, fp + -40, 0x00, 0x18, out t1_94, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out a5_100), fp + -40, a1, out s0_37, out s1_38);
	struct Eq_122845 * a5_48 = (word32) wLoc28;
	s0_37->w0000 = (word16) a5_48;
	a5_48->ptr0010 = s0_37;
	a5_48->ptr000C = s0_37;
	a5_48->ptr0008 = s0_37;
	s0_37->b0014 = (byte) (word32) bLoc14;
	ptr32 a4_61;
	ptr32 a3_66;
	word32 a1_101;
	word32 a2_102;
	word32 a5_103;
	word32 a6_104;
	word32 a7_105;
	memcpy(&s0_37->w0000 + 1, fp + -38, 0x06, out a1_101, out a2_102, out a3_66, out a4_61, out a5_103, out a6_104, out a7_105);
	s0Out = dwArgE4;
	s1Out = s1_38;
	a2Out = dwArg0100;
	a3Out = a3_66;
	a4Out = a4_61;
	s4Out = dwArgB4;
	return ra_36;
}

// 23027F6A: void wifi_mgmr_ap_sta_delete(Register Eq_2 ra, Register (ptr32 Eq_98932) s0, Register Eq_2 s1, Register (ptr32 Eq_98932) a0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
// Called from:
//      wifi_ap_sta_delete_cmd
void wifi_mgmr_ap_sta_delete(Eq_2 ra, struct Eq_98932 * s0, Eq_2 s1, struct Eq_98932 * a0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg5C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	wifi_mgmr_ap_sta_delete_internal(ra, s0, s1, a0, s4, mstatus, dwArg10, dwArg14, dwArg2C, dwArg5C, dwArg88, dwArgA8, dwArgC8, dwArgE8, dwArg0108);
}

// 23027F7A: void wifi_mgmr_sniffer_register(Register word32 a0, Register (ptr32 code) a1)
// Called from:
//      wifi_sniffer_on_cmd
//      wifi_mon_cmd
void wifi_mgmr_sniffer_register(word32 a0, <anonymous> * a1)
{
	bl_rx_pkt_cb_register(a0, a1);
}

// 23027F8A: void wifi_mgmr_sniffer_unregister()
// Called from:
//      wifi_sniffer_off_cmd
void wifi_mgmr_sniffer_unregister()
{
	bl_rx_pkt_cb_unregister();
}

// 23027F9A: void wifi_mgmr_sniffer_enable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_sniffer_on_cmd
//      wifi_mon_cmd
void wifi_mgmr_sniffer_enable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	wifi_mgmr_api_sniffer_enable(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
}

// 23027FAA: void wifi_mgmr_sniffer_disable(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_sniffer_off_cmd
void wifi_mgmr_sniffer_disable(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	word32 s4_54;
	word32 mstatus_55;
	wifi_mgmr_api_idle(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s4_54, out mstatus_55);
}

