pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23027FBA: void wifi_mgmr_rate_config(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      wifi_rc_fixed_disable
//      wifi_rc_fixed_enable
void wifi_mgmr_rate_config(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_api_rate_config(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 23027FBE: void wifi_mgmr_conf_max_sta(Register Eq_2 ra, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      cmd_wifi_ap_conf_max_sta
void wifi_mgmr_conf_max_sta(Eq_2 ra, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	wifi_mgmr_api_conf_max_sta(ra, s4, mstatus, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148);
}

// 23027FC2: Register word32 wifi_mgmr_state_get(Register (ptr32 word32) a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      wifiprov_wifi_state_get
//      cmd_wifi_state_get
//      wifi_sta_get_state_cmd
//      wifi_ap_sta_list_get_cmd
//      wifi_ap_sta_delete_cmd
//      cwjap_info
word32 wifi_mgmr_state_get(word32 * a0, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_7;
	ptr32 a5_8;
	word32 a3_6 = wifi_mgmr_state_get_internal(a0, out a4_7, out a5_8);
	a4Out = a4_7;
	a5Out = a5_8;
	return a3_6;
}

// 23027FC6: void wifi_mgmr_rssi_get(Register ptr32 a0)
// Called from:
//      wifi_sta_ip_info
void wifi_mgmr_rssi_get(ptr32 a0)
{
	null[(int32) g_b42023FB4 / 4] = a0;
}

// 23027FD4: Register word32 wifi_mgmr_raw_80211_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_116622 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      cmd_wifi_raw_send
word32 wifi_mgmr_raw_80211_send(Eq_2 ra, Eq_2 s1, Eq_116622 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	if (a1 > 480)
		return ~0x00;
	wifi_mgmr_api_raw_send(ra, s1, a1, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
	return 0x00;
}

// 23027FF0: void wifi_mgmr_scan(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 code) a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
// Called from:
//      wifi_scan_cmd
void wifi_mgmr_scan(Eq_2 ra, Eq_2 a0, <anonymous> * a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	g_ptr4200F3A8 = a1;
	g_t4200F3AC = a0;
	word32 a2_60;
	word32 a3_61;
	word32 a4_62;
	word32 a5_63;
	word32 s10_64;
	word32 mstatus_65;
	wifi_mgmr_api_fw_scan(ra, s4, mstatus, dwArg08, dwArg30, dwArg34, dwArg58, dwArg64, dwArg7C, dwArg80, dwArg84, dwArgA8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out a2_60, out a3_61, out a4_62, out a5_63, out s10_64, out mstatus_65);
}

// 23028010: void wifi_mgmr_cfg_req(Register Eq_2 ra, Register Eq_2 s1, Register uint32 a0, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8)
// Called from:
//      cmd_wifi_cfg
void wifi_mgmr_cfg_req(Eq_2 ra, Eq_2 s1, uint32 a0, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8)
{
	wifi_mgmr_api_cfg_req(ra, s1, a0, a4, a5, s3, mstatus, dwArg18, dwArg24, dwArg68, dwArg98, dwArgB8, dwArgD8, dwArgF8);
}

// 23028014: void wifi_mgmr_scan_filter_hidden_ssid(Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      wifi_scan_filter_cmd
void wifi_mgmr_scan_filter_hidden_ssid(word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	int32 a5_16;
	word32 a5_37;
	vTaskEnterCritical(a4, mstatus, out a5_37);
	int32 a5_15 = g_dw42025708;
	if (a0 != 0x00)
		a5_16 = a5_15 & ~0x01;
	else
		a5_16 = a5_15 | 1;
	g_dw42025708 = a5_16;
	word32 a4_38;
	word32 a5_39;
	vTaskExitCritical(a3, mstatus, out a4_38, out a5_39);
}

// 23028046: Register Eq_2 wifi_mgmr_scan_complete_callback(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 a4Out)
// Called from:
//      wifi_mgmr_scan_complete_notify
Eq_2 wifi_mgmr_scan_complete_callback(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & a4Out)
{
	word32 a3_17;
	word32 s1_101;
	word32 a0_102;
	word32 a1_103;
	word32 a2_104;
	word32 a5_105;
	word32 a7_106;
	word32 s2_107;
	word32 s3_108;
	word32 s4_109;
	word32 s5_110;
	word32 s6_111;
	word32 s7_112;
	word32 s8_113;
	word32 s9_114;
	word32 s10_115;
	word32 s11_116;
	word32 t4_117;
	ptr32 a4_18;
	Eq_2 ra_20 = printf(ra, &g_t230B4A18, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_101, out a0_102, out a1_103, out a2_104, out a3_17, out a4_18, out a5_105, out a7_106, out s2_107, out s3_108, out s4_109, out s5_110, out s6_111, out s7_112, out s8_113, out s9_114, out s10_115, out s11_116, out t4_117);
	<anonymous> * a5_35 = g_ptr4200F3A8;
	if (a5_35 != null)
		a5_35();
	a4Out = a4_18;
	return ra_20;
}

// 23028082: Register word32 wifi_mgmr_scan_ap_all(Register word32 ra, Register ptr32 a0, Register ptr32 a1, Register (ptr32 code) a2, Register out (ptr32 Eq_537) s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out Eq_540 a5Out, Register out (ptr32 Eq_537) s2Out, Register out ptr32 s3Out)
// Called from:
//      scan_complete_cb
//      wifi_mgmr_all_ap_scan
word32 wifi_mgmr_scan_ap_all(word32 ra, ptr32 a0, ptr32 a1, <anonymous> * a2, struct Eq_537 & s0Out, ptr32 & s1Out, ptr32 & a3Out, union Eq_540 & a5Out, struct Eq_537 & s2Out, ptr32 & s3Out)
{
	struct Eq_123030 * sp_123 = fp + -112;
	struct Eq_537 * s0_120 = &g_b42023F3C;
	ptr32 s3_102 = a0;
	ptr32 s4_103 = a1;
	<anonymous> * s5_104 = a2;
	struct Eq_537 * s2_100 = (struct Eq_537 *) 0x43023AF4;
	struct Eq_123041 * s1_101 = (struct Eq_123041 *) 1124220732;
	do
	{
		Eq_540 a5_153 = (word32) s0_120->b02B0;
		if (a5_153 != 0x00)
		{
			Eq_2 a1_33 = (char *) s0_120 + 636;
			sp_123->t0084 = a1_33;
			word32 a5_198;
			Eq_2 a0_36 = xTaskGetTickCount(out a5_198);
			a5_153 = s1_101->t07D0;
			if (a0_36 - s0_120->t02B4 < a5_153)
			{
				word32 a6_204;
				word32 a7_205;
				word32 a4_202;
				word32 a5_203;
				word32 a2_200;
				word32 a3_201;
				word32 a1_199;
				memcpy((char *) sp_123 + 28, a1_33, 32, out a1_199, out a2_200, out a3_201, out a4_202, out a5_203, out a6_204, out a7_205);
				sp_123->b003C = 0x00;
				word32 a1_206;
				word32 a2_207;
				word32 a3_208;
				word32 a4_209;
				word32 a5_210;
				sp_123->t0020 = strlen((char *) sp_123 + 28, out a1_206, out a2_207, out a3_208, out a4_209, out a5_210);
				word32 a1_211;
				word32 a2_212;
				word32 a3_213;
				word32 a4_214;
				word32 a5_215;
				word32 a6_216;
				word32 a7_217;
				memcpy(&sp_123->b003C + 8, (char *) s0_120 + 676, 0x06, out a1_211, out a2_212, out a3_213, out a4_214, out a5_215, out a6_216, out a7_217);
				sp_123->b004A = (byte) (word32) s0_120->b02AA;
				sp_123->b004C = (byte) (word32) s0_120->b02AB;
				word32 a5_92 = (word32) s0_120->b02AE;
				sp_123->b004B = (byte) a5_92;
				word32 a4_113;
				word32 a7_114;
				word32 a6_115;
				word32 t1_116;
				word32 t3_117;
				word32 t5_118;
				word32 t6_119;
				s5_104();
			}
		}
		sp_123 = fp - 112;
		++s0_120;
	} while (s0_120 != s2_100);
	s0Out = s0_120;
	s1Out = dwArgA4;
	a3Out = dwArgC0;
	a5Out = a5_153;
	s2Out = s2_100;
	s3Out = s3_102;
	return dwArgE8;
}

