pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302812A: Register Eq_2 wifi_mgmr_all_ap_scan(Register Eq_2 ra, Register Eq_2 s1, Register ptr32 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      scan
Eq_2 wifi_mgmr_all_ap_scan(Eq_2 ra, Eq_2 s1, ptr32 a0, ptr32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	ptr32 a0_210;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a0_25;
		word32 s8_365;
		word32 s4_364;
		word32 s3_363;
		word32 s2_362;
		word32 a6_361;
		word32 a5_360;
		word32 a4_359;
		word32 a2_358;
		word32 a1_357;
		word32 s1_356;
		Eq_2 s0_32 = pvPortMalloc(ra, s1, 0x00FFFA28, a3, a4, a5, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_356, out a0_25, out a1_357, out a2_358, out a3, out a4_359, out a5_360, out a6_361, out s2_362, out s3_363, out s4_364, out s8_365);
		if (a0_25 != 0x00)
		{
			Eq_2 a3_46;
			Eq_2 a4_47;
			Eq_2 a5_48;
			word32 t1_366;
			word32 a0_367;
			word32 a1_368;
			word32 a2_369;
			ra = memset(ra, a0_25, 0x00, (word32) s0_32 - 0x05D8, out t1_366, out a0_367, out a1_368, out a2_369, out a3_46, out a4_47, out a5_48);
			Eq_2 a0_55;
			Eq_2 a2_57;
			Eq_2 a5_60;
			Eq_2 s1_63;
			Eq_2 s4_66;
			word32 a1_370;
			word32 a3_371;
			word32 a4_372;
			word32 s2_373;
			word32 s3_374;
			xQueueGenericCreate(ra, 0x01, 0x00, a3_46, a4_47, a5_48, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out s1_63, out a0_55, out a1_370, out a2_57, out a3_371, out a4_372, out a5_60, out s2_373, out s3_374, out s4_66);
			g_t42025710 = a0_55;
			if (a0_55 != 0x00)
			{
				g_ptr4200F3A8 = &g_t230279A6;
				g_t4200F3AC = s1_63;
				Eq_2 a2_80;
				Eq_2 a3_81;
				Eq_2 a4_82;
				Eq_2 a5_83;
				Eq_2 s10_136;
				Eq_2 ra_134 = wifi_mgmr_api_fw_scan(ra, s4_66, mstatus, dwLoc18, dwArg10, dwArg14, dwArg38, dwArg44, s3, s1, ra, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out a2_80, out a3_81, out a4_82, out a5_83, out s10_136, out mstatus);
				word32 a0_108;
				word32 s1_375;
				word32 a1_376;
				word32 a2_377;
				word32 a4_378;
				word32 a5_379;
				word32 s2_380;
				word32 s3_381;
				word32 s4_382;
				word32 s8_383;
				Eq_2 a3_111;
				xQueueSemaphoreTake(g_t42025710, ~0x00, a2_80, a3_81, a4_82, a5_83, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_375, out a0_108, out a1_376, out a2_377, out a3_111, out a4_378, out a5_379, out s2_380, out s3_381, out s4_382, out s8_383);
				if (a0_108 == 0x01)
				{
					word32 s1_401;
					word32 a0_402;
					word32 a1_403;
					word32 a2_404;
					word32 a4_405;
					word32 a5_406;
					word32 a7_407;
					word32 s2_408;
					word32 s3_409;
					word32 s4_410;
					word32 s5_411;
					word32 s6_412;
					word32 s7_413;
					word32 s8_414;
					word32 s9_415;
					word32 s11_416;
					word32 t4_417;
					ra_134 = printf(ra_134, &g_t230B4A04, a3_111, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_401, out a0_402, out a1_403, out a2_404, out a3_111, out a4_405, out a5_406, out a7_407, out s2_408, out s3_409, out s4_410, out s5_411, out s6_412, out s7_413, out s8_414, out s9_415, out s10_136, out s11_416, out t4_417);
				}
				Eq_2 a4_157;
				ptr32 s1_162;
				Eq_2 a3_182;
				word32 a5_183;
				struct Eq_123407 * s0_185;
				word32 s1_186;
				word32 * s2_187;
				word32 * s3_188;
				ra = wifi_mgmr_scan_ap_all(wifi_mgmr_cli_scanlist(ra_134, a3_111, s10_136, dwLoc18, dwArg88, out s1_162, out a4_157), s1_162, fp + -36, &g_t2302792E, out s0_185, out s1_186, out a3_182, out a5_183, out s2_187, out s3_188);
				*s3_188 = a5_183;
				*s2_187 = s1_186;
				word32 s1_394;
				word32 a0_395;
				word32 a1_396;
				word32 a2_397;
				word32 a4_398;
				word32 a5_399;
				word32 s4_400;
				vQueueDelete(s0_185->t0710, a3_182, a4_157, mstatus, dwArg0128, dwArg0168, out s1_394, out a0_395, out a1_396, out a2_397, out a3, out a4_398, out a5_399, out s4_400);
				a0_210 = 0x00;
l2302813C:
				0x00 = (int8) dwArg0128;
				a0Out = a0_210;
				a3Out = a3;
				mstatusOut = mstatus;
				return ra;
			}
			word32 s0_384;
			word32 s1_385;
			word32 a0_386;
			word32 a1_387;
			word32 a2_388;
			word32 a4_389;
			word32 a5_390;
			word32 a6_391;
			word32 s4_392;
			word32 t3_393;
			vPortFree(s1_63, a2_57, a5_60, mstatus, dwArg0128, dwArg0168, out s0_384, out s1_385, out a0_386, out a1_387, out a2_388, out a3, out a4_389, out a5_390, out a6_391, out s4_392, out t3_393);
		}
	}
	a0_210 = ~0x00;
	goto l2302813C;
}

// 230281E6: void wifi_mgmr_status_code_str(Register up32 a0)
void wifi_mgmr_status_code_str(up32 a0)
{
	if (a0 > 0x10)
		;
}

// 23028208: Register Eq_2 wifi_mgmr_profile_add(Register Eq_2 ra, Register (ptr32 Eq_109888) a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 a3Out)
// Called from:
//      stateIdleAction_connect
Eq_2 wifi_mgmr_profile_add(Eq_2 ra, struct Eq_109888 * a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & a3Out)
{
	Eq_2 s0_15;
	Eq_2 s1_12 = a1;
	if (a2 != ~0x00)
	{
		word32 a1_17;
		if ((word32) a0->b01B1 != 0x00)
		{
			if ((word32) a0->b0275 != 0x00)
				goto l23028230;
			a1_17 = 0x01;
		}
		else
			a1_17 = 0x00;
		a0->dw0278 = a1_17;
		s0_15 = a0 + (a1_17 + 436) / 636;
		word32 a0_263;
		word32 a1_264;
		word32 a2_265;
		word32 a3_266;
		word32 a4_267;
		word32 a5_268;
		word32 a7_269;
		word32 s2_270;
		word32 s3_271;
		word32 s4_272;
		word32 s5_273;
		word32 s6_274;
		word32 s7_275;
		word32 s8_276;
		word32 s9_277;
		word32 s10_278;
		word32 s11_279;
		word32 t4_280;
		ra = printf(ra, &g_t230B4B04, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_12, out a0_263, out a1_264, out a2_265, out a3_266, out a4_267, out a5_268, out a7_269, out s2_270, out s3_271, out s4_272, out s5_273, out s6_274, out s7_275, out s8_276, out s9_277, out s10_278, out s11_279, out t4_280);
	}
	else
	{
		s0_15 = (char *) a0 + 0x00F0;
		if (a0 == (struct Eq_109888 *) 0xF0)
			goto l23028230;
	}
	word32 t1_281;
	word32 a0_282;
	word32 a1_283;
	word32 a2_284;
	word32 a3_285;
	word32 a4_286;
	word32 a5_287;
	ra = memset(ra, s0_15, 0x00, 0x00C4, out t1_281, out a0_282, out a1_283, out a2_284, out a3_285, out a4_286, out a5_287);
	((word32) s0_15 + 0x00C0)->u2 = 0x0100;
	((word32) *((word32) s1_12 + 36) << 24 | (((word32) (*((word32) s1_12 + 0x0022)) << 8 | (word32) (*((word32) s1_12 + 33))) | (word32) (*((word32) s1_12 + 35)) << 16))->t0024 = s0_15;
	((word32) *((word32) s1_12 + 0x00AA) << 24 | (((word32) (*((word32) s1_12 + 0x00A8)) << 8 | (word32) (*((word32) s1_12 + 0x00A7))) | (word32) (*((word32) s1_12 + 0x00A9)) << 16))->t006C = s0_15;
	*((word32) s0_15 + 0x00B4) = (word32) *((word32) s1_12 + 0x00AE) << 24 | (((word32) (*((word32) s1_12 + 0x00AC)) << 8 | (word32) (*((word32) s1_12 + 171))) | (word32) (*((word32) s1_12 + 0x00AD)) << 16);
	*((word32) s0_15 + 191) = ~0x00;
	word32 a1_288;
	word32 a2_289;
	word32 a3_290;
	word32 a4_291;
	word32 a5_292;
	word32 a6_293;
	word32 a7_294;
	memcpy(s0_15, s1_12, 33, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out a6_293, out a7_294);
	word32 a1_295;
	word32 a2_296;
	word32 a3_297;
	word32 a4_298;
	word32 a5_299;
	word32 a6_300;
	word32 a7_301;
	memcpy((word32) s0_15 + 40, (word32) s1_12 + 37, 65, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a6_300, out a7_301);
	word32 a1_302;
	word32 a2_303;
	word32 a3_304;
	word32 a4_305;
	word32 a5_306;
	word32 a6_307;
	word32 a7_308;
	memcpy((word32) s0_15 + 112, (word32) s1_12 + 0x0066, 65, out a1_302, out a2_303, out a3_304, out a4_305, out a5_306, out a6_307, out a7_308);
	word32 a1_309;
	word32 a2_310;
	word32 a4_311;
	word32 a5_312;
	word32 a6_313;
	word32 a7_314;
	memcpy((word32) s0_15 + 0x00B8, (word32) s1_12 + 0x00AF, 0x06, out a1_309, out a2_310, out a3, out a4_311, out a5_312, out a6_313, out a7_314);
	*((word32) s0_15 + 0x00BE) = (byte) (word32) *((word32) s1_12 + 0x00B8);
l23028230:
	a3Out = a3;
	return ra;
}

// 23028318: Register Eq_2 wifi_mgmr_profile_get(Register Eq_2 ra, Register (ptr32 Eq_111234) a0, Register Eq_2 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 a0Out, Register out Eq_2 a3Out)
// Called from:
//      disconnect_retry
Eq_2 wifi_mgmr_profile_get(Eq_2 ra, struct Eq_111234 * a0, Eq_2 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & a0Out, union Eq_2 & a3Out)
{
	ptr32 a0_163;
	if ((word32) a0->b01B1 != 0x01)
	{
		a0_163 = ~0x00;
		if ((word32) a0->b0275 != 0x01)
			goto l2302833A;
	}
	word32 s1_41;
	word32 s2_44;
	word32 a0_241;
	word32 a1_242;
	word32 a2_243;
	word32 a3_244;
	word32 a4_245;
	word32 a5_246;
	word32 a7_247;
	word32 s3_248;
	word32 s4_249;
	word32 s5_250;
	word32 s6_251;
	word32 s7_252;
	word32 s8_253;
	word32 s9_254;
	word32 s10_255;
	word32 s11_256;
	word32 t4_257;
	word32 t1_258;
	word32 a0_259;
	word32 a1_260;
	word32 a2_261;
	word32 a3_262;
	word32 a4_263;
	word32 a5_264;
	ra = memset(printf(ra, &g_t230B4B30, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_41, out a0_241, out a1_242, out a2_243, out a3_244, out a4_245, out a5_246, out a7_247, out s2_44, out s3_248, out s4_249, out s5_250, out s6_251, out s7_252, out s8_253, out s9_254, out s10_255, out s11_256, out t4_257), a1, 0x00, 0x00B9, out t1_258, out a0_259, out a1_260, out a2_261, out a3_262, out a4_263, out a5_264);
	struct Eq_123855 * a4_70 = s2_44 + (s1_41 + 0x00C4);
	Eq_123859 a5_71 = a4_70->t0114;
	*((word32) a1 + 33) = (byte) a5_71;
	*((word32) a1 + 0x0022) = (byte) (a5_71 >> 0x08);
	*((word32) a1 + 35) = (byte) (a5_71 >> 0x10);
	*((word32) a1 + 36) = (byte) (a5_71 >> 24);
	Eq_123885 a5_81 = a4_70->t015C;
	*((word32) a1 + 0x00A7) = (byte) a5_81;
	*((word32) a1 + 0x00A8) = (byte) (a5_81 >> 0x08);
	*((word32) a1 + 0x00A9) = (byte) (a5_81 >> 0x10);
	*((word32) a1 + 0x00AA) = (byte) (a5_81 >> 24);
	Eq_123911 a5_89 = a4_70->t01A4;
	*((word32) a1 + 171) = (byte) a5_89;
	*((word32) a1 + 0x00AC) = (byte) (a5_89 >> 0x08);
	*((word32) a1 + 0x00AD) = (byte) (a5_89 >> 0x10);
	*((word32) a1 + 0x00AE) = (byte) (a5_89 >> 24);
	*((word32) a1 + 0x00B8) = (byte) (word32) a4_70->b01AE;
	word32 a1_265;
	word32 a2_266;
	word32 a3_267;
	word32 a4_268;
	word32 a5_269;
	word32 a6_270;
	word32 a7_271;
	memcpy(a1, s1_41 + 436 + s2_44, 33, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a6_270, out a7_271);
	word32 a1_272;
	word32 a2_273;
	word32 a3_274;
	word32 a4_275;
	word32 a5_276;
	word32 a6_277;
	word32 a7_278;
	memcpy((word32) a1 + 37, s1_41 + 476 + s2_44, 65, out a1_272, out a2_273, out a3_274, out a4_275, out a5_276, out a6_277, out a7_278);
	word32 a1_279;
	word32 a2_280;
	word32 a3_281;
	word32 a4_282;
	word32 a5_283;
	word32 a6_284;
	word32 a7_285;
	memcpy((word32) a1 + 0x0066, s1_41 + 0x0224 + s2_44, 65, out a1_279, out a2_280, out a3_281, out a4_282, out a5_283, out a6_284, out a7_285);
	word32 a1_286;
	word32 a2_287;
	word32 a4_288;
	word32 a5_289;
	word32 a6_290;
	word32 a7_291;
	memcpy((word32) a1 + 0x00AF, s1_41 + 620 + s2_44, 0x06, out a1_286, out a2_287, out a3, out a4_288, out a5_289, out a6_290, out a7_291);
	a0_163 = 0x00;
l2302833A:
	0x00 = (int8) dwArg38;
	a0Out = a0_163;
	a3Out = a3;
	return ra;
}

// 2302841A: Register (ptr32 Eq_112503) wifi_mgmr_profile_autoreconnect_is_enabled(Register (ptr32 Eq_112503) a0)
// Called from:
//      stateDisconnect_enter
struct Eq_112503 * wifi_mgmr_profile_autoreconnect_is_enabled(struct Eq_112503 * a0)
{
	return (word32) ((word32) a0->b10007C1 < 1);
}

