pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23028428: void wifi_mgmr_profile_autoreconnect_disable(Register (ptr32 Eq_112334) a0)
// Called from:
//      stateGlobalGuard_disable_autoreconnect
void wifi_mgmr_profile_autoreconnect_disable(struct Eq_112334 * a0)
{
	a0->b10007C1 = 0x01;
}

// 23028436: void wifi_mgmr_profile_autoreconnect_enable(Register (ptr32 Eq_112247) a0)
// Called from:
//      stateGlobalGuard_enable_autoreconnect
void wifi_mgmr_profile_autoreconnect_enable(struct Eq_112247 * a0)
{
	a0->b10007C1 = 0x00;
}

// 23028442: Register Eq_2 wifi_netif_dhcp_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
// Called from:
//      stateConnectedIPNoEnter
Eq_2 wifi_netif_dhcp_start(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 a4_19;
	word32 a3_51;
	word32 a5_52;
	word32 s2_53;
	netifapi_netif_common(ra, s0, a3, a4, a5, s2, mstatus, dwArg78, dwArg88, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out a3_51, out a4_19, out a5_52, out s2_53);
	return a4_19;
}

// 2302845C: void cb_rssi_ind(Register word32 a1)
void cb_rssi_ind(word32 a1)
{
	g_b42024FB4 = (byte) a1;
}

// 23028466: void cb_probe_resp_ind(Register Eq_2 ra, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cb_probe_resp_ind(Eq_2 ra, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_39;
	word32 a0_40;
	word32 a1_41;
	word32 a2_42;
	word32 a3_43;
	word32 a4_44;
	word32 a5_45;
	word32 a7_46;
	word32 s2_47;
	word32 s3_48;
	word32 s4_49;
	word32 s5_50;
	word32 s6_51;
	word32 s7_52;
	word32 s8_53;
	word32 s9_54;
	word32 s10_55;
	word32 s11_56;
	word32 t4_57;
	printf(ra, &g_t230B4BE8, a2, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_39, out a0_40, out a1_41, out a2_42, out a3_43, out a4_44, out a5_45, out a7_46, out s2_47, out s3_48, out s4_49, out s5_50, out s6_51, out s7_52, out s8_53, out s9_54, out s10_55, out s11_56, out t4_57);
}

// 23028476: void cb_beacon_ind(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8)
void cb_beacon_ind(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgC8)
{
	wifi_mgmr_api_scan_item_beacon(ra, s2, s3, s4, mstatus, dwLoc18, dwLoc0C, dwArg0C, dwArg10, dwArg24, dwArg38, dwArg68, dwArg88, dwArgA8, dwArgC8);
}

// 230284A6: void cb_disconnect_ind(Register Eq_2 ra, Register (ptr32 uint16) a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void cb_disconnect_ind(Eq_2 ra, uint16 * a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a3_29;
	Eq_2 s4_38;
	word32 t1_147;
	word32 a0_148;
	word32 a1_149;
	word32 a2_150;
	word32 a4_151;
	word32 a5_152;
	word32 s1_153;
	word32 a0_154;
	word32 a1_155;
	word32 a2_156;
	word32 a4_157;
	word32 a5_158;
	word32 a7_159;
	word32 s2_160;
	word32 s3_161;
	word32 s5_162;
	word32 s6_163;
	word32 s7_164;
	word32 s8_165;
	word32 s9_166;
	word32 s10_167;
	word32 s11_168;
	word32 t4_169;
	Eq_2 ra_32 = printf(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_147, out a0_148, out a1_149, out a2_150, out a3_16, out a4_151, out a5_152), &g_t230B4B58, a3_16, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_153, out a0_154, out a1_155, out a2_156, out a3_29, out a4_157, out a5_158, out a7_159, out s2_160, out s3_161, out s4_38, out s5_162, out s6_163, out s7_164, out s8_165, out s9_166, out s10_167, out s11_168, out t4_169);
	g_b4202568E = 0x02;
	Eq_2 a4_70 = (word32) *a1;
	g_w4202568C = (word16) a4_70;
	word32 s1_170;
	word32 a1_171;
	word32 a2_172;
	word32 a3_173;
	word32 a4_174;
	word32 a5_175;
	word32 s2_176;
	word32 s3_177;
	word32 s4_178;
	word32 s5_179;
	word32 s6_180;
	word32 s10_181;
	word32 mstatus_182;
	wifi_mgmr_event_notify(ra_32, fp + ~0x1F, a3_29, a4_70, s4_38, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_170, out a1_171, out a2_172, out a3_173, out a4_174, out a5_175, out s2_176, out s3_177, out s4_178, out s5_179, out s6_180, out s10_181, out mstatus_182);
}

// 2302853E: void cb_connect_ind(Register Eq_2 ra, Register (ptr32 Eq_114497) a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void cb_connect_ind(Eq_2 ra, struct Eq_114497 * a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a4_51;
	word32 t1_121;
	word32 a0_122;
	word32 a1_123;
	word32 a2_124;
	word32 a3_125;
	word32 a4_126;
	word32 a5_127;
	word32 s1_128;
	word32 a1_129;
	word32 a2_130;
	word32 a3_131;
	word32 a4_132;
	word32 a5_133;
	word32 s2_134;
	word32 s3_135;
	word32 s4_136;
	word32 s5_137;
	word32 s6_138;
	word32 s10_139;
	word32 mstatus_140;
	wifi_mgmr_event_notify(memset(ra, fp + ~0x1F, 0x00, 0x0D, out t1_121, out a0_122, out a1_123, out a2_124, out a3_125, out a4_126, out a5_127), fp + ~0x1F, wifi_mgmr_set_connect_stat_info(a1, 0x01, out a4_51), a4_51, s4, mstatus, 0x0D55, dwLoc0C, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg68, dwArg74, dwArg8C, dwArg90, dwArg94, dwArgB8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s1_128, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out s2_134, out s3_135, out s4_136, out s5_137, out s6_138, out s10_139, out mstatus_140);
}

// 230285C4: void cb_event_ind(Register Eq_2 ra, Register (ptr32 Eq_124333) a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cb_event_ind(Eq_2 ra, struct Eq_124333 * a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_446 * a4_36;
	ui32 a5_14 = (word32) a1->b0003 << 24 | (((word32) a1->b0001 << 8 | (word32) a1->b0000) | (word32) a1->b0002 << 16);
	if (a5_14 != 0x01)
	{
		struct Eq_274 * a0_66;
		if (a5_14 == 0x00)
		{
			g_dw42024F40 = (word32) a1->b0007 << 24 | ((word32) a1->b0006 << 16 | ((word32) a1->b0004 | (word32) a1->b0005 << 8));
			a0_66 = (struct Eq_274 *) &g_t230B4B70;
			goto l23028626;
		}
		a4_36 = (struct Eq_446 *) 0x02;
		if (a5_14 != 0x02)
		{
			a0_66 = (struct Eq_274 *) &g_t230B4BAC;
l23028626:
			word32 s1_213;
			word32 a0_214;
			word32 a1_215;
			word32 a2_216;
			word32 a3_217;
			word32 a4_218;
			word32 a5_219;
			word32 a7_220;
			word32 s2_221;
			word32 s3_222;
			word32 s4_223;
			word32 s5_224;
			word32 s6_225;
			word32 s7_226;
			word32 s8_227;
			word32 s9_228;
			word32 s10_229;
			word32 s11_230;
			word32 t4_231;
			printf(ra, a0_66, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_213, out a0_214, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out a7_220, out s2_221, out s3_222, out s4_223, out s5_224, out s6_225, out s7_226, out s8_227, out s9_228, out s10_229, out s11_230, out t4_231);
			return;
		}
	}
	else
	{
		word32 a2_205;
		word32 a1_204;
		word32 a0_203;
		word32 a4_206;
		word32 a5_207;
		word32 s4_208;
		word32 s8_209;
		puts(0x230B4B90, out a0_203, out a1_204, out a2_205, out a4_206, out a5_207, out s4_208, out s8_209);
		ra = wifi_mgmr_scan_complete_notify(ra, a3, dwArg30, dwArg34, dwArg58, dwArg7C, out a4_36);
	}
	word32 s0_210;
	word32 a0_211;
	word32 a3_212;
	aos_post_event(ra, 0x02, a4_36, dwArg24, out s0_210, out a0_211, out a3_212);
}

// 23028654: Register word32 wifi_mgmr_event_init()
// Called from:
//      wifi_mgmr_start
word32 wifi_mgmr_event_init()
{
	bl_rx_sm_connect_ind_cb_register(0x00, &g_t2302853E);
	bl_rx_sm_disconnect_ind_cb_register(0x00, 0x230284A6);
	bl_rx_beacon_ind_cb_register(0x00, 587367542);
	bl_rx_probe_resp_ind_cb_register(&g_t23028466);
	bl_rx_rssi_cb_register(0x00, &g_t2302845C);
	return bl_rx_event_register(0x00, &g_t230285C4);
}

// 230286B4: void cmd_mgr_print(Register (ptr32 Eq_124510) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void cmd_mgr_print(struct Eq_124510 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArgA4, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a0_17;
	word32 s4_100;
	word32 s3_99;
	word32 s2_98;
	word32 a4_97;
	word32 a3_96;
	word32 a2_95;
	word32 a1_94;
	word32 s1_93;
	word32 s8_101;
	Eq_2 a5_22;
	xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_93, out a0_17, out a1_94, out a2_95, out a3_96, out a4_97, out a5_22, out s2_98, out s3_99, out s4_100, out s8_101);
	word32 s0_32 = *((word32) a5_22 + 16);
	while (a5_22 != s0_32 + 16)
		a5_22 = *a5_22;
	word32 s1_102;
	word32 a0_103;
	word32 a1_104;
	word32 a2_105;
	word32 a3_106;
	word32 a4_107;
	word32 a5_108;
	word32 a7_109;
	word32 s2_110;
	word32 s3_111;
	word32 s4_112;
	word32 s5_113;
	word32 s6_114;
	word32 s8_115;
	xQueueGenericSend(a0_17, 0x00, 0x00, s0_32 + 16, a5_22, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_102, out a0_103, out a1_104, out a2_105, out a3_106, out a4_107, out a5_108, out a7_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114, out s8_115);
}

