pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
Eq_2 g_t230286DC = 
	{
		111
	};
// 230286E4: Register Eq_2 cmd_complete.isra.1(Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_124602) a5, Register ptr32 mstatus, Stack (ptr32 Eq_124604) dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_124612 a4Out, Register out (ptr32 Eq_124613) a5Out)
// Called from:
//      cmd_mgr_msgind
//      cmd_mgr_llind
//      cmd_mgr_queue
Eq_2 cmd_complete.isra.1(Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, struct Eq_124602 * a5, ptr32 mstatus, struct Eq_124604 * dwArg04, Eq_2 dwArg24, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_124612 & a4Out, struct Eq_124613 & a5Out)
{
	struct Eq_124621 ** a4_5 = a5->ptr0000;
	a5->ptrFFFFFFFF = a4_5;
	struct Eq_124621 * a1_11 = *a4_5;
	a5->ptr0003 = a4_5;
	*a4_5 = (struct Eq_124621 **) &a5->ptrFFFFFFFF;
	*(struct Eq_124621 **) 0x00100100 = a1_11;
	*(struct Eq_124621 **) 0x00200204 = a1_11;
	Eq_2 a5_20 = (word32) a1_11->w0018;
	a1_11->w0018 = (word16) (a5_20 | 32);
	if ((a5_20 & 1) == 0x00)
	{
		if ((a5_20 & 0x18) != 0x00)
		{
			a0Out = a1;
			a3Out = a3;
			a4Out = a5_20 & 1;
			a5Out = a5_20 & 0x18;
			return s0;
		}
		else
		{
			a1_11->dw003C = 0x00;
			Eq_2 a0_31;
			Eq_2 a3_33;
			Eq_124612 a4_34;
			struct Eq_124613 * a5_35;
			word32 s1_102;
			word32 s2_103;
			word32 s3_104;
			word32 s4_105;
			Eq_2 s0_37 = xEventGroupSetBits(s0, (word32) a1 + 28, 0x01, a3, a5_20 & 1, mstatus, dwArg04, dwArg24, dwArg0138, dwArg0178, out s1_102, out a0_31, out a3_33, out a4_34, out a5_35, out s2_103, out s3_104, out s4_105);
			a0Out = a0_31;
			a3Out = a3_33;
			a4Out = a4_34;
			a5Out = a5_35;
			return s0_37;
		}
	}
	else
	{
		Eq_2 a3_49;
		Eq_124612 a4_50;
		struct Eq_124613 * a5_51;
		Eq_2 a0_54;
		Eq_2 s0_57;
		word32 s1_96;
		word32 a1_97;
		word32 a2_98;
		word32 a6_99;
		word32 s4_100;
		word32 t3_101;
		vPortFree(a1, a2, a5_20, mstatus, dwArg0158, dwArg0198, out s0_57, out s1_96, out a0_54, out a1_97, out a2_98, out a3_49, out a4_50, out a5_51, out a6_99, out s4_100, out t3_101);
		a0Out = a0_54;
		a3Out = a3_49;
		a4Out = a4_50;
		a5Out = a5_51;
		return s0_57;
	}
}

// 23028732: void cmd_mgr_msgind(Register word32 ra, Register (ptr32 Eq_124728) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void cmd_mgr_msgind(word32 ra, struct Eq_124728 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	word32 s1_345;
	word32 a1_346;
	word32 s8_347;
	Eq_2 a2_104;
	Eq_2 a0_132;
	Eq_2 a4_100;
	Eq_2 a5_117;
	struct Eq_124747 * s2_227;
	<anonymous> * s3_228;
	word32 s4_229;
	Eq_2 a3_105;
	Eq_2 s0_38 = xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_345, out a0_132, out a1_346, out a2_104, out a3_105, out a4_100, out a5_117, out s2_227, out s3_228, out s4_229, out s8_347);
	word32 s1_230 = *((word32) s0_38 + 16);
	struct Eq_124773 * sp_131 = fp + ~0x1F;
	Eq_2 s5_226 = s1_230 + 16;
	while (s0_38 != s5_226)
	{
		a4_100 = (word32) *((word32) s0_38 + 0x0A);
		a5_117 = (word32) s2_227->w0000;
		if (a4_100 == a5_117)
		{
			ui32 a5_54 = (word32) *((word32) s0_38 + 24);
			a5_117 = a5_54 & 0x10;
			if ((a5_54 & 0x10) == 0x00)
				goto l230287D6;
			if (s3_228 != null)
			{
				s3_228();
				if (a0_132 != 0x00)
					goto l230287D6;
			}
			Eq_2 s0_94 = *((word32) a0_132 + 16);
			((word32) s0_94 + 24)->u2 = (word16) ((word32) *((word32) s0_38 + 24) & ~0x10);
			if (a0_132 != 0x00)
			{
				a2_104 = (word32) s2_227->w0006;
				if (a2_104 != 0x00)
				{
					word32 a1_357;
					word32 a5_358;
					word32 a6_359;
					word32 a7_360;
					memcpy(a0_132, &s2_227->w0006 + 1, a2_104, out a1_357, out a2_104, out a3_105, out a4_100, out a5_358, out a6_359, out a7_360);
				}
			}
			ui32 a5_115 = (word32) *((word32) s0_94 + 24);
			a5_117 = a5_115 & 0x18;
			if ((a5_115 & 0x18) == 0x00)
			{
				word32 a3_356;
				cmd_complete.isra.1(s0_94, s0_94, a2_104, a3_105, a5_115 & 0x18, mstatus, sp_131->ptr0004, sp_131->t0024, sp_131->t0138, sp_131->t0158, sp_131->t0178, sp_131->t0198, out a0_132, out a3_356, out a4_100, out a5_117);
			}
			break;
		}
l230287D6:
		s0_38 = *s0_38;
	}
	word32 a3_169;
	word32 a4_170;
	word32 a5_171;
	<anonymous> * s3_177;
	word32 s4_178;
	word32 s5_179;
	word32 a2_351;
	word32 a7_352;
	word32 s8_355;
	word32 s2_353;
	word32 s6_354;
	word32 a0_349;
	word32 a1_350;
	word32 s1_348;
	xQueueGenericSend(a0_132, 0x00, 0x00, a4_100, a5_117, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_348, out a0_349, out a1_350, out a2_351, out a3_169, out a4_170, out a5_171, out a7_352, out s2_353, out s3_177, out s4_178, out s5_179, out s6_354, out s8_355);
	if (s5_179 == 0x00 && s3_177 != null)
		s3_177();
}

Eq_2 g_t23028756 = 
	{
		-0x006D
	};
// 230287EA: void cmd_mgr_llind(Register Eq_2 ra, Register (ptr32 Eq_124918) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s6, Register (ptr32 Eq_124604) s8, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void cmd_mgr_llind(Eq_2 ra, struct Eq_124918 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s6, struct Eq_124604 * s8, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	word32 a1_453;
	word32 s1_452;
	word32 s4_456;
	word32 a5_454;
	word32 s3_455;
	word32 s8_457;
	Eq_2 a2_130;
	Eq_2 a0_135;
	Eq_2 a4_113;
	Eq_2 a3_140;
	Eq_2 s2_249;
	Eq_2 s0_105 = xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_452, out a0_135, out a1_453, out a2_130, out a3_140, out a4_113, out a5_454, out s2_249, out s3_455, out s4_456, out s8_457);
	Eq_2 a5_103 = 0x00;
	Eq_2 s4_245 = (word32) *((word32) s0_105 + 16) + 16;
	struct Eq_124974 * s5_250 = &g_t4200F000;
	word32 s7_254 = 0x230AF000;
	while (s0_105 != s4_245)
	{
		if (a5_103 == 0x00)
		{
			s0_105 = *((word32) a3_140 + 20);
			a4_113 = *((word32) s2_249 + 20);
			if (a3_140 != a4_113)
				goto l23028862;
			a5_103 = s0_105;
			if (s0_105 != s2_249)
			{
				a4_113 = (word32) s5_250->b03B0;
				if (a4_113 == 0x00)
				{
					byte * s3_94;
					word32 s8_99;
					word32 s1_472;
					word32 s10_478;
					word32 s11_479;
					word32 t4_480;
					word32 s6_476;
					word32 s9_477;
					word32 a7_475;
					word32 a1_473;
					word32 a5_474;
					ra = printf(ra, s7_254 + -0x0790, a3_140, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_472, out a0_135, out a1_473, out a2_130, out a3_140, out a4_113, out a5_474, out a7_475, out s2_249, out s3_94, out s4_245, out s5_250, out s6_476, out s7_254, out s8_99, out s9_477, out s10_478, out s11_479, out t4_480);
					*s3_94 = (byte) s8_99;
					a5_103 = s0_105;
				}
			}
		}
		else
		{
l23028862:
			ui32 a4_67 = (word32) *((byte) s0_105.u0 + 24);
			a4_113 = a4_67 & 0x04;
			if ((a4_67 & 0x04) != 0x00)
			{
				if (a5_103 != 0x00)
					goto l2302886C;
				goto l23028888;
			}
		}
		s0_105 = *s0_105.u0;
	}
	s0_105.u0 = 0x00;
	if (a5_103 != 0x00)
	{
l2302886C:
		ui32 a5_112 = (word32) *((word32) s2_249 + 24);
		((word32) s2_249 + 24)->u2 = (word16) (a5_112 & -9);
		a4_113 = a5_112 & -9;
		a5_103 = a5_112 & 0x10;
		if ((a5_112 & 0x10) == 0x00)
			s0_105 = cmd_complete.isra.1(s0_105, s2_249, a2_130, a3_140, a5_112 & 0x10, mstatus, s8, dwLoc0C, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out a0_135, out a3_140, out a4_113, out a5_103);
		if (s0_105 != 0x00)
		{
l23028888:
			ui32 a5_155 = (word32) *((byte) s0_105.u0 + 24);
			((byte) s0_105.u0 + 24)->u2 = (word16) (a5_155 & ~0x04);
			uint32 a2_169 = (word32) (a5_155 & ~0x04)->w0006 + 0x08 << 16;
			Eq_2 a5_178;
			word32 t3_488;
			word32 s0_481;
			word32 a3_485;
			word32 a6_486;
			word32 s4_487;
			word32 a1_483;
			word32 a2_484;
			word32 s1_482;
			vPortFree(ipc_host_msg_push(a2_169 >> 16, a3_140, a4_113, out a5_178), a2_169 >> 16, a5_178, mstatus, dwArg0128, dwArg0168, out s0_481, out s1_482, out a0_135, out a1_483, out a2_484, out a3_485, out a4_113, out a5_103, out a6_486, out s4_487, out t3_488);
		}
	}
	word32 s8_471;
	word32 s6_470;
	word32 s3_467;
	word32 a4_463;
	word32 a0_459;
	word32 a1_460;
	word32 s1_458;
	word32 a3_462;
	word32 a5_464;
	word32 a7_465;
	word32 a2_461;
	word32 s4_468;
	word32 s5_469;
	word32 s2_466;
	xQueueGenericSend(a0_135, 0x00, 0x00, a4_113, a5_103, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_458, out a0_459, out a1_460, out a2_461, out a3_462, out a4_463, out a5_464, out a7_465, out s2_466, out s3_467, out s4_468, out s5_469, out s6_470, out s8_471);
	0x00 = (int8) dwArg0128;
}

