pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
Eq_2 g_t2302880A = 
	{
		-0x006D
	};
// 230288D2: void cmd_mgr_queue(Register (ptr32 Eq_125161) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void cmd_mgr_queue(struct Eq_125161 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	byte * s1_33;
	word32 s8_555;
	word32 a1_547;
	word32 a3_549;
	word32 a2_548;
	word32 a4_550;
	word32 a5_551;
	word32 s2_552;
	word32 s4_554;
	word32 s3_553;
	Eq_2 a0_25;
	Eq_2 s0_32 = xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_33, out a0_25, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551, out s2_552, out s3_553, out s4_554, out s8_555);
	Eq_2 a4_40 = (word32) *s1_33;
	if (a4_40 != 0x02)
	{
		Eq_2 s1_42 = *(union Eq_2 *) 0x12;
		if (s1_42 != 0x0E)
		{
			if (a4_40 == 0x02)
			{
				*(union Eq_2 *) 0x48 = s0_32;
				word32 s8_583;
				word32 s3_579;
				word32 s4_580;
				word32 s5_581;
				word32 s6_582;
				word32 s2_578;
				word32 a7_577;
				word32 a5_576;
				word32 a4_575;
				word32 a3_574;
				word32 s1_570;
				word32 a0_571;
				word32 a1_572;
				word32 a2_573;
				xQueueGenericSend(a0_25, 0x00, 0x00, a4_40, 0x0C, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_570, out a0_571, out a1_572, out a2_573, out a3_574, out a4_575, out a5_576, out a7_577, out s2_578, out s3_579, out s4_580, out s5_581, out s6_582, out s8_583);
				return;
			}
			if (((word32) *(union Eq_2 *) 0x1A & 0x0C) != 0x00)
				((word32) s0_32 + 24)->u2 = (word16) ((word32) *((word32) s0_32 + 24) | 4);
		}
		struct Eq_125300 * a5_59;
		ui32 a5_57 = (word32) *((word32) s0_32 + 24);
		if ((a5_57 & 2) == 0x00)
			a5_59 = a5_57 | 8;
		else
			a5_59 = a5_57 | 24;
		((word32) s0_32 + 24)->u2 = (word16) a5_59;
		Eq_2 a4_103 = (char *) a5_59 + 1;
		*((word32) a4_103 + 4) = a5_59->dw0004;
		a5_59->t0014 = s0_32;
		*(union Eq_2 *) 0x40 = s0_32;
		ui32 a5_70 = (word32) *((word32) s0_32 + 24);
		Eq_2 a5_71 = a5_70 & 0x01;
		if ((a5_70 & 0x01) == 0x00)
		{
			a0_25 = (word32) s0_32 + 28;
			s0_32 = xEventGroupCreateStatic((word32) s0_32 + 28, a4_103, mstatus, out a4_103, out a5_71);
		}
		struct Eq_125324 * s1_83 = *((word32) a5_71 + 20);
		*((word32) s0_32 + 20) = s1_83;
		*s0_32 = (word32) s1_42 + 16;
		*((word32) a5_71 + 4) = s0_32;
		*s0_32 = a5_71;
		*((word32) *((word32) a0_25 + 24) + 8) = s1_83->dw0008 + 0x01;
		Eq_2 a3_110;
		Eq_2 a4_111;
		struct Eq_125356 * a5_112;
		word32 s2_117;
		word32 s3_118;
		word32 s6_591;
		word32 s8_592;
		word32 a2_587;
		word32 a7_588;
		word32 s4_589;
		word32 s5_590;
		word32 s1_584;
		word32 a0_585;
		word32 a1_586;
		Eq_2 s0_115 = xQueueGenericSend(a0_25, 0x00, 0x00, a4_103, a5_71, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_584, out a0_585, out a1_586, out a2_587, out a3_110, out a4_111, out a5_112, out a7_588, out s2_117, out s3_118, out s4_589, out s5_590, out s6_591, out s8_592);
		if (s3_118 == 0x00)
		{
			uint32 a2_135 = (word32) a5_112->w0006 + 0x08 << 16;
			word32 a1_595;
			word32 a0_594;
			word32 a5_599;
			word32 a4_598;
			word32 s4_601;
			word32 t3_602;
			word32 a3_597;
			word32 a6_600;
			Eq_2 a5_140;
			word32 a2_596;
			word32 s1_593;
			vPortFree(ipc_host_msg_push(a2_135 >> 16, a3_110, a4_111, out a5_140), a2_135 >> 16, a5_140, mstatus, dwArg0138, dwArg0178, out s0_115, out s1_593, out a0_594, out a1_595, out a2_596, out a3_597, out a4_598, out a5_599, out a6_600, out s4_601, out t3_602);
		}
		if (((word32) *((word32) s0_115 + 24) & 0x01) == 0x00)
		{
			Eq_2 a5_176;
			struct Eq_125482 * s3_181;
			Eq_2 a4_175;
			Eq_2 a2_173;
			Eq_2 a3_174;
			ui32 a0_172 = xEventGroupWaitBits((word32) s0_115 + 28, 0x01, 0x01, 0x00, s2_117 + 1000000, mstatus, dwLoc08, dwArg0108, dwArg0148, out a2_173, out a3_174, out a4_175, out a5_176, out s3_181);
			if ((a0_172 & 0x01) == 0x00)
			{
				word32 s2_605;
				word32 a5_604;
				word32 s4_607;
				word32 s8_608;
				word32 a1_603;
				word32 s3_606;
				Eq_2 a2_193;
				Eq_2 a3_194;
				byte * s1_199;
				Eq_2 a0_191;
				Eq_2 a4_195;
				Eq_2 s0_198 = xQueueSemaphoreTake(a0_172 & 0x01, ~0x00, a2_173, a3_174, a4_175, a5_176, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_199, out a0_191, out a1_603, out a2_193, out a3_194, out a4_195, out a5_604, out s2_605, out s3_606, out s4_607, out s8_608);
				*s1_199 = 0x02;
				ui32 a5_208 = (word32) *((word32) s0_198 + 24);
				Eq_2 a5_209 = a5_208 & 32;
				if ((a5_208 & 32) == 0x00)
				{
					*(union Eq_2 *) 0xAA = s0_198;
					word32 a3_619;
					cmd_complete.isra.1(s0_198, s0_198, a2_193, a3_194, (struct Eq_124602 *) 110, mstatus, dwLoc1C, dwArg04, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out a0_191, out a3_619, out a4_195, out a5_209);
				}
				word32 s1_609;
				word32 a0_610;
				word32 a1_611;
				word32 a5_612;
				word32 a7_613;
				word32 s2_614;
				word32 s4_615;
				word32 s5_616;
				word32 s6_617;
				word32 s8_618;
				xQueueGenericSend(a0_191, 0x00, 0x00, a4_195, a5_209, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_609, out a0_610, out a1_611, out a2_173, out a3_174, out a4_175, out a5_612, out a7_613, out s2_614, out s3_181, out s4_615, out s5_616, out s6_617, out s8_618);
			}
			vEventGroupDelete(s3_181, a2_173, a3_174, a4_175, mstatus, dwLoc0C, dwArg14, dwArg0128, dwArg0138, dwArg0168, dwArg0178);
		}
		else
			((word32) s0_115 + 60)->u0 = 0x00;
	}
	else
	{
		*(union Eq_2 *) 0x5C = s0_32;
		word32 s4_566;
		word32 s5_567;
		word32 s6_568;
		word32 s8_569;
		word32 a5_562;
		word32 a7_563;
		word32 s2_564;
		word32 s3_565;
		word32 a4_561;
		word32 a3_560;
		word32 a2_559;
		word32 a1_558;
		word32 a0_557;
		word32 s1_556;
		xQueueGenericSend(a0_25, 0x00, 0x00, a4_40, 32, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_556, out a0_557, out a1_558, out a2_559, out a3_560, out a4_561, out a5_562, out a7_563, out s2_564, out s3_565, out s4_566, out s5_567, out s6_568, out s8_569);
	}
}

Eq_2 g_t230288EE = 
	{
		-0x0077
	};
// 23028A3C: void cmd_mgr_drain(Register (ptr32 Eq_125617) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register (ptr32 Eq_124604) s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void cmd_mgr_drain(struct Eq_125617 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, struct Eq_124604 * s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	struct Eq_125635 * a0_26;
	word32 s2_35;
	word32 s8_180;
	word32 s3_178;
	word32 a1_176;
	word32 s4_179;
	word32 a2_177;
	Eq_2 s1_34;
	Eq_2 a5_126;
	Eq_2 a4_127;
	Eq_2 a3_131;
	xQueueSemaphoreTake(a0->t0018, ~0x00, a2, a3, a4, a5, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_34, out a0_26, out a1_176, out a2_177, out a3_131, out a4_127, out a5_126, out s2_35, out s3_178, out s4_179, out s8_180);
	Eq_2 s4_125 = a0_26->dw0010 + 16;
	Eq_2 a0_44 = *s1_34;
	word32 s2_128 = s2_35 + 0x0100;
	word32 s3_129 = 0x00200200;
	while (a0_44 != s4_125)
	{
		Eq_2 a0_53 = *a4_127;
		*((word32) a5_126 + 4) = a4_127;
		*a4_127 = a5_126;
		*a0_53 = s2_128;
		*((word32) a0_53 + 4) = s3_129;
		Eq_2 s0_60 = *((word32) a5_126 + 8);
		*((word32) a5_126 + 7) = s0_60;
		ui32 a5_63 = (word32) *((word32) a0_53 + 24);
		a5_126 = a5_63 & 0x01;
		if ((a5_63 & 0x01) == 0x00)
		{
			word32 a0_195;
			xEventGroupSetBits(s0_60, (word32) a0_53 + 28, 0x01, a3_131, a4_127, mstatus, s4, dwArg04, dwArg0118, dwArg0158, out s1_34, out a0_195, out a3_131, out a4_127, out a5_126, out s2_128, out s3_129, out s4_125);
		}
		a0_44 = s1_34;
		s1_34 = *s1_34;
	}
	word32 a0_182;
	word32 s8_194;
	word32 s5_192;
	word32 s6_193;
	word32 s3_190;
	word32 s4_191;
	word32 a7_188;
	word32 s2_189;
	word32 a4_186;
	word32 a5_187;
	word32 a2_184;
	word32 a3_185;
	word32 a1_183;
	word32 s1_181;
	xQueueGenericSend(a0_44, 0x00, 0x00, a4_127, a5_126, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_181, out a0_182, out a1_183, out a2_184, out a3_185, out a4_186, out a5_187, out a7_188, out s2_189, out s3_190, out s4_191, out s5_192, out s6_193, out s8_194);
}

Eq_2 g_t23028A68 = 
	{
		-0x006D
	};
// 23028AB6: Register word32 bl_cmd_mgr_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      bl_ipc_init
word32 bl_cmd_mgr_init(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out, ptr32 & s2Out)
{
	*((word32) a0 + 32) = a0;
	*((word32) a0 + 36) = a0;
	ptr32 a3_19;
	ptr32 s2_24;
	struct Eq_125770 * a0_30;
	word32 a1_71;
	word32 a4_72;
	word32 a5_73;
	word32 s3_74;
	word32 s1_23 = xQueueCreateMutex(ra, a3, a4, (word32) a0 + 16, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_30, out a1_71, out a3_19, out a4_72, out a5_73, out s2_24, out s3_74);
	*(union Eq_2 *) 0x14 = a0;
	g_t230288EE = a0;
	g_t230286DC = a0;
	g_t23028A68 = a0;
	g_t2302880A = a0;
	a0_30->t0018 = a0;
	g_t23028756 = a0;
	a3Out = a3_19;
	s2Out = s2_24;
	return s1_23;
}

