pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23028B0C: Register word32 bl_irqs_init()
// Called from:
//      bl_main_lowlevel_init
word32 bl_irqs_init()
{
	return 0x00;
}

// 23028B10: Register Eq_2 bl_irq_bottomhalf(Register Eq_2 ra, Register ptr32 s0, Register (ptr32 Eq_58770) a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s4, Register Eq_58767 s6, Register ptr32 mstatus, Stack word32 dwArg18, Stack ptr32 dwArg38, Stack Eq_2 dwArg78, Stack word32 dwArg98, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_main_event_handle
Eq_2 bl_irq_bottomhalf(Eq_2 ra, ptr32 s0, struct Eq_58770 * a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s4, Eq_58767 s6, ptr32 mstatus, word32 dwArg18, ptr32 dwArg38, Eq_2 dwArg78, word32 dwArg98, union Eq_2 & a0Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	word32 a5_166;
	Eq_2 a0_12 = xTaskGetTickCount(out a5_166);
	Eq_2 s0_14 = *((word32) a0_12 + 52);
	ui32 s1_15 = 0x00;
	Eq_2 a0_16 = ipc_host_get_rawstatus(a0_12);
	do
	{
		while (a0_16 != 0x00)
		{
			Eq_2 a0_46;
			ra = ipc_host_irq(ra, s1_15 | a0_16, a0_16, a0_16, a2, a3, a4, s2, s4, s6, mstatus, dwLoc10, s0, dwArg18, dwArg38, dwArg78, dwArg98, out s1_15, out a0_46, out a2, out a3, out a4, out s2, out s4, out s6, out mstatus);
			s0_14 = *((word32) a0_46 + 52);
			a0_16 = ipc_host_get_rawstatus(a0_46);
		}
		word32 a5_167;
		Eq_2 a0_56 = xTaskGetTickCount(out a5_167);
		if ((s1_15 & 8) != 0x00)
			*((word32) a0_56 + 60) = s0_14;
		if ((s1_15 & 0x0780) != 0x00)
			*((word32) a0_56 + 64) = s0_14;
		ipc_host_enable_irq((struct Eq_97413 *) 0x07FF);
		s0_14 = *((word32) a0_56 + 52);
		a0_16 = ipc_host_get_rawstatus(a0_56);
	} while (a0_16 != 0x00);
	a0Out = a0_16;
	a4Out = a4;
	mstatusOut = mstatus;
	return ra;
}

// 23028B6A: Register Eq_2 goToErrorState(Register Eq_2 a5)
// Called from:
//      stateM_handleEvent
Eq_2 goToErrorState(Eq_2 a5)
{
	*((word32) a5 + 4) = *a5;
	word32 a0_7 = *((word32) a5 + 8);
	*a5 = a0_7;
	if (a5 == 0x00)
		return a5;
	<anonymous> * t1_9 = *((word32) a5 + 20);
	if (t1_9 == null)
		return a5;
	Eq_2 a5_13;
	word32 t1_14;
	t1_9();
	return a5_13;
}

// 23028B82: void stateM_init(Register (ptr32 Eq_113949) a0, Register (ptr32 (ptr32 Eq_113949)) a1, Register (ptr32 Eq_113951) a2)
// Called from:
//      wifi_mgmr_start
void stateM_init(struct Eq_113949 * a0, struct Eq_113949 ** a1, struct Eq_113951 * a2)
{
	if (a0 != null)
	{
		*a1 = (struct Eq_113949 **) a0;
		a0->dw0004 = 0x00;
		a2->ptr0008 = a0;
	}
}

// 23028B8E: Register Eq_2 stateM_handleEvent(Register Eq_2 ra, Register (ptr32 Eq_114110) s1, Register word32 a0, Register (ptr32 Eq_114241) a1, Register word32 a2, Register Eq_2 a5, Register out (ptr32 Eq_114110) s0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_start
Eq_2 stateM_handleEvent(Eq_2 ra, struct Eq_114110 * s1, word32 a0, struct Eq_114241 * a1, word32 a2, Eq_2 a5, struct Eq_114110 & s0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return ra;
	}
	else
	{
		word32 a0_119 = ~0x01;
		if (a1 != null)
		{
			word32 s0_224 = s1->dw0000;
			struct Eq_114241 * s2_117 = a1;
			if (s1 == null)
			{
l23028BAC:
				a5 = goToErrorState(a5);
			}
			else
			{
				word32 s5_123 = 0x14;
				if (a5 != 0x00)
				{
					do
					{
						Eq_2 s4_122 = 0x00;
						while (true)
						{
							word32 * s1_31 = *((word32) a5 + 0x0C);
							if (s4_122 >= a5)
								break;
							struct Eq_125951 * s3_107 = (word32) a5 + ((word32) s4_122 + s5_123);
							word32 s1_35 = *((word32) a5 + 8);
							a4 = s3_107->dw0000;
							a5 = s2_117->dw0000;
							if (a4 == a5)
							{
								a5 = s3_107[8];
								if (a5 == 0x00)
								{
l23028C08:
									if (s3_107[16] == 0x00)
										goto l23028BAC;
									do
									{
										Eq_2 s1_129 = *((word32) a5 + 4);
									} while (a5 != 0x00);
									Eq_126000 s0_70 = *a5;
									if (a5 != s1_129 && a4 != 0x00)
									{
										word32 t3_101;
										word32 s8_102;
										word32 a6_103;
										word32 tp_105;
										word32 t1_243;
										a4();
									}
									a5 = s3_107[0x0C];
									if (a5 != 0x00)
									{
										word32 t1_244;
										word32 t3_136;
										word32 s8_137;
										word32 a6_138;
										word32 a2_139;
										word32 tp_140;
										a5();
									}
									Eq_126017 s0_144 = *a5;
									if (a5 != s1_129)
									{
										s1_129 = *((word32) a5 + 20);
										if (a5 != 0x00)
										{
											word32 t1_245;
											word32 t3_168;
											word32 s8_169;
											word32 a6_170;
											word32 a2_171;
											word32 tp_172;
											a5();
										}
									}
									Eq_126028 s0_176 = *a5;
									*s1_129 = s0_176;
									*((word32) a5 + 4) = s0_176;
									goto l23028BB6;
								}
								word32 t3_57;
								word32 s8_58;
								word32 a6_59;
								word32 tp_61;
								word32 t1_242;
								a5();
								if (a0_119 != 0x00)
									goto l23028C08;
							}
							s4_122 = (word32) s4_122 + 1;
						}
					} while (*s1_31 != 0x00);
				}
			}
		}
l23028BB6:
		s0Out = s1;
		a4Out = a4;
		a5Out = a5;
		s4Out = dwArg04;
		return ra;
	}
}

// 23028C68: void netif_status_callback(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void netif_status_callback(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	Eq_2 a3_17;
	word32 a5_339;
	word32 a4_338;
	word32 a2_337;
	ip4addr_ntoa(out a2_337, out a3_17, out a4_338, out a5_339);
	word32 a3_344;
	word32 a2_343;
	word32 a1_342;
	word32 s1_340;
	word32 a0_341;
	word32 a4_345;
	word32 a5_346;
	word32 a7_347;
	word32 s2_348;
	word32 s3_349;
	word32 s4_350;
	word32 s5_351;
	word32 s6_352;
	word32 s7_353;
	word32 s8_354;
	word32 s9_355;
	word32 s10_356;
	word32 s11_357;
	word32 t4_358;
	Eq_2 ra_40 = printf(ra, &g_t230B4C9C, a3_17, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_340, out a0_341, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346, out a7_347, out s2_348, out s3_349, out s4_350, out s5_351, out s6_352, out s7_353, out s8_354, out s9_355, out s10_356, out s11_357, out t4_358);
	Eq_2 a3_58;
	word32 a2_359;
	word32 a4_360;
	word32 a5_361;
	ip4addr_ntoa(out a2_359, out a3_58, out a4_360, out a5_361);
	word32 s1_362;
	word32 a0_363;
	word32 a1_364;
	word32 a2_365;
	word32 a3_366;
	word32 a4_367;
	word32 a5_368;
	word32 a7_369;
	word32 s2_370;
	word32 s3_371;
	word32 s4_372;
	word32 s5_373;
	word32 s6_374;
	word32 s7_375;
	word32 s8_376;
	word32 s9_377;
	word32 s10_378;
	word32 s11_379;
	word32 t4_380;
	Eq_2 ra_81 = printf(ra_40, &g_ptr230B4CC8, a3_58, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_362, out a0_363, out a1_364, out a2_365, out a3_366, out a4_367, out a5_368, out a7_369, out s2_370, out s3_371, out s4_372, out s5_373, out s6_374, out s7_375, out s8_376, out s9_377, out s10_378, out s11_379, out t4_380);
	Eq_2 a3_99;
	word32 a2_381;
	word32 a4_382;
	word32 a5_383;
	ip4addr_ntoa(out a2_381, out a3_99, out a4_382, out a5_383);
	word32 a5_115;
	Eq_2 a3_119;
	word32 s1_123;
	Eq_2 s4_128;
	word32 a0_384;
	word32 a1_385;
	word32 a2_386;
	word32 a4_387;
	word32 a7_388;
	word32 s2_389;
	word32 s3_390;
	word32 s5_391;
	word32 s6_392;
	word32 s7_393;
	word32 s8_394;
	word32 s9_395;
	word32 s10_396;
	word32 s11_397;
	word32 t4_398;
	Eq_2 ra_122 = printf(ra_81, &g_t230B4CD4, a3_99, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_123, out a0_384, out a1_385, out a2_386, out a3_119, out a4_387, out a5_115, out a7_388, out s2_389, out s3_390, out s4_128, out s5_391, out s6_392, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398);
	if (s1_123 == 0x00 || a5_115 == 0x00)
	{
		word32 s1_399;
		word32 a0_400;
		word32 a1_401;
		word32 a2_402;
		word32 a3_403;
		word32 a4_404;
		word32 a5_405;
		word32 a7_406;
		word32 s2_407;
		word32 s3_408;
		word32 s4_409;
		word32 s5_410;
		word32 s6_411;
		word32 s7_412;
		word32 s8_413;
		word32 s9_414;
		word32 s10_415;
		word32 s11_416;
		word32 t4_417;
		printf(ra_122, &g_t230B4CE0, a3_119, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_399, out a0_400, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405, out a7_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s8_413, out s9_414, out s10_415, out s11_416, out t4_417);
	}
	else
	{
		Eq_2 a1_139;
		Eq_2 a3_141;
		ptr32 mstatus_146;
		Eq_2 ra_147 = wifi_mgmr_api_ip_update(ra_122, s4_128, mstatus, dwLoc08, dwArg20, dwArg24, dwArg48, dwArg54, ra, dwArg70, dwArg74, dwArg98, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out a1_139, out a3_141, out mstatus_146);
		dns_getserver(0x00);
		dns_getserver(0x01);
		wifi_mgmr_api_ip_got(ra_147, dwArg04, mstatus_146, dwArg10, dwArg14, dwArg38, dwArg44, dwArg5C, a3_141, a1_139, dwArg88, dwArgB8, dwArgD8, dwArgF8, dwArg0118);
	}
}

