pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23028D04: void wifi_tx(Register Eq_2 ra, Register (ptr32 Eq_106155) a0, Register Eq_2 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack word32 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgC8)
void wifi_tx(Eq_2 ra, struct Eq_106155 * a0, Eq_2 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, word32 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgC8)
{
	Eq_2 a3_11 = (word32) *((word32) a1 + 8);
	Eq_2 a5_14 = a1;
	if (a3_11 > 1514)
	{
		word32 * a5_66;
		Eq_2 a0_65 = xTaskGetTickCount(out a5_66);
		word32 s0_67 = *a5_66;
		if (a0_65 - a5_66 > 2000)
		{
			word32 s1_189;
			word32 a0_190;
			word32 a1_191;
			word32 a2_192;
			word32 a3_193;
			word32 a4_194;
			word32 a5_195;
			word32 a7_196;
			word32 s2_197;
			word32 s3_198;
			word32 s4_199;
			word32 s5_200;
			word32 s6_201;
			word32 s7_202;
			word32 s8_203;
			word32 s9_204;
			word32 s10_205;
			word32 s11_206;
			word32 t4_207;
			printf(ra, &g_t230B4D08, a3_11, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_189, out a0_190, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a7_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203, out s9_204, out s10_205, out s11_206, out t4_207);
			word32 a5_208;
			*xTaskGetTickCount(out a5_208) = s0_67;
		}
	}
	else
	{
		do
			a5_14 = *a5_14;
		while (a5_14 != 0x00);
		bl_output(ra, g_ptr4200F3B4, a0, a1, (word32) (a0->tFFFFFFE0 < 1), s2, mstatus, dwLoc18, dwLoc08, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg84, dwArg88, dwArgA0, dwArgA4, dwArgC8);
	}
}

struct Eq_126409 * g_ptr23028D1C = &g_t4200F437;
// 23028D82: void bl606a0_wifi_netif_init(Register (ptr32 Eq_126409) a0)
void bl606a0_wifi_netif_init(struct Eq_126409 * a0)
{
	g_ptr230B4CC8 = a0;
	a0->w0038 = 1500;
	a0->w0040 = 64006;
	g_ptr2306E522 = a0;
	g_ptr23028D1C = a0;
	netif_set_status_callback(a0, &g_t23028C68);
}

// 23028DCA: Register Eq_2 bl606a0_wifi_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_mgmr_drv_init
Eq_2 bl606a0_wifi_init(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & mstatusOut)
{
	byte bLoc16_204 = SLICE(dwLoc18, byte, 16);
	word32 s1_235;
	word32 a0_236;
	word32 a1_237;
	word32 a2_238;
	word32 a3_239;
	word32 a4_240;
	word32 a5_241;
	word32 a7_242;
	word32 s2_243;
	word32 s3_244;
	word32 s4_245;
	word32 s5_246;
	word32 s6_247;
	word32 s7_248;
	word32 s8_249;
	word32 s9_250;
	word32 s10_251;
	word32 s11_252;
	word32 t4_253;
	word32 t1_254;
	word32 a0_255;
	word32 a1_256;
	word32 a2_257;
	word32 a3_258;
	word32 a4_259;
	word32 a5_260;
	Eq_2 ra_44 = memset(printf(ra, &g_t230B4C10, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_235, out a0_236, out a1_237, out a2_238, out a3_239, out a4_240, out a5_241, out a7_242, out s2_243, out s3_244, out s4_245, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out t4_253), fp + ~0x17, 0x00, 0x06, out t1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260);
	bl_wifi_mac_addr_get(fp + ~0x17);
	Eq_2 a3_96;
	union Eq_2 * a4_127;
	Eq_2 s1_130;
	Eq_2 s2_133;
	word32 s1_261;
	word32 a0_262;
	word32 a1_263;
	word32 a2_264;
	word32 a3_265;
	word32 a4_266;
	word32 a5_267;
	word32 a7_268;
	word32 s2_269;
	word32 s3_270;
	word32 s4_271;
	word32 s5_272;
	word32 s6_273;
	word32 s7_274;
	word32 s8_275;
	word32 s9_276;
	word32 s10_277;
	word32 s11_278;
	word32 t4_279;
	word32 a4_280;
	word32 a5_281;
	word32 s3_282;
	word32 a0_283;
	word32 a1_284;
	word32 a2_285;
	word32 a3_286;
	word32 a5_287;
	word32 a7_288;
	word32 s3_289;
	word32 s4_290;
	word32 s5_291;
	word32 s6_292;
	word32 s7_293;
	word32 s8_294;
	word32 s9_295;
	word32 s10_296;
	word32 s11_297;
	word32 t4_298;
	Eq_2 ra_129 = printf(bl_msg_update_channel_cfg(printf(ra_44, &g_t230B4C28, (word32) bLoc16_204, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_261, out a0_262, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out a7_268, out s2_269, out s3_270, out s4_271, out s5_272, out s6_273, out s7_274, out s8_275, out s9_276, out s10_277, out s11_278, out t4_279), a0, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out a3_96, out a4_280, out a5_281, out s3_282), &g_t230B4C5C, a3_96, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_130, out a0_283, out a1_284, out a2_285, out a3_286, out a4_127, out a5_287, out a7_288, out s2_133, out s3_289, out s4_290, out s5_291, out s6_292, out s7_293, out s8_294, out s9_295, out s10_296, out s11_297, out t4_298);
	bl_wifi_clock_enable(a4_127);
	ptr32 mstatus_169;
	ptr32 s0_171;
	word32 t1_299;
	word32 a0_300;
	word32 a1_301;
	word32 a2_302;
	word32 a3_303;
	word32 a4_304;
	word32 a5_305;
	Eq_2 ra_170 = bl_main_rtthread_start(memset(ra_129, 0x4200F3B4, 0x00, 0x04, out t1_299, out a0_300, out a1_301, out a2_302, out a3_303, out a4_304, out a5_305), s1_130, s2_133, mstatus, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg3C, dwArg58, ra, dwArg78, dwArg7C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out s0_171, out mstatus_169);
	s0Out = s0_171;
	mstatusOut = mstatus_169;
	return ra_170;
}

// 23028E48: void lld_wlcoex_set(Register word32 a0, Register (ptr32 Eq_126631) a4)
// Called from:
//      lld_init
//      lld_core_reset
void lld_wlcoex_set(word32 a0, struct Eq_126631 * a4)
{
	int32 a4_14;
	struct Eq_126633 * a5_5 = a4->ptr0074;
	(a4 & ~0x001F0000)->ptr0074 = a5_5;
	int32 a4_10 = a5_5->dw0100;
	if (a0 != 0x00)
		a4_14 = a4_10 | 0x002200F3;
	else
		a4_14 = a4_10 & ~0x002200F3;
	a5_5->dw0100 = a4_14;
}

