pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23028E7A: void coex_dump_ble(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
// Called from:
//      cmd_coex_dump
void coex_dump_ble(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	word32 a0_402;
	word32 a1_403;
	word32 a2_404;
	word32 a4_405;
	word32 a5_406;
	word32 s4_407;
	word32 s8_408;
	puts(0x230B4D30, out a0_402, out a1_403, out a2_404, out a4_405, out a5_406, out s4_407, out s8_408);
	Eq_2 a3_30;
	Eq_2 a3_57;
	Eq_2 a3_83;
	Eq_2 a3_109;
	Eq_2 a3_135;
	Eq_2 a3_161;
	Eq_2 a3_187;
	Eq_2 a3_213;
	Eq_2 a3_239;
	Eq_2 a3_265;
	Eq_2 a3_291;
	Eq_2 a3_317;
	Eq_2 a3_343;
	word32 s1_409;
	word32 a0_410;
	word32 a1_411;
	word32 a2_412;
	word32 a4_413;
	word32 a5_414;
	word32 a7_415;
	word32 s2_416;
	word32 s3_417;
	word32 s4_418;
	word32 s5_419;
	word32 s6_420;
	word32 s7_421;
	word32 s8_422;
	word32 s9_423;
	word32 s10_424;
	word32 s11_425;
	word32 t4_426;
	word32 s1_427;
	word32 a0_428;
	word32 a1_429;
	word32 a2_430;
	word32 a4_431;
	word32 a5_432;
	word32 a7_433;
	word32 s2_434;
	word32 s3_435;
	word32 s4_436;
	word32 s5_437;
	word32 s6_438;
	word32 s7_439;
	word32 s8_440;
	word32 s9_441;
	word32 s10_442;
	word32 s11_443;
	word32 t4_444;
	word32 s1_445;
	word32 a0_446;
	word32 a1_447;
	word32 a2_448;
	word32 a4_449;
	word32 a5_450;
	word32 a7_451;
	word32 s2_452;
	word32 s3_453;
	word32 s4_454;
	word32 s5_455;
	word32 s6_456;
	word32 s7_457;
	word32 s8_458;
	word32 s9_459;
	word32 s10_460;
	word32 s11_461;
	word32 t4_462;
	word32 s1_463;
	word32 a0_464;
	word32 a1_465;
	word32 a2_466;
	word32 a4_467;
	word32 a5_468;
	word32 a7_469;
	word32 s2_470;
	word32 s3_471;
	word32 s4_472;
	word32 s5_473;
	word32 s6_474;
	word32 s7_475;
	word32 s8_476;
	word32 s9_477;
	word32 s10_478;
	word32 s11_479;
	word32 t4_480;
	word32 s1_481;
	word32 a0_482;
	word32 a1_483;
	word32 a2_484;
	word32 a4_485;
	word32 a5_486;
	word32 a7_487;
	word32 s2_488;
	word32 s3_489;
	word32 s4_490;
	word32 s5_491;
	word32 s6_492;
	word32 s7_493;
	word32 s8_494;
	word32 s9_495;
	word32 s10_496;
	word32 s11_497;
	word32 t4_498;
	word32 s1_499;
	word32 a0_500;
	word32 a1_501;
	word32 a2_502;
	word32 a4_503;
	word32 a5_504;
	word32 a7_505;
	word32 s2_506;
	word32 s3_507;
	word32 s4_508;
	word32 s5_509;
	word32 s6_510;
	word32 s7_511;
	word32 s8_512;
	word32 s9_513;
	word32 s10_514;
	word32 s11_515;
	word32 t4_516;
	word32 s1_517;
	word32 a0_518;
	word32 a1_519;
	word32 a2_520;
	word32 a4_521;
	word32 a5_522;
	word32 a7_523;
	word32 s2_524;
	word32 s3_525;
	word32 s4_526;
	word32 s5_527;
	word32 s6_528;
	word32 s7_529;
	word32 s8_530;
	word32 s9_531;
	word32 s10_532;
	word32 s11_533;
	word32 t4_534;
	word32 s1_535;
	word32 a0_536;
	word32 a1_537;
	word32 a2_538;
	word32 a4_539;
	word32 a5_540;
	word32 a7_541;
	word32 s2_542;
	word32 s3_543;
	word32 s4_544;
	word32 s5_545;
	word32 s6_546;
	word32 s7_547;
	word32 s8_548;
	word32 s9_549;
	word32 s10_550;
	word32 s11_551;
	word32 t4_552;
	word32 s1_553;
	word32 a0_554;
	word32 a1_555;
	word32 a2_556;
	word32 a4_557;
	word32 a5_558;
	word32 a7_559;
	word32 s2_560;
	word32 s3_561;
	word32 s4_562;
	word32 s5_563;
	word32 s6_564;
	word32 s7_565;
	word32 s8_566;
	word32 s9_567;
	word32 s10_568;
	word32 s11_569;
	word32 t4_570;
	word32 s1_571;
	word32 a0_572;
	word32 a1_573;
	word32 a2_574;
	word32 a4_575;
	word32 a5_576;
	word32 a7_577;
	word32 s2_578;
	word32 s3_579;
	word32 s4_580;
	word32 s5_581;
	word32 s6_582;
	word32 s7_583;
	word32 s8_584;
	word32 s9_585;
	word32 s10_586;
	word32 s11_587;
	word32 t4_588;
	word32 s1_589;
	word32 a0_590;
	word32 a1_591;
	word32 a2_592;
	word32 a4_593;
	word32 a5_594;
	word32 a7_595;
	word32 s2_596;
	word32 s3_597;
	word32 s4_598;
	word32 s5_599;
	word32 s6_600;
	word32 s7_601;
	word32 s8_602;
	word32 s9_603;
	word32 s10_604;
	word32 s11_605;
	word32 t4_606;
	word32 s1_607;
	word32 a0_608;
	word32 a1_609;
	word32 a2_610;
	word32 a4_611;
	word32 a5_612;
	word32 a7_613;
	word32 s2_614;
	word32 s3_615;
	word32 s4_616;
	word32 s5_617;
	word32 s6_618;
	word32 s7_619;
	word32 s8_620;
	word32 s9_621;
	word32 s10_622;
	word32 s11_623;
	word32 t4_624;
	word32 s1_625;
	word32 a0_626;
	word32 a1_627;
	word32 a2_628;
	word32 a4_629;
	word32 a5_630;
	word32 a7_631;
	word32 s2_632;
	word32 s3_633;
	word32 s4_634;
	word32 s5_635;
	word32 s6_636;
	word32 s7_637;
	word32 s8_638;
	word32 s9_639;
	word32 s10_640;
	word32 s11_641;
	word32 t4_642;
	Eq_2 ra_346 = printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(printf(ra, &g_t230B4D68, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_409, out a0_410, out a1_411, out a2_412, out a3_30, out a4_413, out a5_414, out a7_415, out s2_416, out s3_417, out s4_418, out s5_419, out s6_420, out s7_421, out s8_422, out s9_423, out s10_424, out s11_425, out t4_426), &g_t230B4D7C, a3_30, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_427, out a0_428, out a1_429, out a2_430, out a3_57, out a4_431, out a5_432, out a7_433, out s2_434, out s3_435, out s4_436, out s5_437, out s6_438, out s7_439, out s8_440, out s9_441, out s10_442, out s11_443, out t4_444), &g_t230B4D94, a3_57, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_445, out a0_446, out a1_447, out a2_448, out a3_83, out a4_449, out a5_450, out a7_451, out s2_452, out s3_453, out s4_454, out s5_455, out s6_456, out s7_457, out s8_458, out s9_459, out s10_460, out s11_461, out t4_462), &g_t230B4DAC, a3_83, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_463, out a0_464, out a1_465, out a2_466, out a3_109, out a4_467, out a5_468, out a7_469, out s2_470, out s3_471, out s4_472, out s5_473, out s6_474, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480), &g_t230B4DC4, a3_109, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_481, out a0_482, out a1_483, out a2_484, out a3_135, out a4_485, out a5_486, out a7_487, out s2_488, out s3_489, out s4_490, out s5_491, out s6_492, out s7_493, out s8_494, out s9_495, out s10_496, out s11_497, out t4_498), &g_t230B4DD8, a3_135, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_499, out a0_500, out a1_501, out a2_502, out a3_161, out a4_503, out a5_504, out a7_505, out s2_506, out s3_507, out s4_508, out s5_509, out s6_510, out s7_511, out s8_512, out s9_513, out s10_514, out s11_515, out t4_516), &g_t230B4DEC, a3_161, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_517, out a0_518, out a1_519, out a2_520, out a3_187, out a4_521, out a5_522, out a7_523, out s2_524, out s3_525, out s4_526, out s5_527, out s6_528, out s7_529, out s8_530, out s9_531, out s10_532, out s11_533, out t4_534), &g_t230B4E00, a3_187, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_535, out a0_536, out a1_537, out a2_538, out a3_213, out a4_539, out a5_540, out a7_541, out s2_542, out s3_543, out s4_544, out s5_545, out s6_546, out s7_547, out s8_548, out s9_549, out s10_550, out s11_551, out t4_552), &g_t230B4E14, a3_213, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_553, out a0_554, out a1_555, out a2_556, out a3_239, out a4_557, out a5_558, out a7_559, out s2_560, out s3_561, out s4_562, out s5_563, out s6_564, out s7_565, out s8_566, out s9_567, out s10_568, out s11_569, out t4_570), &g_t230B4E28, a3_239, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_571, out a0_572, out a1_573, out a2_574, out a3_265, out a4_575, out a5_576, out a7_577, out s2_578, out s3_579, out s4_580, out s5_581, out s6_582, out s7_583, out s8_584, out s9_585, out s10_586, out s11_587, out t4_588), &g_t230B4E3C, a3_265, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_589, out a0_590, out a1_591, out a2_592, out a3_291, out a4_593, out a5_594, out a7_595, out s2_596, out s3_597, out s4_598, out s5_599, out s6_600, out s7_601, out s8_602, out s9_603, out s10_604, out s11_605, out t4_606), &g_t230B4E50, a3_291, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_607, out a0_608, out a1_609, out a2_610, out a3_317, out a4_611, out a5_612, out a7_613, out s2_614, out s3_615, out s4_616, out s5_617, out s6_618, out s7_619, out s8_620, out s9_621, out s10_622, out s11_623, out t4_624), &g_t230B4E64, a3_317, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_625, out a0_626, out a1_627, out a2_628, out a3_343, out a4_629, out a5_630, out a7_631, out s2_632, out s3_633, out s4_634, out s5_635, out s6_636, out s7_637, out s8_638, out s9_639, out s10_640, out s11_641, out t4_642);
	word32 s1_643;
	word32 a0_644;
	word32 a1_645;
	word32 a2_646;
	word32 a3_647;
	word32 a4_648;
	word32 a5_649;
	word32 a7_650;
	word32 s2_651;
	word32 s3_652;
	word32 s4_653;
	word32 s5_654;
	word32 s6_655;
	word32 s7_656;
	word32 s8_657;
	word32 s9_658;
	word32 s10_659;
	word32 s11_660;
	word32 t4_661;
	printf(ra_346, &g_t230B4E78, a3_343, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_643, out a0_644, out a1_645, out a2_646, out a3_647, out a4_648, out a5_649, out a7_650, out s2_651, out s3_652, out s4_653, out s5_654, out s6_655, out s7_656, out s8_657, out s9_658, out s10_659, out s11_660, out t4_661);
}

// 23028F92: void BLE_ROM_patch()
void BLE_ROM_patch()
{
}

// 23028FA8: void blecontroller_main(Register word32 ra, Register word32 s0, Register word32 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 mstatus)
void blecontroller_main(word32 ra, word32 s0, word32 s1, Eq_2 a3, Eq_2 a4, Eq_2 s5, ptr32 mstatus)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	struct Eq_127258 * sp_16;
	Eq_2 a5_17;
	Eq_2 ra_20;
	a5_5();
	struct Eq_127261 * s1_24 = &g_t42025000;
	while (true)
	{
		Eq_2 a0_36;
		word32 a1_130;
		word32 a2_131;
		word32 a3_132;
		word32 a4_133;
		word32 a5_134;
		word32 s8_135;
		Eq_2 s1_45;
		Eq_2 s2_46;
		Eq_2 s3_47;
		Eq_2 s4_48;
		Eq_2 s0_44 = xQueueReceive(s1_24->t0718, &sp_16->t0008, ~0x00, a3, a4, a5_17, mstatus, sp_16->t0008, sp_16->t0024, sp_16->t00A4, sp_16->t0118, sp_16->t0158, out s1_45, out a0_36, out a1_130, out a2_131, out a3_132, out a4_133, out a5_134, out s2_46, out s3_47, out s4_48, out s8_135);
		if (a0_36 == s0_44 && (word32) sp_16->t0008 == s0_44)
			ra_20 = hci_send_2_controller(ra_20, s0_44, s1_45, a0_36, s2_46, s3_47, s4_48, s5, sp_16->t0010, out s0_44, out s1_45, out s2_46, out s3_47, out s4_48, out s5, out mstatus);
		ra_20 = rwip_schedule(ra_20, s0_44, s1_45, s2_46, s3_47, s4_48, s5, out s1_24, out a3, out a4, out a5_17, out s5);
	}
}

// 23028FEA: void BLE_ROM_hook_init()
// Called from:
//      ble_controller_init
void BLE_ROM_hook_init()
{
	g_ptr4200F3C8 = &g_t23028F92;
	g_ptr4200F3D0 = &g_t230A382C;
	g_ptr4200F3D4 = &g_t230A3A68;
	g_ptr4200F3CC = &g_t230A37A4;
	g_ptr4200F3D8 = &g_t23029064;
}

// 2302903C: Register word32 rw_main_task_post(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out (ptr32 Eq_127413) a1Out, Register out Eq_2 a4Out)
// Called from:
//      rw_main_task_post_from_fw
//      bt_onchiphci_send
word32 rw_main_task_post(Eq_2 a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, struct Eq_127413 & a1Out, union Eq_2 & a4Out)
{
	if (a0 == 0x00)
	{
		a0Out = 0x00;
		a1Out = a1;
		a4Out = a4;
		return s1;
	}
	else
	{
		up32 a0_17;
		struct Eq_127413 * a1_18;
		Eq_2 a4_21;
		word32 s1_26;
		word32 a2_99;
		word32 a3_100;
		word32 a5_101;
		word32 a7_102;
		word32 s2_103;
		word32 s3_104;
		word32 s4_105;
		word32 s5_106;
		word32 s6_107;
		word32 s8_108;
		xQueueGenericSend(g_t42025718, a0, 0x00, a4, 0x42025000, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_26, out a0_17, out a1_18, out a2_99, out a3_100, out a4_21, out a5_101, out a7_102, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s8_108);
		a0Out = (word32) (a0_17 < ~0x01);
		a1Out = a1_18;
		a4Out = a4_21;
		return s1_26;
	}
}

// 23029064: void rw_main_task_post_from_fw(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void rw_main_task_post_from_fw(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 dwLoc18_91 = SEQ(nLoc17, 0x02);
	if (g_t4200F560 != 0x00)
	{
		word32 a3_47;
		word32 a4_48;
		word32 s1_125;
		word32 a0_126;
		word32 a1_127;
		word32 a5_128;
		word32 s2_129;
		word32 s3_130;
		xQueueGenericSendFromISR(g_t42025718, fp + ~0x17, fp + ~0x1B, 0x00, a4, 0x42025000, mstatus, dwLoc18_91, dwArg0108, out s1_125, out a0_126, out a1_127, out a3_47, out a4_48, out a5_128, out s2_129, out s3_130);
		if (a4_48 == 0x01)
		{
			word32 a0_131;
			word32 a4_132;
			word32 a5_133;
			vTaskSwitchContext(a3_47, mstatus, out a0_131, out a4_132, out a5_133);
		}
	}
	else
	{
		word32 a0_122;
		word32 a1_123;
		word32 a4_124;
		rw_main_task_post(fp + ~0x17, a4, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out a0_122, out a1_123, out a4_124);
	}
}

// 230290AA: Register Eq_2 bdaddr_init(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      ble_controller_init
Eq_2 bdaddr_init(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	uint8 bLoc18_90;
	bl_wifi_mac_addr_get(fp + ~0x17);
	uint32 a3_27 = (word32) wLoc16;
	word32 a5_25 = (word32) bLoc14;
	uint16 wLoc16_89 = (word16) (a3_27 >> 8 | a3_27 << 0x08);
	int32 a4_23 = (word32) bLoc13;
	uint8 bLoc17_88 = (byte) a5_25;
	byte bLoc15_98 = SLICE(wLoc16_89, byte, 8);
	if (a4_23 != 0x00FF)
		bLoc18_90 = (byte) (a4_23 + 0x01);
	else
	{
		bLoc18_90 = 0x00;
		bLoc17_88 = (byte) (a5_25 + 0x01);
	}
	co_bdaddr_set(fp + ~0x17);
	ptr32 s1_65;
	ptr32 s2_68;
	ptr32 s3_69;
	ptr32 s5_71;
	word32 a5_125;
	word32 a4_124;
	word32 a3_123;
	word32 a2_122;
	word32 a1_121;
	word32 a0_120;
	word32 a7_126;
	word32 s4_127;
	word32 s6_128;
	word32 s7_129;
	word32 s8_130;
	word32 s9_131;
	word32 s10_132;
	word32 s11_133;
	word32 t4_134;
	Eq_2 ra_64 = printf(ra, &g_t230B4E8C, (word32) bLoc15_98, SEQ(wLoc16_89, bLoc17_88, bLoc18_90), dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_65, out a0_120, out a1_121, out a2_122, out a3_123, out a4_124, out a5_125, out a7_126, out s2_68, out s3_69, out s4_127, out s5_71, out s6_128, out s7_129, out s8_130, out s9_131, out s10_132, out s11_133, out t4_134);
	s1Out = s1_65;
	s2Out = s2_68;
	s3Out = s3_69;
	s5Out = s5_71;
	return ra_64;
}

// 2302912A: Register Eq_2 ble_controller_init(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register (ptr32 Eq_326) a0, Register Eq_2 s2, Register (ptr32 Eq_326) s3, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_stack_ble
Eq_2 ble_controller_init(Eq_2 ra, word32 s0, Eq_2 s1, struct Eq_326 * a0, Eq_2 s2, struct Eq_326 * s3, Eq_2 s6, Eq_2 s7, ptr32 fflags, ptr32 frm, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	BLE_ROM_hook_init();
	struct Eq_127637 * a4_24;
	Eq_2 s1_36;
	Eq_2 s2_39;
	word32 s0_240;
	Eq_2 ra_34 = rfc_init(s0, s1, 40000000, s2, s3, s6, s7, fflags, frm, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg38, dwArg44, a0, dwArg68, out s0_240, out s1_36, out a4_24, out s2_39);
	g_b4200F3BC = 0x00;
	g_b4200F3BD = 0x00;
	rwble_isr_clear(a4_24);
	bl_irq_pending_clear((struct Eq_127663 *) 72);
	word32 s0_76;
	word32 s1_241;
	word32 a3_242;
	word32 s2_243;
	word32 s3_244;
	Eq_2 ra_75 = bl_irq_register(ra_34, s1_36, 72, 0x230292A0, s2_39, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg50, dwArg54, dwArg58, ra, dwArg78, dwArg7C, dwArg9C, out s0_76, out s1_241, out a3_242, out s2_243, out s3_244);
	bl_irq_enable((struct Eq_127708 *) 72);
	word32 s1_103;
	word32 s2_106;
	Eq_2 s3_107;
	Eq_2 s5_109;
	Eq_2 a3_125;
	Eq_2 a4_126;
	Eq_2 a5_127;
	ptr32 mstatus_130;
	Eq_2 ra_131 = rwip_init(bdaddr_init(ra_75, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_103, out s2_106, out s3_107, out s5_109), s0_76, s1_103, s2_106, s3_107, s5_109, dwLoc20, dwArg08, dwArg48, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out a3_125, out a4_126, out a5_127, out mstatus_130);
	Eq_2 a0_150;
	Eq_2 a4_154;
	Eq_2 s1_158;
	Eq_2 s3_160;
	word32 a1_245;
	word32 a2_246;
	word32 a3_247;
	word32 a5_248;
	word32 s2_249;
	word32 s4_250;
	xQueueGenericCreate(ra_131, 0x14, 0x08, a3_125, a4_126, a5_127, mstatus_130, dwArg00, dwArg04, dwArgF8, dwArg0138, out s1_158, out a0_150, out a1_245, out a2_246, out a3_247, out a4_154, out a5_248, out s2_249, out s3_160, out s4_250);
	g_t42025718 = a0_150;
	ptr32 a3_181;
	ptr32 s1_186;
	ptr32 s2_187;
	word32 a0_251;
	word32 a2_252;
	word32 a4_253;
	word32 a5_254;
	word32 s3_255;
	Eq_2 ra_196 = xTaskCreate(ra_131, s1_158, 0x0200, 0x00, a4_154, 0x42025714, s3_160, mstatus_130, dwArg10, dwArg14, dwArgF8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s1_186, out a0_251, out a2_252, out a3_181, out a4_253, out a5_254, out s2_187, out s3_255);
	s1Out = s1_186;
	a3Out = a3_181;
	s2Out = s2_187;
	mstatusOut = mstatus_130;
	return ra_196;
}

// 230291BC: void ble_controller_deinit(Register word32 ra, Register word32 s0, Register word32 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      bt_disable
void ble_controller_deinit(word32 ra, word32 s0, word32 s1, Eq_2 a3, Eq_2 a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	Eq_2 a2_19;
	Eq_2 ra_18;
	a5_5();
	word32 s2_165;
	word32 a0_164;
	Eq_2 a4_40;
	Eq_2 a5_41;
	Eq_2 a3_39;
	vTaskDelete(g_t42025714, a2_19, a3, a4, bl_irq_disable((struct Eq_127833 *) 72), mstatus, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a0_164, out a3_39, out a4_40, out a5_41, out s2_165)->dw0714 = 0x00;
	Eq_2 s0_104 = 0x42025000;
	while (true)
	{
		Eq_2 a0_62;
		Eq_2 s1_71;
		Eq_2 s2_72;
		Eq_2 s3_73;
		Eq_2 s4_74;
		word32 a1_174;
		word32 a2_175;
		word32 s8_176;
		s0_104 = xQueueReceive(*((word32) s0_104 + 1816), fp - 24, 0x00, a3_39, a4_40, a5_41, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_71, out a0_62, out a1_174, out a2_175, out a3_39, out a4_40, out a5_41, out s2_72, out s3_73, out s4_74, out s8_176);
		if (a0_62 != s1_71)
			break;
		if (a0_62 != 0x00)
		{
			word32 tp_177;
			word32 s1_178;
			word32 a0_179;
			word32 a2_180;
			word32 s2_181;
			word32 s3_182;
			word32 s4_183;
			ra_18 = ble_ke_msg_free(ra_18, s0_104, s1_71, (word32) a0_62 - 0x0C, s2_72, s3_73, s4_74, s5, out tp_177, out s0_104, out s1_178, out a0_179, out a2_180, out a3_39, out a4_40, out a5_41, out s2_181, out s3_182, out s4_183, out s5, out mstatus);
		}
	}
	word32 a2_169;
	word32 a1_168;
	word32 a0_167;
	word32 s1_166;
	word32 a5_172;
	word32 a4_171;
	word32 a3_170;
	word32 s4_173;
	vQueueDelete(*((word32) s0_104 + 1816), a3_39, a4_40, mstatus, dwArg0138, dwArg0178, out s1_166, out a0_167, out a1_168, out a2_169, out a3_170, out a4_171, out a5_172, out s4_173)->dw0718 = 0x00;
}

// 23029224: Register Eq_2 rwble_init(Register Eq_2 ra, Stack word32 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      rwip_init
Eq_2 rwble_init(Eq_2 ra, word32 dwArg00, Eq_2 dwArg08, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_151671 ** a4_10;
	Eq_2 s0_14;
	Eq_2 s5_19;
	word32 s0_35;
	word32 s1_36;
	struct Eq_127970 * a5_48;
	Eq_2 s2_54;
	Eq_2 s4_56;
	ptr32 mstatus_70;
	ptr32 s0_72;
	ptr32 s1_73;
	ptr32 s2_74;
	ptr32 s3_75;
	ptr32 s4_76;
	ptr32 s5_77;
	word32 s1_106;
	word32 s2_107;
	word32 s3_108;
	word32 s4_109;
	Eq_2 ra_71 = llm_init(llc_init(lld_init(em_buf_init(ra, dwArg0118, out s0_14, out s1_106, out a4_10, out s2_107, out s3_108, out s4_109, out s5_19), s0_14, 0x00, a4_10, s5_19, dwArg08, dwArg78, dwArgC8, out s0_35, out s1_36), s0_35, s1_36, dwArg00, dwArgE8, out a5_48, out s2_54, out s4_56), 0x00, a5_48, s2_54, s4_56, s5_19, dwArgD8, out s0_72, out s1_73, out s2_74, out s3_75, out s4_76, out s5_77, out mstatus_70);
	*(word32 *) 0x28000050 = 0x00;
	s0Out = s0_72;
	s1Out = s1_73;
	s2Out = s2_74;
	s3Out = s3_75;
	s4Out = s4_76;
	s5Out = s5_77;
	mstatusOut = mstatus_70;
	return ra_71;
}

