pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302924A: Register Eq_2 rwble_reset(Register Eq_2 ra, Register int32 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      rwip_init
Eq_2 rwble_reset(Eq_2 ra, int32 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_9 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	*(word32 *) 0x8000001C = 0x28000000;
	do
		;
	while (a3 < 0x00);
	word32 s0_142;
	word32 s1_143;
	word32 s2_144;
	Eq_2 s0_41;
	Eq_2 s1_42;
	struct Eq_127970 * a5_53;
	Eq_2 s2_62;
	Eq_2 s4_64;
	Eq_2 s5_65;
	ptr32 mstatus_78;
	ptr32 s1_103;
	ptr32 s2_104;
	ptr32 s3_105;
	ptr32 s4_106;
	ptr32 s5_107;
	word32 s3_145;
	word32 s4_146;
	word32 s5_147;
	word32 s0_148;
	word32 a4_149;
	Eq_2 ra_101 = em_buf_init(llm_init(llc_reset(lld_init(ra, s0_9, 0x01, lld_core_reset((word32 *) 0x80000000), s5, dwArg08, dwArg78, dwArgC8, out s0_41, out s1_42), s0_41, s1_42, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a5_53, out s2_62, out s4_64, out s5_65), 0x01, a5_53, s2_62, s4_64, s5_65, dwArgD8, out s0_142, out s1_143, out s2_144, out s3_145, out s4_146, out s5_147, out mstatus_78), dwArg0118, out s0_148, out s1_103, out a4_149, out s2_104, out s3_105, out s4_106, out s5_107);
	__csrrw(mstatus_78, 0x00);
	s1Out = s1_103;
	s2Out = s2_104;
	s3Out = s3_105;
	s4Out = s4_106;
	s5Out = s5_107;
	mstatusOut = mstatus_78;
	return ra_101;
}

// 23029292: void rwble_isr_clear(Register (ptr32 Eq_127637) a4)
// Called from:
//      ble_controller_init
void rwble_isr_clear(struct Eq_127637 * a4)
{
	Eq_2 a5_5 = a4->t0010;
	if (a4 != null)
		*(union Eq_2 *) 0x17 = a5_5;
}

// 230292A0: void rwble_isr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_128173 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s8, Register ptr32 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack word32 dwArgF8, Stack word32 dwArg0128)
void rwble_isr(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_128173 a3, Eq_2 a4, Eq_2 s2, Eq_2 s6, Eq_2 s8, ptr32 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgBC, Eq_2 dwArgCC, Eq_2 dwArgD8, word32 dwArgF8, word32 dwArg0128)
{
	ui32 s2_119 = 0x10000000;
	ui32 s6_221 = 0x01;
	struct Eq_128203 * s3_120 = &g_t4200F000;
	ui32 s7_222 = 0x10000008;
	struct Eq_128207 * s4_100 = &g_t4200F000;
	word32 s5_122 = 0x01;
	while (true)
	{
		struct Eq_128285 * s8_123 = &g_t4200F000;
		do
		{
			Eq_2 s1_118 = *((word32) s0 + 16);
			if (s0 == 0x00)
			{
				0x00 = dwArg0128;
				return;
			}
			if ((s0 & 4) != 0x00)
			{
				*(union Eq_2 *) 0x1C = s1_118;
				a0 = rwip_wakeup(mstatus, out a3, out a4);
			}
			if ((s0 & 1) != 0x00)
			{
				*((word32) s1_118 + 24) = s6_221;
				Eq_2 a0_65;
				Eq_128173 a3_68;
				Eq_2 s0_72;
				ra = rwip_wakeup_end(ra, s0, dwLoc30, out s0_72, out a0_65, out a3_68, out mstatus);
				s0 = ea_finetimer_isr(ra, s0_72, s1_118, a0_65, a3_68, s4_100, s6_221, s7_222, dwArg08, dwArgF8, out s1_118, out a0, out a3, out a4, out s2_119, out s3_120, out s4_100, out s5_122, out s8_123);
			}
			if ((s0 & 0x0080) != 0x00)
			{
				*(union Eq_2 *) 0x98 = s1_118;
				s0 = ea_finetimer_isr(ra, s0, s1_118, a0, a3, s4_100, s6_221, s7_222, dwArg08, dwArgF8, out s1_118, out a0, out a3, out a4, out s2_119, out s3_120, out s4_100, out s5_122, out s8_123);
			}
			if ((s0 & 8) != 0x00)
			{
				*(union Eq_2 *) 0x20 = s1_118;
				if ((s0 & 2) != 0x00)
				{
					*(union Eq_2 *) 0x1A = s1_118;
					s0 &= ~0x02;
				}
				if (s0 << 0x0F < 0x00)
				{
					if (((word32) s3_120->b03BD & 0x00FF) == 0x00)
						s3_120->b03BD = (byte) s5_122;
					*((word32) s1_118 + 24) = s2_119;
				}
				ra = lld_evt_end_isr(ra, s0, a3, a4, s9, s10, mstatus, s8, s6, s2, dwLoc18, dwLoc08, dwArg20, dwArg24, dwArg28, dwArg48, dwArg68, dwArg6C, dwArg88, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0, out s1_118, out a0, out a3, out a4, out s2_119, out s3_120, out s4_100, out s5_122, out s6_221, out s7_222, out s8_123, out s9, out s10, out mstatus);
			}
			if ((s0 & s7_222) == s2_119)
			{
				if (((word32) s3_120->b03BD & 0x00FF) == 0x00)
				{
					s3_120->b03BD = (byte) s5_122;
					s8_123->t03C0 = *((word32) s1_118 + 0x00A8);
					s4_100->t03C4 = *((word32) s1_118 + 0x00AC);
				}
				*((word32) s1_118 + 24) = s2_119;
				if ((s0 & 2) != 0x00)
				{
					*(union Eq_2 *) 0x1A = s1_118;
					s0 &= ~0x02;
				}
				ra = lld_evt_afs_isr(ra, s0, s4_100->t03C4 >> 16 & 0x00FF, s10, s2, dwArg34, dwArg98, dwArgCC, out s0, out s1_118, out a0, out a3, out a4, out s2_119, out s3_120, out s4_100, out s5_122, out s6_221, out s7_222, out s8_123, out s9, out s10, out mstatus);
			}
			if ((s0 & 0x0100) != 0x00)
			{
				*(union Eq_2 *) 0x0118 = s1_118;
				if ((s0 & 2) != 0x00)
				{
					*(union Eq_2 *) 0x1A = s1_118;
					s0 &= ~0x02;
				}
				ra = lld_evt_end_isr(ra, s0, a3, a4, s9, s10, mstatus, s8, s6, s2, dwLoc18, dwLoc08, dwArg20, dwArg24, dwArg28, dwArg48, dwArg68, dwArg6C, dwArg88, dwArg94, dwArgB0, dwArgB4, dwArgBC, dwArgD8, out s0, out s1_118, out a0, out a3, out a4, out s2_119, out s3_120, out s4_100, out s5_122, out s6_221, out s7_222, out s8_123, out s9, out s10, out mstatus);
			}
			if ((s0 & 2) != 0x00)
			{
				*(union Eq_2 *) 0x1A = s1_118;
				ra = lld_evt_rx_isr(ra, s1_118, s10, s2, dwArg24, dwArg88, dwArgBC, out s0, out s1_118, out a0, out a3, out a4, out s2_119, out s3_120, out s4_100, out s5_122, out s6_221, out s7_222, out s8_123, out s9, out s10, out mstatus);
			}
			if ((s0 & 0x0200) != 0x00)
			{
				*(union Eq_2 *) 0x0218 = s1_118;
				ra = ea_sw_isr(ra, (struct Eq_128568 *) 0x0200, out s1_118, out a0, out s8_123);
			}
			if ((s0 & 64) != 0x00)
			{
				*(union Eq_2 *) 88 = s1_118;
				ra = lld_evt_timer_isr(ra, s0, s2, out s0, out a0, out a3, out a4, out mstatus);
			}
			if ((s0 & 16) != 0x00)
			{
				*(union Eq_2 *) 0x28 = s1_118;
				ra = lld_crypt_isr(ra, s0, s2, out s0, out a0, out a3, out a4, out mstatus);
			}
			s0 &= 32;
		} while (s0 == 0x00);
		((union Eq_2 *) 0x38)->u0 = 0x28000000;
		a4.u0 = 32;
	}
}

