pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23029404: Register word32 ea_conflict_check(Register Eq_128173 a3, Register Eq_2 a4, Register out (ptr32 Eq_128634) a1Out, Register out Eq_128635 a3Out, Register out (ptr32 Eq_128636) a4Out, Register out (ptr32 Eq_128637) a5Out)
// Called from:
//      ea_elt_cancel
//      ea_elt_insert
word32 ea_conflict_check(Eq_128173 a3, Eq_2 a4, struct Eq_128634 & a1Out, union Eq_128635 & a3Out, struct Eq_128636 & a4Out, struct Eq_128634 & a5Out)
{
	Eq_128635 a3_16;
	word32 a0_27;
	struct Eq_128636 * a4_26;
	struct Eq_128634 * a0_7 = *((word32) a4 + 8);
	struct Eq_128634 * a1_5 = *((word32) a3 + 8);
	int32 a0_11 = a3 - a4;
	struct Eq_128634 * a5_14 = (word32) a0_7->w0014;
	struct Eq_128634 * a2_15 = (word32) a1_5->w0014;
	if ((a0_11 & 0x07FFFFFF) > 0x04000000)
	{
		a3_16 = 0x00 - (a4 - a3 & 0x07FFFFFF);
		if (a3_16 != 0x00)
			goto l2302943A;
	}
	else
	{
		a3_16 = a0_11 & 0x07FFFFFF;
		if ((a0_11 & 0x07FFFFFF) != 0x00)
			goto l23029482;
	}
	if (a5_14 >= a2_15)
	{
l2302943A:
		a1_5 = (word32) a1_5->w0012;
		a0_27 = 0x05;
		a4_26 = a2_15 + a1_5 - a5_14;
		if (a4_26 > null)
		{
			a4_26 = (word32) a3_16 + ((char *) a4_26 - 1 ^ 625);
			if (a4_26 >= null)
			{
				a4_26 = (word32) a0_7->w0012;
				a0_27 = 0x04;
				a5_14 = a5_14 + a4_26 - a2_15 - a1_5;
				if (a5_14 <= null)
				{
					a5_14 = a5_14 ^ -625;
					a0_27 = (word32) ((word32) a3_16 + (a5_14 ^ -625) < 0) + 0x03;
				}
			}
		}
		goto l2302947C;
	}
l23029482:
	a4_26 = (word32) a0_7->w0012;
	a0_27 = 0x00;
	a5_14 = a5_14 + a4_26 - a2_15;
	if (a5_14 > null)
	{
		a4_26 = (a5_14 + -1 ^ -625) + a3_16;
		if (a4_26 <= null)
		{
			a4_26 = (word32) a1_5->w0012;
			a0_27 = 0x01;
			a5_14 -= a4_26;
			if (a5_14 > null)
			{
				a1Out = a1_5;
				a3Out = a3_16;
				a4Out = a4_26;
				a5Out = a5_14 + ~0x00;
				return CONVERT((a5_14 + ~0x00 ^ -625) + a3_16 < 1, bool, word32) + 0x01;
			}
		}
	}
l2302947C:
	a1Out = a1_5;
	a3Out = a3_16;
	a4Out = a4_26;
	a5Out = a5_14;
	return a0_27;
}

// 230294BE: Register word32 ea_elt_cancel(Register word32 ra, Register Eq_2 a0, Stack Eq_2 dwArg74, Stack Eq_2 dwArg010C, Register out Eq_2 s3Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_128755 s7Out, Register out Eq_2 s9Out, Register out Eq_128757 s10Out)
// Called from:
//      ea_elt_insert
word32 ea_elt_cancel(word32 ra, Eq_2 a0, Eq_2 dwArg74, Eq_2 dwArg010C, union Eq_2 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_128755 & s7Out, union Eq_2 & s9Out, union Eq_128757 & s10Out)
{
	Eq_2 s0_159 = 0x42013000;
	word32 * a5_131 = &g_t42013188;
	Eq_2 s6_205 = g_t42013194;
	word32 s1_167 = 0x42013188;
	Eq_2 s9_144 = 0x00;
	word32 s2_152 = 0x42013194;
	while (s6_205 != 0x00)
	{
		Eq_128771 a3_44 = (word32) *((word32) s6_205 + 16);
		s3 = *s6_205;
		a5_131 = a3_44 >> 0x0E;
		if (a3_44 >> 0x0E != 0x00)
		{
			ui32 a4_48 = a3_44 >> 0x04 & 63;
			if (a4_48 != 0x00)
			{
				*((word32) s6_205 + 22) = (byte) ((a3_44 & 0x0F) + (word32) (*((word32) s6_205 + 22)));
				Eq_128819 a5_58 = (word32) (word16) (a4_48 + -1 << 4 | a3_44 & -1009);
				((word32) s6_205 + 16)->u2 = (word16) a5_58;
				Eq_128173 a3_119 = a3_44 & -1009;
				ui32 a2_61 = a5_58 >> 0x0C & 0x03;
				s7 = a5_58 >> 0x0E;
				Eq_2 a4_139 = a0;
				Eq_2 s11_137 = 0x00;
				while (a4_139 != 0x00)
				{
					struct Eq_128845 * a1_76;
					word32 a5_503;
					Eq_2 a4_133;
					ui32 a0_75 = ea_conflict_check(a3_119, a4_139, out a1_76, out a3_119, out a4_133, out a5_503);
					if (a0_75 == 0x00)
						break;
					s0_159 = dwArg74;
					if (a0_75 != 0x05)
					{
						word32 a3_92 = CONVERT(Mem73[a4_133 + 20:uint16] + Mem73[a4_133 + 18:uint16], uint16, uint16);
						a4_133 = a1_76->t0008;
						a3_119 = a3_92 & 625;
						uint32 a5_101 = a1_76 + (a3_92 >> 625) / 0x0C;
						if ((word32) *((word32) s6_205 + 20) < (a3_92 & 625))
							++a5_101;
						if (a2_61 == 0x01)
							a5_101 |= 1;
						else if (a2_61 == 0x00)
							a5_101 = a5_101 + 0x01 & ~0x01;
						int32 a5_109 = a5_101 & 0x07FFFFFF;
						*((word32) s6_205 + 8) = a5_109;
						if (a5_58 >> 0x0E > 0x01)
						{
							int32 a1_117 = *((word32) s6_205 + 0x0C);
							int32 a3_118 = a1_117 - a5_109;
							a3_119 = a3_118 & 0x07FFFFFF;
							if ((a3_118 & 0x07FFFFFF) > 0x04000000)
								a3_119 = 0x00 - (a5_109 - a1_117 & 0x07FFFFFF);
							uint32 a5_127 = (word32) *((word32) s6_205 + 18);
							a5_131 = a5_127 >> 625;
							if (a3_119 < a5_127 >> 625)
								goto l2302961A;
						}
					}
					s11_137 = a4_133;
					a4_139 = *a4_133;
				}
				Eq_2 s1_188;
				Eq_2 s2_189;
				ra = ble_co_list_insert_after(ble_co_list_extract_after(ra, s0_159, s1_167, s2_152, s9_144, s6_205, s2_152, dwLoc18, out s1_188, out s2_189), s0_159, s1_188, (word32) s0_159 + 0x0188, s11_137, s6_205, s2_189, dwLoc18, out s1_167, out a5_131, out s2_152);
				s6_205 = s9_144;
			}
		}
l2302961A:
		s9_144 = s6_205;
		s6_205 = s3;
	}
	if (a5_131 != null)
		*(a5_131 & ~0x10000000 | 0x10000000) = *a5_131;
	0x00 = (int8) dwArg010C;
	s3Out = s3;
	s5Out = 0x05;
	s6Out = s6_205;
	s7Out = s7;
	s9Out = s9_144;
	s10Out.u0 = 625;
	return s2_152;
}

// 23029628: Register Eq_2 ea_init(Register Eq_2 ra)
// Called from:
//      rwip_init
Eq_2 ea_init(Eq_2 ra)
{
	word32 a0_37;
	word32 a1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a0_41;
	word32 a1_42;
	Eq_2 ra_27 = ble_co_list_init(ble_co_list_init(ble_co_list_init(ra, 0x42013188, &g_t42013188, out a0_37, out a1_38), 0x42013188, &g_t42013194, out a0_39, out a1_40), 0x42013188, &g_ptr4201319C, out a0_41, out a1_42);
	g_t42013190.u0 = 0x00;
	((union Eq_2 *) 0x1B)->u0 = 0x42013188;
	return ra_27;
}

// 2302965E: Register Eq_2 ea_elt_create(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register int32 a0, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a6Out, Register out ptr32 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_scan_create
//      lld_evt_update_create
//      lld_evt_move_to_slave
//      lld_evt_adv_create
//      lld_con_start
//      lld_con_update_after_param_req
//      lld_con_update_ind
Eq_2 ea_elt_create(Eq_2 ra, Eq_2 s0, Eq_2 s1, int32 a0, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a6Out, ptr32 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	word32 s0_87;
	word32 a5_88;
	word32 s8_89;
	ptr32 a3_17;
	ptr32 a4_18;
	ptr32 a6_20;
	ptr32 mstatus_22;
	ptr32 s1_25;
	ptr32 s4_26;
	Eq_2 ra_23 = ble_ke_malloc(ra, s0, s1, a0 + 44, 0x00, out s0_87, out s1_25, out a0_14, out a3_17, out a4_18, out a5_88, out a6_20, out s4_26, out s8_89, out mstatus_22);
	ptr32 s0_30 = a0_14;
	if (a0_14 != 0x00)
	{
		<anonymous> * a5_32 = g_ptr4200F3D4;
		a5_32();
	}
	s0Out = s0_30;
	s1Out = s1_25;
	a0Out = s0_30;
	a3Out = a3_17;
	a4Out = a4_18;
	a6Out = a6_20;
	s4Out = s4_26;
	s8Out = dwLoc1C;
	mstatusOut = mstatus_22;
	return ra_23;
}

// 2302968E: Register Eq_2 ea_interval_create(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_move_to_master
//      lld_evt_move_to_slave
Eq_2 ea_interval_create(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 & a0Out, ptr32 & a1Out, ptr32 & mstatusOut)
{
	word32 a0_11;
	word32 s1_22;
	word32 s0_60;
	word32 a3_61;
	word32 a4_62;
	word32 a5_63;
	word32 a6_64;
	word32 s4_65;
	word32 s8_66;
	word32 mstatus_67;
	Eq_2 ra_20 = ble_ke_malloc(ra, s0, s1, 0x10, 0x00, out s0_60, out s1_22, out a0_11, out a3_61, out a4_62, out a5_63, out a6_64, out s4_65, out s8_66, out mstatus_67);
	<anonymous> * a5_28 = g_ptr4200F3D4;
	ptr32 a1_33;
	Eq_2 ra_35;
	ptr32 s0_36;
	ptr32 mstatus_44;
	a5_28();
	a0Out = s0_36;
	a1Out = a1_33;
	mstatusOut = mstatus_44;
	return ra_35;
}

