pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230296B6: Register Eq_2 ea_interval_insert(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0)
// Called from:
//      lld_evt_move_to_master
//      lld_evt_move_to_slave
Eq_2 ea_interval_insert(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0)
{
	word32 s1_17;
	word32 a0_18;
	word32 a5_19;
	return ble_co_list_push_back(ra, s0, s1, 0x4201319C, a0, out s1_17, out a0_18, out a5_19);
}

// 230296C4: Register Eq_2 ea_interval_remove(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      lld_evt_init
//      lld_evt_elt_delete
Eq_2 ea_interval_remove(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 a0_12;
	ptr32 s1_21;
	ptr32 s2_22;
	ptr32 s4_23;
	word32 s0_30;
	word32 a2_31;
	word32 a3_32;
	word32 a4_33;
	word32 s8_34;
	Eq_2 ra_19 = ble_co_list_extract(ra, s0, s1, 0x4201319C, a0, 0x00, s2, out s0_30, out s1_21, out a0_12, out a2_31, out a3_32, out a4_33, out s2_22, out s4_23, out s8_34);
	s1Out = s1_21;
	a0Out = a0_12;
	s2Out = s2_22;
	s4Out = s4_23;
	return ra_19;
}

// 230296D4: Register Eq_2 ea_sw_isr(Register Eq_2 ra, Register (ptr32 Eq_128568) a5, Register out (ptr32 Eq_128569) s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_128571) s8Out)
// Called from:
//      rwble_isr
Eq_2 ea_sw_isr(Eq_2 ra, struct Eq_128568 * a5, struct Eq_128569 & s1Out, ptr32 & a0Out, struct Eq_128571 & s8Out)
{
	while (true)
	{
		Eq_2 s0_15 = a5->t000C;
		if (a5 == null)
			break;
		word32 s0_24;
		word32 a0_61;
		word32 a1_62;
		ra = ble_co_list_pop_front(ra, s0_15, 0x42013194, out s0_24, out a0_61, out a1_62, out a5, out s8);
		a0 = a5->ptr0024;
		if (a5 != null)
			a5();
	}
	s1Out = (struct Eq_128569 *) &g_t42013194;
	a0Out = a0;
	s8Out = s8;
	return ra;
}

// 23029704: Register word32 ea_offset_req(Register (ptr32 Eq_129218) a0, Register (ptr32 Eq_129219) a1, Register out (ptr32 Eq_129220) s1Out, Register out (ptr32 Eq_129221) a0Out, Register out (ptr32 Eq_129220) a2Out, Register out (ptr32 Eq_129220) a3Out, Register out (ptr32 Eq_129221) a5Out)
// Called from:
//      lld_evt_update_create
//      lld_evt_move_to_slave
//      lld_scan_start
//      lld_con_start
//      lld_con_update_after_param_req
//      lld_con_param_rsp
//      lld_con_param_req
//      llc_end_evt_defer
word32 ea_offset_req(struct Eq_129218 * a0, struct Eq_129219 * a1, struct Eq_129220 & s1Out, struct Eq_129221 & a0Out, struct Eq_129220 & a2Out, struct Eq_129220 & a3Out, struct Eq_129221 & a5Out)
{
	struct Eq_129220 * a6_5 = (word32) a1->w0000;
	if (a6_5 != null)
	{
		int32 t1_7 = a1->dw0004;
		word32 t3_10 = (word32) (word16) t1_7;
		if (t3_10 != 0x00)
		{
			struct Eq_129220 * a2_214;
			word32 t4_21 = (word32) a0->b000E;
			if (t4_21 == 0x01)
				a2_214 = (word32) a0->w000C;
			else
				a2_214 = (word32) a0->b0014;
			struct Eq_129275 * a7_26 = g_ptr4201319C;
			struct Eq_129275 * s0_192 = a7_26;
			s1_110 = s1;
			while (true)
			{
				struct Eq_129221 * a5_233;
				struct Eq_129220 * s1_110;
				if (s0_192 == null)
					break;
				if (a2_214 >= a6_5)
				{
l2302987C:
					a5_233 = (struct Eq_129221 *) 0x03;
					goto l2302986A;
				}
				struct Eq_129220 * a4_43 = (word32) a0->w0012;
				if (a4_43 == (struct Eq_129220 *) 0x00FF)
					goto l2302975C;
				struct Eq_129220 * a5_154;
				a3 = (word32) s0_192->w0004;
				if (a3 != null)
				{
					word32 a5_46 = (word32) s0_192->w0008;
					if (a5_46 == 0x00)
						goto l230297D4;
					s1_110 = (word32) s0_192->w000A;
					if (s1_110 == (word32) a0->w0010)
						goto l230297D4;
					struct Eq_129220 * t2_49 = a3;
					if (a6_5 < a3)
						t2_49 = a6_5;
					struct Eq_129220 * a4_75;
					word32 a5_74;
					s1_110 = (word32) s0_192->w000C;
					uint32 t2_56 = t2_49 << 16;
					if (s1_110 == a4_43)
					{
						if (a4_43 == (struct Eq_129220 *) 0x01)
						{
							s1_110 = (word32) s0_192->w000E;
							if (s1_110 != (word32) a0->w0016)
								goto l230297A8;
						}
						if (t2_56 >> 0x10 < (word32) ((word16) t1_7) + a5_46)
							goto l2302987C;
						a5_74 = a5_46 + ~0x00;
						a4_75 = (word32) s0_192->w0006 & t2_56 >> 0x10;
						goto l230297C2;
					}
l230297A8:
					if (t2_56 >> 0x10 < (word32) ((word16) t1_7) + a5_46)
						goto l2302987C;
					a5_74 = a5_46 + 0x01;
					a4_75 = (word32) (word16) ((word32) s0_192->w0006 + (t2_56 >> 0x10) + ~0x00 | t2_56 >> 0x10);
l230297C2:
					word32 a5_98 = a4_75 + a5_74 / 100;
					s1_110 = a6_5 & t2_56 >> 0x10;
					struct Eq_129220 * a5_100 = (word32) (word16) a5_98;
					if (s1_110 != null)
						goto l230297D4;
					a3 &= t2_56 >> 0x10;
					if (a3 != null)
						goto l230297D4;
					s1_110 = a2_214 & t2_56 >> 0x10;
					a3 = (word32) (word16) (s1_110 + (t3_10 + ~0x00) / 100);
					if (s1_110 >= a4_75)
					{
						if ((word32) (word16) a5_98 >= s1_110)
							goto l2302980C;
						if (a3 >= a4_75)
						{
							if ((word32) (word16) a5_98 >= a3 || a4_75 >= s1_110)
								goto l2302980C;
							goto l23029832;
						}
						if (a4_75 == s1_110)
							goto l2302982E;
						goto l23029832;
					}
					if (a3 < a4_75)
					{
l2302982E:
						if (a3 >= a5_100)
							goto l2302980C;
l23029832:
						if (a5_100 >= t2_56 >> 0x10 && (a5_100 & t2_56 >> 0x10) >= s1_110)
							goto l2302980C;
						if (a3 < t2_56 >> 0x10)
							goto l230297D4;
						a3 &= t2_56 >> 0x10;
						if (a3 >= a4_75)
							goto l2302980C;
						goto l230297D4;
					}
l2302980C:
					if (t4_21 != 0x01)
					{
						a5_154 = (word32) (word16) a5_98 + 0x01 | t2_56 >> 0x10;
						while (a2_214 >= a5_154)
							a5_154 = (word32) (word16) (a5_154 + (t2_56 >> 0x10) / 100);
						a3 = (word32) a0->b0014;
						ui32 a4_181 = a5_154 & 1;
						if (a3 != null)
						{
							if (a4_181 != 0x00)
								goto l23029826;
							goto l23029858;
						}
						s0_192 = a7_26;
						if (a4_181 == 0x00)
							goto l230297D8;
l23029858:
						a5_154 = (word32) (word16) ((char *) a5_154 + 1);
					}
					else
						a5_154 = a6_5;
l23029826:
					s0_192 = a7_26;
				}
				else
				{
l230297D4:
					s0_192 = s0_192->ptr0000;
					a5_154 = a2_214;
				}
l230297D8:
				a2_214 = a5_154;
			}
			a5_233 = (struct Eq_129221 *) 0x03;
			if (a2_214 < a6_5)
			{
l2302975C:
				a1->w0008 = (word16) a2_214;
				a5_233 = null;
			}
l2302986A:
			s1Out = s1_110;
			a0Out = a5_233;
			a2Out = s1;
			a3Out = a3;
			a5Out = a5_233;
			return dwArg14;
		}
	}
	s1Out = s1;
	a0Out = (struct Eq_129221 *) 0x01;
	a2Out = a2;
	a3Out = a3;
	a5Out = (struct Eq_129221 *) 0x01;
	return s0;
}

// 2302988C: Register Eq_2 ea_time_get_halfslot_rounded(Register Eq_2 a0, Register Eq_128173 a3, Register out Eq_2 a5Out)
// Called from:
//      ea_elt_insert
//      ea_finetimer_isr
//      lld_evt_schedule_next
//      lld_evt_scan_create
//      lld_evt_move_to_master
//      lld_evt_adv_create
//      lld_con_start
Eq_2 ea_time_get_halfslot_rounded(Eq_2 a0, Eq_128173 a3, union Eq_2 & a5Out)
{
	*(word32 *) 0x8000001C = 0x28000000;
	do
		;
	while (a3 < 0x00);
	a5Out = *((word32) a0 + 32);
	return (word32) (word27) ((word32) (a0 < 312) + 0x80000000);
}

