pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 230298AC: Register (ptr32 Eq_128275) ea_time_get_slot_rounded(Register (ptr32 Eq_128275) a0, Register Eq_128173 a3, Register out ptr32 a4Out)
// Called from:
//      ea_prog_timer
struct Eq_128275 * ea_time_get_slot_rounded(struct Eq_128275 * a0, Eq_128173 a3, ptr32 & a4Out)
{
	*(word32 *) 0x8000001C = 0x28000000;
	do
		;
	while (a3 < 0x00);
	a4Out = 0x80000000;
	return (word32) (word27) ((word32) (a0 < (struct Eq_128275 *) 0x006A) + 0x80000000);
}

// 230298CC: Register word32 ea_prog_timer(Register (ptr32 Eq_128275) a0, Register Eq_128173 a3, Stack Eq_2 dwArg38, Register out Eq_129479 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_129482 s2Out)
// Called from:
//      ea_elt_insert
//      ea_elt_remove
//      ea_finetimer_isr
word32 ea_prog_timer(struct Eq_128275 * a0, Eq_128173 a3, Eq_2 dwArg38, union Eq_129479 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_129482 & s2Out)
{
	g_dw420131A4 = ~0x00;
	struct Eq_129486 * a4_19;
	struct Eq_128275 * a0_100 = ea_time_get_slot_rounded(a0, a3, out a4_19);
	Eq_2 a5_21 = g_t42013188;
	if (a5_21 != 0x00)
	{
		struct Eq_129499 * a5_30 = a4_19->ptr0008;
		struct Eq_128634 * s0_31 = *((word32) a3 + 8);
		((struct Eq_128634 *[]) 28)[(word32) (word27) (a4_19 - (word32) (*((word32) a5_21 + 25))) / 4] = s0_31;
		if (a3 != 0x00)
		{
			Eq_128173 a4_40;
			if ((word32) *((word32) a3 + 22) < (word32) a5_30->b0016 && (word32) a5_30->w0010 << 0x14 < 0x00)
				a4_40 = (word32) *((word32) a3 + 24);
			else
				a4_40 = (word32) *((word32) a3 + 23);
			a3 = (word32) a5_30->b0019;
			if (a3 < a4_40)
			{
				ui32 a5_50 = a5_30->dw0008 - a4_40;
				ui32 a4_56 = (a5_50 & 0x07FFFFFF) - a0_100;
				a3.u0 = 0x04000000;
				if ((a4_56 & 0x07FFFFFF) <= 0x04000000 && (a4_56 & 0x07FFFFFF) != 0x00)
					(a5_50 & 0x07FFFFFF)->ptr001C = s0_31;
				else
				{
					uint32 a0_61 = (char *) a0_100 + 1 << 5;
					(a0_61 >> 5)->ptr001C = s0_31;
					a0_100 = a0_61 >> 5;
				}
			}
		}
	}
	else if (a5_21 == ~0x00)
	{
		Eq_2 a5_24 = a4_19->t000C;
		(a4_19 & -0x0081)->t000C = a5_24;
		*(union Eq_2 *) 0x98 = a5_24;
		goto l230299B0;
	}
	struct Eq_129519 * a4_72;
	a0_100 = ea_time_get_slot_rounded(a0_100, a3, out a4_72);
	word32 s0_75 = a4_72->dw001C;
	struct Eq_129527 * a4_78 = a0_100 - a4_72;
	if (a4_78 <= (struct Eq_129527 *) 0x03FFFFFE)
		((word32[]) 28)[(word32) (word27) ((char *) a0_100 + 1) / 4] = s0_75;
	*(struct Eq_129527 **) 0x280000F8 = a4_78;
	Eq_2 a5_88 = a4_78->t000C;
	if ((a4_78 >> 7 & 0x01) == 0x00)
	{
		*(union Eq_2 *) 0x98 = a5_88;
		*(word32 *) 0x8C = *(word32 *) 0x008C;
	}
l230299B0:
	Eq_2 a4_105 = (word32) g_b4200F3E0;
	if (a4_105 != 0x00 && a0_100 << 0x05 >= 0x00)
	{
		while (a4_105 != 0x00)
		{
			ui32 a2_107 = (word32) *((word32) a4_105 + 4);
			*((word32) a4_105 + 6) = (word16) (a2_107 - (a2_107 | 0x08000000) + (word32) (*((word32) a4_105 + 6)) | a2_107);
			a4_105 = *a4_105;
		}
	}
	uint32 a0_118 = a0_100 >> 26;
	g_b4200F3E0 = (byte) (a0_118 & 0x01);
	0x00 = (int8) dwArg38;
	a0Out = a0_118 & 0x01;
	a3Out = 0x4200F3E0;
	a4Out = a4_105;
	s2Out.u0 = 0x42013188;
	return ~0x00;
}

// 23029A00: Register Eq_2 ea_elt_insert(Register Eq_2 ra, Register Eq_2 a0, Register Eq_128173 a3, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg010C, Register out (ptr32 Eq_129683) s0Out, Register out Eq_129684 s1Out, Register out Eq_129684 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_129691 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out ptr32 s10Out)
// Called from:
//      lld_evt_elt_insert
//      lld_evt_end_isr
Eq_2 ea_elt_insert(Eq_2 ra, Eq_2 a0, Eq_128173 a3, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArgBC, Eq_2 dwArg010C, struct Eq_129683 & s0Out, union Eq_129684 & s1Out, union Eq_129684 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_129691 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & s10Out)
{
	word32 a5_1140;
	struct Eq_128275 * a0_33 = ea_time_get_halfslot_rounded(a0, a3, out a5_1140);
	Eq_2 s3_1053 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	ui32 a5_45 = a0_33 + ((word32) (*((word32) a0 + 25)) + 0x01) / 0x0C;
	word32 s4_348 = 0x42013000;
	Eq_2 a4_100 = g_t42013190;
	struct Eq_129722 * a5_47 = a5_45 & 0x07FFFFFF;
	ptr32 s5_1077 = 0x42013188;
	if (a4_100 != 0x00)
	{
		a4_100 = (word32) *((word32) a4_100 + 23);
		if (a4_100 != 0x00)
		{
			ui32 a3_50 = (a5_45 & 0x07FFFFFF) - a0_33;
			if ((a3_50 & 0x07FFFFFF) > 0x04000000 || (a3_50 & 0x07FFFFFF) < a4_100)
				a5_47 = CONVERT(SLICE(a4_100 + a0_33, word27, 0), word27, word32);
		}
	}
	Eq_129691 s6_1079 = (word32) *((word32) a0 + 16);
	if (s6_1079 >> 0x0E != 0x00)
	{
		a4_100 = s6_1079 >> 0x0C & 0x03;
		if (a4_100 == 0x01)
			a5_47 |= 1;
		else if (a4_100 == 0x00)
			a5_47 = (char *) a5_47 + 1 & 0x07FFFFFE;
	}
	Eq_2 s2_1044;
	Eq_2 s0_132 = *((word32) a4_100 + 8);
	Eq_128173 a3_104 = 0x07FFFFFF;
	Eq_129763 a2_80 = a4_100 - a5_47;
	if ((a2_80 & 0x07FFFFFF) > 0x04000000)
	{
		ui32 a4_83 = a5_47 - a4_100;
		a4_100 = a4_83 & 0x07FFFFFF;
		if ((a4_83 & 0x07FFFFFF) != 0x00)
		{
			s2_1044 = s2;
			if (s6_1079 >> 0x0E == 0x00)
				goto l23029AAA;
			a5_47->t0008 = s0_132;
		}
	}
	if (s6_1079 >> 0x0E > 0x01)
	{
		ui32 a4_95 = (a2_80 & 0x07FFFFFF) - 0x01;
		s0_132 = *(union Eq_2 *) 0x09;
		a4_100 = a4_95 & 0x07FFFFFF;
		if ((a4_95 & 0x07FFFFFF) > 0x04000000)
			a4_100 = 0x00 - (0x01 - (a2_80 & 0x07FFFFFF) & 0x07FFFFFF);
		a3_104.u0 = 625;
		s2_1044 = s2;
		if (a4_100 < (word32) (*((word32) s0_132 + 18)) >> 625)
		{
l23029AAA:
			goto l23029AAC;
		}
	}
	Eq_2 s1_114 = g_t42013190;
	Eq_2 a2_115 = g_t42013188;
	if (s1_114 == 0x00)
		s1_114 = a2_115;
	s6_1079 = s6_1079 >> 0x0C & 3;
	s2_1044.u0 = 0x00;
	s9.u0 = 0x00;
	s7.u0 = 0x00;
	s10 = 0x07FFFFFF;
	while (s1_114 != 0x00)
	{
		struct Eq_129847 * a1_140;
		Eq_2 a5_144;
		ui32 a0_139 = ea_conflict_check(a3_104, a4_100, out a1_140, out a3_104, out a4_100, out a5_144);
		if (a0_139 == 0x00)
			break;
		a3_104.u0 = 625;
		if (a0_139 != 0x05)
		{
			a4_100 = (word32) *((word32) s0_132 + 22);
			if ((word32) *((word32) s1_114 + 22) < a4_100)
			{
				a5_144 = g_t42013190;
				if (a5_144 == s1_114)
					goto l23029BDA;
				if (s2_1044 == 0x00)
					s9 = s1_114;
				s2_1044 = (byte) s2_1044.u0 + 1 & 0x00FF;
				if ((a0_139 & 0x00FD) == 0x01)
					break;
				if (s6_1079 >> 0x0E <= 0x01)
					goto l23029C42;
				goto l23029C14;
			}
l23029BDA:
			if (s6_1079 >> 0x0E == 0x00)
				goto l23029AAA;
			word32 a4_164 = CONVERT(Mem136[s1_114 + 20:uint16] + Mem136[s1_114 + 18:uint16], uint16, uint16);
			s1_114 = a1_140[8];
			a4_100 = a4_164 & 625;
			uint32 a5_168 = a1_140 + (a4_164 >> 625);
			a1_140 = (word32) *((word32) s0_132 + 20);
			if (a1_140 < (a4_164 & 625))
				++a5_168;
			if (s6_1079 == 0x01)
				a5_168 |= 1;
			else if (s6_1079 == 0x00)
				a5_168 = a5_168 + 0x01 & ~0x01;
			a5_144 = a5_168 & 0x07FFFFFF;
			*((word32) a5_144 + 8) = s0_132;
			s2_1044.u0 = 0x00;
			s9.u0 = 0x00;
		}
		if (s6_1079 >> 0x0E > 0x01)
		{
l23029C14:
			int32 a4_220 = a1_140 - a5_144;
			s0_132 = *((word32) a5_144 + 8);
			a4_100 = a4_220 & 0x07FFFFFF;
			if ((a4_220 & 0x07FFFFFF) > 0x04000000)
				a4_100 = 0x00 - (a5_144 - a1_140 & 0x07FFFFFF);
			if (a4_100 < (word32) (*((word32) s0_132 + 18)) >> 625)
				goto l23029AAA;
		}
		if (g_t42013190 != s1_114)
		{
l23029C42:
			if (s2_1044 == 0x00)
				s7 = s1_114;
			s1_114 = *s1_114;
			continue;
		}
		s1_114 = a2_115;
	}
	if (s2_1044 != 0x00)
	{
		word32 a0_1142;
		word32 a2_1143;
		word32 s1_1141;
		word32 a4_1144;
		word32 s8_1145;
		ra = ble_co_list_extract(ra, s0_132, s1_114, 0x42013188, s9, (byte) s2_1044.u0 - 1 & 0x00FF, s2_1044, out s0_132, out s1_1141, out a0_1142, out a2_1143, out a3_104, out a4_1144, out s2_1044, out s4_348, out s8_1145);
		s6_1079.u0 = 0x42013194;
		do
		{
			ui32 s2_357 = (byte) s2_1044.u0 - 1;
			s2_1044 = s2_357 & 0x00FF;
			word32 a0_1146;
			word32 a5_1147;
			ra = ble_co_list_push_back(ra, s0_132, *s9.u0, 0x42013194, s9, out s1_114, out a0_1146, out a5_1147);
			s9 = s1_114;
		} while ((s2_357 & 0x00FF) != 0x00);
	}
	word32 ra_397;
	if (s7 != 0x00)
	{
		word32 s1_1151;
		word32 a5_1152;
		ra_397 = ble_co_list_insert_after(ra, s0_132, s1_114, s4_348 + 0x0188, s7, s0_132, s2_1044, dwLoc18, out s1_1151, out a5_1152, out s2_1044);
	}
	else
	{
		struct Eq_128275 * a0_393;
		ra_397 = ble_co_list_push_front(ra, s0_132, s1_114, s4_348 + 0x0188, s0_132, out a0_393);
		word32 a4_1150;
		word32 a0_1148;
		word32 a3_1149;
		ea_prog_timer(a0_393, a3_104, dwLoc18, out a0_1148, out a3_1149, out a4_1150, out s2_1044);
	}
	if (g_t42013194 != 0x00)
		s2_1044 = ea_elt_cancel(ra_397, s0_132, dwArg24, dwArgBC, out s3_1053, out s5_1077, out s6_1079, out s7, out s9, out s10);
l23029AAC:
	__csrrw(mstatus, 0x00);
	0x00 = (int8) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = dwLoc4C;
	a3Out = s2;
	s2Out = s2_1044;
	s3Out = s3_1053;
	s4Out = dwArg0168;
	s5Out = s5_1077;
	s6Out = s6_1079;
	s7Out = s7;
	s8Out = dwArg0148;
	s9Out = s9;
	s10Out = s10;
	return dwLoc08;
}

// 23029C6E: Register Eq_2 ea_elt_remove(Register Eq_2 ra, Register Eq_2 a0, Register Eq_128173 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Register out Eq_2 s1Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      lld_evt_elt_delete
//      lld_evt_schedule_next
//      lld_evt_end_isr
Eq_2 ea_elt_remove(Eq_2 ra, Eq_2 a0, Eq_128173 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, union Eq_2 & s1Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 s2_121 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	if (a0 != 0x00)
	{
		s1 = *((word32) a4 + 8);
		if (a4 == a0)
			((word32) s1 + 8)->u0 = 0x00;
		else
		{
			Eq_2 s1_19 = *a4;
			if (a0 == a4)
			{
				struct Eq_128275 * a0_57;
				word32 s0_139;
				word32 a1_140;
				word32 a5_141;
				ra = ble_co_list_pop_front(ra, a0, 0x42013188, out s0_139, out a0_57, out a1_140, out a5_141, out s8);
				word32 a0_142;
				word32 a3_143;
				s1 = ea_prog_timer(a0_57, a3, dwArg28, out a0_142, out a3_143, out a4, out s2_121);
			}
			else
			{
				word32 a0_24;
				Eq_2 s0_32;
				word32 a2_137;
				word32 a3_138;
				ra = ble_co_list_extract(ra, a0, s1_19, 0x42013188, a0, 0x00, s2_121, out s0_32, out s1, out a0_24, out a2_137, out a3_138, out a4, out s2_121, out s4, out s8);
				if (a0_24 == 0x00)
				{
					word32 a0_41;
					word32 s0_144;
					word32 a2_145;
					word32 a3_146;
					ra = ble_co_list_extract(ra, s0_32, s1, (word32) s1 + 0x0C, s0_32, 0x00, s2_121, out s0_144, out s1, out a0_41, out a2_145, out a3_146, out a4, out s2_121, out s4, out s8);
					if (a0_41 == 0x00)
					{
l23029C84:
						__csrrw(mstatus, 0x00);
						0x00 = (int8) dwArg38;
						s1Out = s1;
						a4Out = a4;
						s2Out = s2_121;
						s4Out = s4;
						s8Out = s8;
						return ra;
					}
				}
			}
		}
	}
	goto l23029C84;
}

