pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23029CD8: Register Eq_2 ea_finetimer_isr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_128173 a3, Register (ptr32 Eq_128207) s4, Register ui32 s6, Register ui32 s7, Stack Eq_2 dwArg38, Stack word32 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_128273) s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_128275) s5Out, Register out ptr32 s8Out)
// Called from:
//      rwble_isr
Eq_2 ea_finetimer_isr(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_128173 a3, struct Eq_128207 * s4, ui32 s6, ui32 s7, Eq_2 dwArg38, word32 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, struct Eq_128273 & s3Out, ptr32 & s4Out, struct Eq_128275 & s5Out, ptr32 & s8Out)
{
	struct Eq_130166 * a5_112;
	struct Eq_128275 * a0_124 = ea_time_get_halfslot_rounded(a0, a3, out a5_112);
	word32 s2_142 = 0x42013000;
	struct Eq_128275 * s5_144 = a0_124;
	struct Eq_128273 * s3_107 = &g_t42013188;
	if (s1 == 0x00)
	{
l23029D44:
		if (s0 != 0x00)
		{
			word32 s4_105 = 0x07FFFFFF;
			word32 s6_106 = 0x03FFFFFE;
			Eq_2 s7_108 = &s3_107->ptr000C;
			do
			{
				ui32 a5_114 = a5_112 - (word32) (*((word32) s0 + 25));
				Eq_2 s0_113 = a5_112->t0008;
				if (((a5_114 & 0x07FFFFFF) - s5_144 & 0x07FFFFFF) <= 0x03FFFFFE)
				{
					if ((a5_114 & 0x07FFFFFF) == s5_144)
					{
						word32 a1_398;
						word32 a5_399;
						word32 s8_400;
						word32 s0_397;
						Eq_2 ra_128 = ble_co_list_pop_front(ra, s0_113, s2_142 + 0x0188, out s0_397, out a0_124, out a1_398, out a5_399, out s8_400);
						struct Eq_130228 * a5_133 = s3_107->ptr0008;
						if (a5_133 != null)
						{
							a5_133 = a5_133->ptr0020;
							if (a5_133 != null)
								a5_133();
						}
						struct Eq_130228 * s0_163 = a5_133->ptr001C;
						s3_107->ptr0008 = s0_163;
						if (a5_133 != null)
							a5_133();
					}
					break;
				}
				Eq_2 a0_197;
				Eq_2 s0_202;
				word32 a1_394;
				word32 a5_395;
				word32 s8_396;
				ra = ble_co_list_push_back(ble_co_list_pop_front(ra, s0_113, s2_142 + 0x0188, out s0_202, out a0_197, out a1_394, out a5_395, out s8_396), s0_202, s1, s7_108, a0_197, out s1, out a0_124, out a5_112);
				s0 = s3_107->t0000;
			} while (s0 != 0x00);
		}
		goto l23029D80;
	}
	if (s0 == 0x00)
	{
l23029D80:
		union Eq_128173 * a5_218 = s3_107->ptr000C;
		if (a5_218 != null)
		{
			a3 = *a5_218;
			*(a5_218 & ~0x10000000 | 0x10000000) = (union Eq_128173 *) a3;
		}
		0x00 = dwArg0128;
		ptr32 a0_253;
		ptr32 a3_256;
		ptr32 a4_257;
		ptr32 s2_261;
		s1Out = ea_prog_timer(a0_124, a3, dwArg38, out a0_253, out a3_256, out a4_257, out s2_261);
		a0Out = a0_253;
		a3Out = a3_256;
		a4Out = a4_257;
		s2Out = s2_261;
		s3Out = s3_107;
		s4Out = dwArg78;
		s5Out = s5_144;
		s8Out = s5;
		return dwArgE4;
	}
	int32 a4_36;
	struct Eq_130189 * a5_33 = (word32) *((word32) s0 + 22);
	if ((word32) *((word32) s1 + 22) < a5_33)
	{
		a5_33 = (word32) *((word32) s0 + 16);
		if (a5_33 << 0x14 < 0x00)
		{
			a4_36 = (word32) *((word32) s1 + 24);
l23029D22:
			uint32 a5_47 = a5_33 - a0_124;
			s0 = a5_33->t0008;
			a3.u0 = 0x04000000;
			a5_112 = (word32) (word27) a5_47;
			if (a5_112 > (struct Eq_130166 *) 0x04000000 || a4_36 >= (word32) ((word27) a5_47))
			{
				s1 = ((Eq_2[]) 32)[(word32) (word27) a5_47 / 4];
				if ((word32) (word27) a5_47 != 0x00)
					((word32) (word27) a5_47)();
				s3_107->ptr0008 = null;
			}
			goto l23029D44;
		}
	}
	a4_36 = (word32) *((word32) s1 + 23);
	goto l23029D22;
}

// 23029DE2: Register (ptr32 Eq_130351) ea_interval_duration_req(Register (ptr32 Eq_130352) a0, Register (ptr32 word16) a1, Register (ptr32 Eq_130351) a5)
// Called from:
//      lld_evt_update_create
//      lld_evt_move_to_slave
//      lld_scan_start
//      lld_con_start
//      lld_con_update_after_param_req
//      lld_con_param_rsp
//      lld_con_param_req
struct Eq_130351 * ea_interval_duration_req(struct Eq_130352 * a0, word16 * a1, struct Eq_130351 * a5)
{
	struct Eq_130351 * a3_5 = (word32) a0->w0002;
	*a1 = (word16) a3_5;
	struct Eq_130351 * a6_8 = (word32) a0->w0000;
	if (a6_8 >= a3_5)
	{
l23029E26:
		if (a5 < (struct Eq_130351 *) 0x02)
			a5 = (struct Eq_130351 *) 0x02;
		a5->ptr0004 = a1;
		return a5;
	}
	struct Eq_129275 * a2_11;
	struct Eq_130351 * a4_105 = (struct Eq_130351 *) 0x0FFFFFFF;
	uint32 a5_13 = 0x00;
	for (a2_11 = g_ptr4201319C; a2_11 != null; a2_11 = a2_11->ptr0000)
	{
		a5_13 = a5_13 + 0x01 & 0x00FF;
		if ((word32) a2_11->w000A != (word32) a0->w0010)
		{
			struct Eq_130351 * a7_22 = (word32) a2_11->w0004;
			if (a4_105 < a7_22)
				a7_22 = a4_105;
			a4_105 = (word32) (word16) a7_22;
		}
	}
	uint32 a5_53;
	if (a5_13 <= 0x01)
	{
		a4_105 = (word32) a0->b000A;
		if (a4_105 == null)
		{
			a5 = (struct Eq_130351 *) 0x0FFFFFFF;
			goto l23029E1E;
		}
		a5_53 = a3_5 ^ a4_105;
	}
	else
	{
		if (a3_5 < a4_105)
		{
			struct Eq_130351 * a2_38 = a3_5;
			a5 = (struct Eq_130351 *) 0x0FFFFFFF;
			do
			{
				word32 t1_43 = 0x00;
				if ((a4_105 & a2_38) == 0x00)
				{
					a5 = a2_38;
					t1_43 = 0x01;
				}
				a2_38 = (word32) (word16) ((char *) a2_38 - 2);
			} while (a2_38 >= a6_8 && t1_43 == 0x00);
l23029E1A:
			if (a5 >= a6_8)
			{
l23029E1E:
				if (a3_5 >= a5)
					*a1 = (word16) a5;
				goto l23029E26;
			}
			goto l23029E26;
		}
		a5_53 = a3_5 >> a4_105;
	}
	a5 = (word32) (word16) (a4_105 + a5_53 / 8);
	goto l23029E1A;
}

// 23029E8E: Register Eq_2 hci_send_2_host(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Register out ptr32 tpOut, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_130462) s2Out, Register out (ptr32 uint16) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_130466 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_discon_event_complete_send
//      llc_le_con_cmp_evt_send
//      llc_start
//      llc_con_update_complete_send
//      llc_ltk_req_send
//      llc_feats_rd_event_send
//      llc_version_rd_event_send
//      llc_common_cmd_complete_send
//      llc_common_cmd_status_send
//      llc_common_flush_occurred_send
//      llc_common_enc_key_ref_comp_evt_send
//      llc_common_enc_change_evt_send
//      lld_pdu_tx_flush
//      llm_end_evt_defer
//      llm_le_adv_report_ind
//      llm_common_cmd_complete_send
//      llm_common_cmd_status_send
//      llm_encryption_done
//      llcp_unknown_rsp_handler
//      llcp_length_rsp_handler
//      llcp_length_req_handler
//      llc_auth_payl_real_to_ind_handler
//      llc_data_ind_handler
//      llm_ecc_result_ind_handler
//      hci_le_rd_chnl_map_cmd_handler
//      hci_rd_auth_payl_to_cmd_handler
//      hci_rd_rssi_cmd_handler
//      hci_rd_tx_pwr_lvl_cmd_handler
//      hci_wr_auth_payl_to_cmd_handler
//      hci_flush_cmd_handler
//      hci_le_rd_rfpath_compensation_cmd_handler
//      hci_le_rd_trans_pwr_cmd_handler
//      hci_rd_buff_size_cmd_handler
//      hci_rd_local_supp_feats_cmd_handler
//      hci_rd_local_supp_cmds_cmd_handler
//      hci_rd_local_ver_info_cmd_handler
//      hci_rd_bd_addr_cmd_handler
//      hci_le_rd_max_data_len_cmd_handler
//      hci_le_rd_suggted_dft_data_len_cmd_handler
//      hci_le_rd_supp_states_cmd_handler
//      hci_le_rd_wl_size_cmd_handler
//      hci_le_rd_adv_ch_tx_pw_cmd_handler
//      hci_le_rd_local_supp_feats_cmd_handler
//      hci_le_rd_buff_size_cmd_handler
//      hci_le_rand_cmd_handler
//      hci_le_test_end_cmd_handler
Eq_2 hci_send_2_host(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, ptr32 & tpOut, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_130462 & s2Out, uint16 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_130466 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_130471 a5_18;
	word32 a3_13 = (word32) *((word32) a0 - 8);
	if (a3_13 != 0x00FFF803)
	{
		if (a3_13 != 0x00FFF804)
			goto l23029EB4;
		a5_18.u0 = 62;
	}
	else
	{
		a5_18 = (word32) *((word32) a0 - 4);
		if (a5_18 > 63)
		{
			if (a5_18 <= 87)
			{
				uint32 a5_22 = (word32) a5_18 - 64 & 0x00FF;
				if (((word32) (a5_22 >> 0x03)->b42025724 >> a5_22 - ((a5_22 >> 0x03) << 3) & 0x01) == 0x00)
				{
l23029F06:
					0x00 = (int8) dwArg38;
					ptr32 a0_136;
					ptr32 a2_138;
					ptr32 a3_139;
					ptr32 a4_140;
					ptr32 mstatus_143;
					ptr32 s1_145;
					struct Eq_130462 * s2_146;
					uint16 * s3_147;
					ptr32 s4_148;
					ptr32 s5_149;
					ptr32 tp_152;
					ptr32 s0_153;
					word32 a5_293;
					Eq_2 ra_144 = ble_ke_msg_free(ra, s0, a0, (word32) a0 - 0x0C, s2, s3, s4, s5, out tp_152, out s0_153, out s1_145, out a0_136, out a2_138, out a3_139, out a4_140, out a5_293, out s2_146, out s3_147, out s4_148, out s5_149, out mstatus_143);
					tpOut = tp_152;
					s0Out = s0_153;
					s1Out = s1_145;
					a0Out = a0_136;
					a2Out = a2_138;
					a3Out = a3_139;
					a4Out = a4_140;
					s2Out = s2_146;
					s3Out = s3_147;
					s4Out = s4_148;
					s5Out = s5_149;
					s6Out = s6;
					s7Out = s7;
					s9Out = s9;
					s10Out = s10;
					mstatusOut = mstatus_143;
					return ra_144;
				}
			}
			struct Eq_130604 * s0_41;
			Eq_2 s1_42;
			ptr32 s4_43;
			struct Eq_130462 * s2_51;
			uint16 * s3_52;
			ptr32 s5_53;
			Eq_2 ra_48 = hci_build_evt(ra, (word32) a0 - 0x0C, out s0_41, out s1_42, out s2_51, out s3_52, out s4_43, out s5_53);
			s0_41->w0006 = 0x04;
			0x00 = (int8) dwArg38;
			ptr32 a0_67;
			ptr32 a2_69;
			ptr32 a3_70;
			ptr32 a4_71;
			ptr32 mstatus_73;
			ptr32 s1_75;
			ptr32 tp_77;
			ptr32 s0_78;
			word32 a5_295;
			word32 t1_294;
			Eq_2 ra_74 = ble_ke_msg_send(ra_48, s0, s1_42, s1_42, dwArg10, out tp_77, out t1_294, out s0_78, out s1_75, out a0_67, out a2_69, out a3_70, out a4_71, out a5_295, out mstatus_73);
			tpOut = tp_77;
			s0Out = s0_78;
			s1Out = s1_75;
			a0Out = a0_67;
			a2Out = a2_69;
			a3Out = a3_70;
			a4Out = a4_71;
			s2Out = s2_51;
			s3Out = s3_52;
			s4Out = s4_43;
			s5Out = s5_53;
			s6Out = s6_54;
			s7Out = s7_55;
			s9Out = s9_56;
			s10Out = s10_49;
			mstatusOut = mstatus_73;
			return ra_74;
		}
	}
	int32 a5_82 = (word32) a5_18.u0 - 1;
	struct Eq_130558 * a2_85 = (a5_82 & 0x00FF) >> 0x03;
	if (((word32) a2_85->b4202571C >> (a5_82 & 0x00FF) - (a2_85 << 3) & 0x01) != 0x00)
	{
l23029EB4:
		uint32 a5_99 = a3_13 + ~0x00FFF800 << 16;
		if (a5_99 >> 16 <= 0x05)
		{
			<anonymous> * a5_158 = *((char *) g_a230B4EC4 + (a5_99 >> 16) * 0x04);
			ptr32 s0_162;
			ptr32 s1_163;
			Eq_2 ra_164;
			struct Eq_130462 * s2_165;
			ptr32 a0_166;
			ptr32 a3_167;
			ptr32 a4_169;
			ptr32 a2_170;
			ptr32 tp_171;
			ptr32 mstatus_173;
			ptr32 s4_174;
			word32 a7_178;
			ptr32 s10_179;
			word32 s11_180;
			uint16 * s3_181;
			ptr32 s5_182;
			Eq_130466 s6_183;
			ptr32 s7_184;
			ptr32 s9_185;
			word32 t0_186;
			word32 t4_187;
			word32 t1_188;
			a5_158();
			tpOut = tp_171;
			s0Out = s0_162;
			s1Out = s1_163;
			a0Out = a0_166;
			a2Out = a2_170;
			a3Out = a3_167;
			a4Out = a4_169;
			s2Out = s2_165;
			s3Out = s3_181;
			s4Out = s4_174;
			s5Out = s5_182;
			s6Out = s6_183;
			s7Out = s7_184;
			s9Out = s9_185;
			s10Out = s10_179;
			mstatusOut = mstatus_173;
			return ra_164;
		}
		goto l23029F06;
	}
	goto l23029F06;
}

