pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23029FB4: Register Eq_2 hci_send_2_controller(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Stack Eq_2 dwArg10, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      blecontroller_main
Eq_2 hci_send_2_controller(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 dwArg10, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	word32 a4_9 = (word32) *((word32) a0 - 8);
	if (a4_9 != 0x00FFF805)
	{
		if (a4_9 == 0x00FFF807)
		{
			uint32 a5_28 = (word32) *((word32) a0 - 6);
			if (a5_28 <= 0x01)
			{
				word32 a5_69 = (word32) (word16) (a5_28 << 8 | 1);
				*((word32) a0 + 0x0FFA) = (word16) a5_69;
				ptr32 mstatus_81;
				ptr32 s1_83;
				ptr32 s0_86;
				word32 tp_126;
				word32 t1_127;
				word32 a0_128;
				word32 a2_129;
				word32 a3_130;
				word32 a4_131;
				word32 a5_132;
				Eq_2 ra_82 = ble_ke_msg_send(ra, s0, s1, a0, dwArg10, out tp_126, out t1_127, out s0_86, out s1_83, out a0_128, out a2_129, out a3_130, out a4_131, out a5_132, out mstatus_81);
				s0Out = s0_86;
				s1Out = s1_83;
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s5Out = s5;
				mstatusOut = mstatus_81;
				return ra_82;
			}
		}
	}
	else
	{
		word32 a4_124;
		word32 a5_125;
		Eq_2 a0_18 = hci_look_for_cmd_desc((word32) *((word32) a0 - 4), out a4_124, out a5_125);
		if (a0_18 != 0x00 && ((word32) (*((word32) a0_18 + 2)) & 0x0F) <= 0x08)
			;
	}
	ptr32 mstatus_55;
	ptr32 s1_57;
	Eq_2 s2_58;
	Eq_2 s3_59;
	Eq_2 s4_60;
	Eq_2 s5_61;
	ptr32 s0_65;
	word32 tp_133;
	word32 a0_134;
	word32 a2_135;
	word32 a3_136;
	word32 a4_137;
	word32 a5_138;
	Eq_2 ra_56 = ble_ke_msg_free(ra, s0, s1, (word32) a0 - 0x0C, s2, s3, s4, s5, out tp_133, out s0_65, out s1_57, out a0_134, out a2_135, out a3_136, out a4_137, out a5_138, out s2_58, out s3_59, out s4_60, out s5_61, out mstatus_55);
	s0Out = s0_65;
	s1Out = s1_57;
	s2Out = s2_58;
	s3Out = s3_59;
	s4Out = s4_60;
	s5Out = s5_61;
	mstatusOut = mstatus_55;
	return ra_56;
}

// 2302A032: Register word32 hci_evt_mask_set(Register word32 ra, Register Eq_2 s0, Register word32 a0, Register word32 a1, Register out ptr32 a0Out, Register out Eq_130788 a3Out)
// Called from:
//      hci_init
//      hci_reset
//      hci_set_evt_mask_page_2_cmd_handler
//      hci_set_evt_mask_cmd_handler
word32 hci_evt_mask_set(word32 ra, Eq_2 s0, word32 a0, word32 a1, ptr32 & a0Out, union Eq_130788 & a3Out)
{
	if (a1 != 0x02)
	{
		if (a1 == 0x03)
		{
			<anonymous> * a5_28 = g_ptr4200F3D0;
			word32 s0_35;
			word32 a3_41;
			a5_28();
			struct Eq_130802 * a5_43 = s0_35 + 0x071C;
			byte * a4_44 = g_a230CB968;
			do
			{
				++a5_43;
				a3 = (word32) *a4_44 | (word32) a5_43->b0000;
				a5_43[0x0FFF] = (struct Eq_130802) (byte) a3;
				++a4_44;
			} while (a4_44 != (byte *) 3706930848);
		}
	}
	else
	{
		<anonymous> * a5_11 = g_ptr4200F3D0;
		word32 a4_24;
		a5_11();
	}
	a0Out = 0x00;
	a3Out = a3;
	return ra;
}

// 2302A0A8: Register word32 hci_init(Register word32 ra, Register Eq_2 s0)
// Called from:
//      rwip_init
word32 hci_init(word32 ra, Eq_2 s0)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	word32 ra_16;
	a5_5();
	word32 a0_54;
	word32 a3_55;
	word32 ra_38 = hci_tl_init(hci_evt_mask_set(ra_16, s0, 588036448, 0x03, out a0_54, out a3_55), 0x00);
	hci_fc_init();
	return ra_38;
}

// 2302A0DE: Register word32 hci_reset(Register word32 ra, Register Eq_2 s0, Register out ptr32 s0Out, Register out ptr32 a3Out)
// Called from:
//      rwip_init
word32 hci_reset(word32 ra, Eq_2 s0, ptr32 & s0Out, ptr32 & a3Out)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	word32 ra_16;
	ptr32 s0_46;
	ptr32 a3_47;
	a5_5();
	word32 a0_56;
	word32 a3_57;
	word32 ra_37 = hci_tl_init(hci_evt_mask_set(ra_16, s0, 588036448, 0x03, out a0_56, out a3_57), 0x01);
	hci_fc_init();
	s0Out = s0_46;
	a3Out = a3_47;
	return ra_37;
}

// 2302A114: Register Eq_2 rwip_reset(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      rwip_init
//      hci_reset_cmd_handler
Eq_2 rwip_reset(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_9 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	Eq_2 s1_25;
	Eq_2 s2_26;
	Eq_2 s3_27;
	Eq_2 s4_28;
	Eq_2 s5_29;
	ptr32 mstatus_41;
	Eq_2 s0_43;
	Eq_2 s5_48;
	int32 a3_55;
	word32 s0_59;
	word32 mstatus_71;
	word32 s1_73;
	word32 s2_74;
	word32 s3_75;
	word32 s4_76;
	word32 s5_77;
	Eq_2 ra_72 = rwble_reset(hci_reset(ecc_init(ble_ke_flush(ra, s0_9, s1, s2, s3, s4, s5, out s1_25, out s2_26, out s3_27, out s4_28, out s5_29), s0_9, s1_25, 0x01, s2_26, s3_27, s4_28, s5_29, out s0_43, out s5_48, out mstatus_41), s0_43, out s0_59, out a3_55), a3_55, s5_48, mstatus_41, dwLoc08, dwArg68, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s1_73, out s2_74, out s3_75, out s4_76, out s5_77, out mstatus_71);
	((union Eq_2 *) 0xD0)->u0 = 1107374504;
	g_w420131B4 = 0x0101;
	g_dw420131AC = 0x00;
	Eq_2 ra_100 = ea_init(ra_72);
	<anonymous> * a5_102 = g_ptr4202572C;
	Eq_2 ra_104;
	ptr32 mstatus_106;
	ptr32 a5_107;
	ptr32 a4_109;
	ptr32 s1_111;
	ptr32 s2_112;
	ptr32 s3_113;
	ptr32 s5_115;
	ptr32 a3_117;
	a5_102();
	__csrrw(mstatus_106, 0x00);
	s1Out = s1_111;
	a3Out = a3_117;
	a4Out = a4_109;
	a5Out = a5_107;
	s2Out = s2_112;
	s3Out = s3_113;
	s5Out = s5_115;
	mstatusOut = mstatus_106;
	return ra_104;
}

