pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302A16A: Register Eq_2 rwip_init(Register Eq_2 ra, Register word32 s0, Register word32 s1, Register word32 s2, Register Eq_2 s3, Register Eq_2 s5, Stack word32 dwArg00, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      ble_controller_init
Eq_2 rwip_init(Eq_2 ra, word32 s0, word32 s1, word32 s2, Eq_2 s3, Eq_2 s5, word32 dwArg00, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	word32 ra_21;
	Eq_2 s0_22;
	a5_5();
	Eq_2 s4_35;
	Eq_2 s0_39;
	word32 s1_54;
	word32 s2_55;
	Eq_2 s1_69;
	Eq_2 s2_70;
	Eq_2 ra_68 = ble_ke_mem_init(ble_ke_mem_init(ble_ke_init(ra_21, s0_22, dwLoc10, dwArg00, out s0_39, out s4_35), s0_39, 0x01000000, 0x00, 0x42025760, 0x00FFFAFF, s2, dwArg28, out s1_54, out s2_55), s0_39, s1_54, 0x01, g_dw4200EB3C, s1_54 + 0x00B6, s2_55, dwArg28, out s1_69, out s2_70);
	ble_rf_init(&g_ptr4202572C);
	Eq_2 s0_87;
	ptr32 mstatus_115;
	Eq_2 s0_117;
	Eq_2 s1_118;
	Eq_2 s2_119;
	Eq_2 s3_120;
	Eq_2 s4_121;
	Eq_2 s5_122;
	word32 s5_209;
	word32 mstatus_210;
	Eq_2 ra_138 = ea_init(rwble_init(hci_init(ecc_init(ra_68, s0_39, s1_69, 0x00, s2_70, s3, s4_35, s5, out s0_87, out s5_209, out mstatus_210), s0_87), dwLoc10, dwLoc08, dwArg68, dwArgB8, dwArgC8, dwArgD8, dwArg0108, out s0_117, out s1_118, out s2_119, out s3_120, out s4_121, out s5_122, out mstatus_115));
	*(union Eq_2 *) 0xD0 = s0_117;
	*((word32) s0_117 + 4) = 0x00;
	*((word32) s0_117 + 0x0C) = 0x0101;
	ptr32 a3_151;
	ptr32 a4_152;
	ptr32 a5_153;
	ptr32 mstatus_156;
	word32 s1_211;
	word32 s2_212;
	word32 s3_213;
	word32 s5_214;
	Eq_2 ra_157 = rwip_reset(ra_138, s1_118, s2_119, s3_120, s4_121, s5_122, mstatus_115, dwArg68, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s1_211, out a3_151, out a4_152, out a5_153, out s2_212, out s3_213, out s5_214, out mstatus_156);
	a3Out = a3_151;
	a4Out = a4_152;
	a5Out = a5_153;
	mstatusOut = mstatus_156;
	return ra_157;
}

// 2302A1F4: Register Eq_2 rwip_schedule(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_127275 a5Out, Register out Eq_2 s5Out)
// Called from:
//      blecontroller_main
Eq_2 rwip_schedule(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_127275 & a5Out, union Eq_2 & s5Out)
{
	ui32 a5_5 = (word32) g_w420131B2;
	if ((a5_5 & 0x01) != 0x00)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_5 & 0x01;
		s5Out = s5;
		return ra;
	}
	else
	{
		ptr32 a3_16;
		ptr32 a4_17;
		Eq_127275 a5_18;
		Eq_2 s1_22;
		Eq_2 s5_26;
		Eq_2 ra_20 = ble_ke_event_schedule(ra, s0, s1, s2, s3, s4, s5, out s1_22, out a3_16, out a4_17, out a5_18, out s5_26);
		s1Out = s1_22;
		a3Out = a3_16;
		a4Out = a4_17;
		a5Out = a5_18;
		s5Out = s5_26;
		return ra_20;
	}
}

// 2302A206: Register word32 rwip_wakeup_delay_set(Register ui32 a0)
// Called from:
//      lld_sleep_init
word32 rwip_wakeup_delay_set(ui32 a0)
{
	g_dw420131A8 = a0 << 0x0F >> 1000000;
	return 0x42013000;
}

// 2302A21E: Register int32 rwip_prevent_sleep_set(Register int32 a0, Register ptr32 mstatus, Register out Eq_131171 a3Out, Register out ptr32 a5Out)
// Called from:
//      rwip_wakeup
//      lld_evt_delete_elt_push
//      lld_evt_elt_delete
//      llm_encryption_start
int32 rwip_prevent_sleep_set(int32 a0, ptr32 mstatus, union Eq_131171 & a3Out, ptr32 & a5Out)
{
	__csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	Eq_131171 a3_9 = (word32) g_w420131B2;
	int32 a0_11 = a0 | a3_9;
	g_w420131B2 = (word16) a0_11;
	__csrrw(mstatus, 0x00);
	a3Out = a3_9;
	a5Out = 1107374504;
	return a0_11;
}

// 2302A23E: Register word32 rwip_wakeup(Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      rwble_isr
word32 rwip_wakeup(ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_131193 * a5_11;
	word32 a3_23;
	struct Eq_131195 * a0_8 = rwip_prevent_sleep_set(0x01, mstatus, out a3_23, out a5_11);
	ptr32 a3_16;
	ptr32 a4_17;
	word32 a0_14 = lld_sleep_wakeup(a0_8, a5_11, out a3_16, out a4_17);
	a3Out = a3_16;
	a4Out = a4_17;
	return a0_14;
}

// 2302A250: Register int32 rwip_prevent_sleep_clear(Register int32 a0, Register ptr32 mstatus, Register out Eq_131216 a3Out)
// Called from:
//      rwip_wakeup_end
//      lld_evt_init
//      lld_evt_delete_elt_handler
//      llm_encryption_done
int32 rwip_prevent_sleep_clear(int32 a0, ptr32 mstatus, union Eq_131216 & a3Out)
{
	__csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	Eq_131216 a3_9 = (word32) g_w420131B2;
	int32 a0_12 = ~a0 & a3_9;
	g_w420131B2 = (word16) a0_12;
	__csrrw(mstatus, 0x00);
	a3Out = a3_9;
	return a0_12;
}

// 2302A274: Register Eq_2 rwip_wakeup_end(Register Eq_2 ra, Register Eq_2 s0, Stack Eq_2 dwArg00, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_isr
Eq_2 rwip_wakeup_end(Eq_2 ra, Eq_2 s0, Eq_2 dwArg00, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	if (((word32) g_w420131B2 & 0x01) == 0x00)
	{
		s0Out = s0;
		a0Out = a0;
		a3Out = a3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		lld_sleep_wakeup_end();
		ptr32 mstatus_20;
		Eq_2 s0_23;
		word32 t1_56;
		word32 a0_57;
		word32 a1_58;
		word32 a2_59;
		word32 a3_60;
		word32 a4_61;
		word32 a5_62;
		Eq_2 ra_21 = ble_ke_event_set(ra, s0, 0x03, dwArg00, out t1_56, out s0_23, out a0_57, out a1_58, out a2_59, out a3_60, out a4_61, out a5_62, out mstatus_20);
		ptr32 a3_28;
		ptr32 a0_27 = rwip_prevent_sleep_clear(0x01, mstatus_20, out a3_28);
		s0Out = s0_23;
		a0Out = a0_27;
		a3Out = a3_28;
		mstatusOut = mstatus_20;
		return ra_21;
	}
}

