pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302A29A: Register (ptr32 Eq_131195) rwip_sleep_lpcycles_2_us(Register (ptr32 Eq_131195) a0, Register (ptr32 Eq_131293) a5)
// Called from:
//      lld_sleep_wakeup
struct Eq_131195 * rwip_sleep_lpcycles_2_us(struct Eq_131195 * a0, struct Eq_131293 * a5)
{
	word32 a5_12 = a5 + a0 + (a0 << 0x08) + (a0 << 0x03);
	(a5_12 & 511)->dw0004 = a5->dw0004;
	return (char *) &a0->ptr0004 + 26 + (a5_12 >> 0x09);
}

// 2302A2C6: Register Eq_131315 rwip_us_2_lpcycles(Register Eq_131315 a0)
// Called from:
//      lld_sleep_init
Eq_131315 rwip_us_2_lpcycles(Eq_131315 a0)
{
	return a0 << 0x0F >> 1000000;
}

// 2302A2D6: Register Eq_2 ble_co_list_init(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 int32) a0, Register out ptr32 a0Out, Register out ptr32 a1Out)
// Called from:
//      ea_init
//      ecc_init
//      em_buf_init
//      lld_evt_init
//      lld_evt_init_evt
//      lld_pdu_check
//      lld_pdu_tx_prog
//      llm_init
//      hci_tl_init
Eq_2 ble_co_list_init(Eq_2 ra, Eq_2 s0, int32 * a0, ptr32 & a0Out, ptr32 & a1Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_131323 * s0_17;
	Eq_2 ra_18;
	ptr32 a0_19;
	ptr32 a1_20;
	a5_5();
	if (a0_19 == 0x00)
	{
		s0_17->dw0000 = 0x00;
		s0_17->dw0004 = 0x00;
	}
	a0Out = a0_19;
	a1Out = a1_20;
	return ra_18;
}

// 2302A2FE: Register Eq_2 ble_co_list_push_back(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register out (ptr32 Eq_129126) s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_129126) a5Out)
// Called from:
//      ea_interval_insert
//      ea_elt_insert
//      ea_finetimer_isr
//      ble_co_list_insert_after
//      ecc_multiplication_event_handler
//      ecc_gen_new_public_key
//      em_buf_init
//      em_buf_tx_free
//      lld_evt_deferred_elt_push
//      lld_evt_elt_wait_insert
//      lld_evt_schedule
//      lld_evt_delete_elt_push
//      lld_pdu_check
//      lld_pdu_data_send
//      lld_pdu_tx_push
//      lld_pdu_tx_prog
//      lld_pdu_tx_flush
//      lld_pdu_rx_handler
//      llm_util_bl_add
//      llm_le_adv_report_ind
//      ble_ke_task_schedule
//      ble_ke_state_set
//      llc_llcp_send
//      llm_enc_req_handler
//      llc_hci_acl_data_tx_handler
//      hci_le_enc_cmd_handler
Eq_2 ble_co_list_push_back(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, struct Eq_129126 & s1Out, ptr32 & a0Out, struct Eq_129126 & a5Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_129126 * a5_21;
	struct Eq_131341 * s0_22;
	Eq_2 ra_24;
	ptr32 a0_25;
	struct Eq_129126 * s1_23;
	a5_5();
	if (a0_25 == 0x00)
	{
		s1_23 = a5_21->ptr0000;
		if (a5_21 == null)
			s0_22->ptr0000 = s1_23;
		else
		{
			s1_23 = (struct Eq_129126 *) a5_21[4];
			s0_22->ptr0000 = a5_21;
		}
		s0_22->ptr0004 = s1_23;
		s0_22->ptr0000 = null;
	}
	s1Out = s1_23;
	a0Out = a0_25;
	a5Out = a5_21;
	return ra_24;
}

// 2302A338: Register Eq_2 ble_co_list_push_front(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register out ptr32 a0Out)
// Called from:
//      ea_elt_insert
Eq_2 ble_co_list_push_front(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, ptr32 & a0Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_131372 ** a5_21;
	struct Eq_131372 * s1_23;
	Eq_2 ra_24;
	ptr32 a0_25;
	a5_5();
	if (a0_25 == 0x00)
	{
		struct Eq_131372 * s0_29 = *a5_21;
		if (a5_21 == null)
			s1_23->ptr0004 = s0_29;
		*a5_21 = (struct Eq_131372 **) s1_23;
		s1_23->ptr0000 = s0_29;
	}
	a0Out = a0_25;
	return ra_24;
}

// 2302A36A: Register Eq_2 ble_co_list_pop_front(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register out (ptr32 Eq_129191) s0Out, Register out (ptr32 Eq_129191) a0Out, Register out (ptr32 Eq_129193) a1Out, Register out (ptr32 (ptr32 Eq_129191)) a5Out, Register out Eq_129195 s8Out)
// Called from:
//      ea_sw_isr
//      ea_elt_remove
//      ea_finetimer_isr
//      ecc_multiplication_event_handler
//      ecc_init
//      ble_ke_timer_schedule
//      ble_ke_timer_clear
//      ble_ke_flush
//      lld_evt_deferred_elt_pop
//      lld_evt_elt_wait_get
//      lld_evt_deffered_elt_handler
//      lld_evt_init
//      lld_evt_end_isr
//      lld_pdu_tx_flush_list
//      lld_pdu_check
//      lld_pdu_tx_prog
//      lld_pdu_tx_flush
//      lld_util_flush_list
//      llm_test_mode_start_tx
//      llm_init
//      llm_encryption_done
//      ble_ke_task_schedule
//      bt_onchiphci_send
Eq_2 ble_co_list_pop_front(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_129191 & s0Out, struct Eq_129191 & a0Out, struct Eq_129193 & a1Out, struct Eq_129191 & a5Out, union Eq_129195 & s8Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_129191 ** a5_16;
	Eq_2 ra_18;
	struct Eq_129193 * a1_20;
	struct Eq_129191 * a0_19;
	struct Eq_129191 * s0_17;
	a5_5();
	if (a0_19 == null)
	{
		s0_17 = a0_19->ptr0000;
		if (a0_19 != null)
		{
			a0_19 = (struct Eq_129191 *) *a5_16;
			*a5_16 = (struct Eq_129191 **) s0_17;
			if (a5_16 == null)
				s0_17->t0004.u1 = 0x00;
		}
	}
	s0Out = s0_17;
	a0Out = a0_19;
	a1Out = a1_20;
	a5Out = a5_16;
	s8Out = dwLoc1C;
	return ra_18;
}

// 2302A39E: Register Eq_2 ble_co_list_extract(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 a1, Register ui32 a2, Register Eq_2 s2, Register out (ptr32 Eq_129162) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ea_interval_remove
//      ea_elt_insert
//      ea_elt_remove
//      llc_stop
//      lld_evt_elt_wait_get
//      lld_evt_elt_delete
//      lld_evt_delete_elt_handler
//      lld_pdu_tx_prog
Eq_2 ble_co_list_extract(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 a0, Eq_2 a1, ui32 a2, Eq_2 s2, struct Eq_129162 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s8Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 s2_30;
	Eq_2 ra_31;
	word32 a0_32;
	ptr32 a2_34;
	Eq_2 a5_27;
	Eq_2 a3_35;
	Eq_2 a4_40;
	struct Eq_129162 * s0_103;
	Eq_2 s1_105;
	a5_5();
	byte bLoc11_110 = 0x00;
	if (a0_32 == 0x00)
	{
		s1_105 = *a5_27;
		a4_40.u0 = 0x00;
		while (a5_27 != 0x00)
		{
			if (a5_27 == s2_30)
			{
				a3_35.u0 = 0x01;
				bLoc11_110 = 0x01;
				goto l2302A3F0;
			}
			a4_40 = a5_27;
			a5_27 = *a5_27;
		}
		a3_35.u0 = 0x00;
		if (false)
		{
l2302A3F0:
			while (true)
			{
				Eq_2 a5_54 = *a3_35.u0;
				if (s0_103 == null)
					break;
				s0_103 = (struct Eq_129162 *) ((char *) s0_103 - 1);
			}
			if (a4_40 == 0x00)
				*a3_35.u0 = s1_105;
			else
				*a3_35.u0 = a4_40;
			s1_105 = *((byte) a3_35.u0 + 4);
			if (a3_35 == a5_54)
				*((byte) a4_40.u0 + 4) = s1_105;
		}
	}
	s0Out = s0_103;
	s1Out = s1_105;
	a0Out = (word32) bLoc11_110;
	a2Out = a2_34;
	a3Out = a3_35;
	a4Out = a4_40;
	s2Out = s2_30;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra_31;
}

