pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302A412: Register word32 ble_co_list_extract_after(Register word32 ra, Register Eq_2 s0, Register word32 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register word32 s2, Stack Eq_2 dwArg38, Register out (ptr32 Eq_128883) s1Out, Register out (ptr32 Eq_128883) s2Out)
// Called from:
//      ea_elt_cancel
word32 ble_co_list_extract_after(word32 ra, Eq_2 s0, word32 s1, word32 a0, Eq_2 a1, Eq_2 a2, word32 s2, Eq_2 dwArg38, struct Eq_128883 & s1Out, struct Eq_128883 & s2Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_128883 ** a5_26;
	struct Eq_128883 * s1_28;
	struct Eq_128883 * s2_29;
	word32 ra_30;
	word32 a0_31;
	a5_5();
	if (a0_31 == 0x00)
	{
		struct Eq_128883 * a5_36;
		if (s1_28 == null)
		{
			a5_36 = (struct Eq_128883 *) *a5_26;
			a5_36->ptr0000 = (struct Eq_128883 *) *a5_26;
		}
		else
		{
			a5_36 = s2_29->ptr0000;
			a5_36->ptr0000 = s1_28;
		}
		word32 s0_43 = a5_36->dw0004;
		if (a5_36 == s2_29)
			s1_28->dw0004 = s0_43;
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_28;
	s2Out = s2_29;
	return ra_30;
}

// 2302A45A: Register Eq_2 ble_co_list_find(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register out (ptr32 Eq_131518) s0Out, Register out (ptr32 Eq_131518) s1Out, Register out ptr32 a0Out)
// Called from:
//      lld_evt_elt_delete
//      lld_evt_schedule_next
Eq_2 ble_co_list_find(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, struct Eq_131518 & s0Out, struct Eq_131518 & s1Out, ptr32 & a0Out)
{
	ptr32 a0_39;
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_131518 * s0_22;
	Eq_2 ra_24;
	struct Eq_131518 * a0_25;
	struct Eq_131518 * s1_23;
	a5_5();
	byte bLoc11_71 = SLICE(s0, byte, 24);
	if (a0_25 != null)
		a0_39 = (word32) bLoc11_71;
	else
	{
		s1_23 = a0_25->ptr0000;
		while (a0_25 != s0_22 && a0_25 != null)
			a0_25 = a0_25->ptr0000;
		a0_39 = (word32) (s0_22 - a0_25 < 1);
	}
	s0Out = s0_22;
	s1Out = s1_23;
	a0Out = a0_39;
	return ra_24;
}

// 2302A49E: Register Eq_2 ble_co_list_merge(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 int32) a1, Register out (ptr32 Eq_131552) s1Out, Register out ptr32 a0Out)
// Called from:
//      lld_pdu_check
//      lld_pdu_tx_prog
Eq_2 ble_co_list_merge(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, int32 * a1, struct Eq_131552 & s1Out, ptr32 & a0Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_131557 * a5_21;
	Eq_2 ra_24;
	ptr32 a0_25;
	struct Eq_131552 * a4_28;
	struct Eq_131552 * s1_23;
	a5_5();
	if (a0_25 == 0x00)
	{
		struct Eq_131552 * s0_30 = a4_28->ptr0000;
		if (a4_28 == null)
			a5_21->ptr0000 = s0_30;
		else
		{
			s0_30 = a4_28->ptr0004;
			a5_21->ptr0000 = a4_28;
		}
		s1_23 = a5_21->ptr0004;
		a5_21->ptr0004 = s0_30;
		s1_23->ptr0000 = null;
	}
	s1Out = s1_23;
	a0Out = a0_25;
	return ra_24;
}

// 2302A4DC: Register Eq_2 ble_co_list_insert_after(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg38, Register out Eq_2 s1Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      ea_elt_cancel
//      ea_elt_insert
Eq_2 ble_co_list_insert_after(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 dwArg38, union Eq_2 & s1Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 s0_27;
	Eq_2 s1_28;
	Eq_2 s2_29;
	Eq_2 ra_30;
	word32 a0_31;
	Eq_2 a5_26;
	a5_5();
	if (a0_31 == 0x00)
	{
		if (s0_27 == 0x00)
		{
l2302A502:
			0x00 = (int8) dwArg38;
			word32 a0_132;
			Eq_2 a5_74;
			Eq_2 s1_76;
			Eq_2 ra_75 = ble_co_list_push_back(ra_30, s0, s1_28, s2_29, s1_28, out s1_76, out a0_132, out a5_74);
			s1Out = s1_76;
			a5Out = a5_74;
			s2Out.u0 = <invalid>;
			return ra_75;
		}
		a5_26 = *s2_29;
		while (a5_26 != s0_27)
		{
			if (a5_26 == 0x00)
				goto l2302A502;
			a5_26 = *a5_26;
		}
		if (a5_26 == 0x00)
			*((word32) s2_29 + 4) = s1_28;
		Eq_2 s0_46 = *a5_26;
		*a5_26 = s1_28;
		*s1_28 = s0_46;
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_28;
	a5Out = a5_26;
	s2Out.u0 = <invalid>;
	return ra_30;
}

// 2302A53C: Register Eq_2 ble_co_list_size(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register out (ptr32 Eq_131640) s0Out, Register out ptr32 a0Out)
// Called from:
//      ble_ke_msg_get_sent_num
//      lld_pdu_tx_prog
//      llm_le_adv_report_ind
Eq_2 ble_co_list_size(Eq_2 ra, Eq_2 s0, word32 a0, struct Eq_131640 & s0Out, ptr32 & a0Out)
{
	ptr32 a0_27;
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_19;
	word32 a0_20;
	struct Eq_131640 * a5_17;
	struct Eq_131640 * s0_18;
	a5_5();
	word16 wLoc12_40 = 0x00;
	if (a0_20 != 0x00)
		a0_27 = 0x00;
	else
	{
		s0_18 = a5_17->ptr0000;
		while (true)
		{
			a0_27 = (word32) wLoc12_40;
			if (a5_17 == null)
				break;
			a5_17 = a5_17->ptr0000;
			wLoc12_40 = (word16) (a0_27 + 0x01);
		}
	}
	s0Out = s0_18;
	a0Out = a0_27;
	return ra_19;
}

// 2302A578: void co_bdaddr_set(Register ptr32 a0)
// Called from:
//      bdaddr_init
void co_bdaddr_set(ptr32 a0)
{
	g_ptr4200F3D0();
}

// 2302A58E: Register Eq_2 co_bdaddr_compare(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_131674 a5Out)
// Called from:
//      lld_init
//      llm_util_bd_addr_wl_position
//      llm_util_check_address_validity
//      llm_util_bl_check
//      llm_le_adv_report_ind
//      llm_set_adv_en
//      llm_set_scan_en
//      llm_create_con
//      hci_le_set_rand_add_cmd_handler
Eq_2 co_bdaddr_compare(Eq_2 a0, Eq_2 a1, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_131674 & a5Out)
{
	Eq_131674 a5_14 = 0x00;
	do
	{
		if (CONVERT(Mem0[a0 + a5_14:byte], byte, word32) != CONVERT(Mem0[a1 + a5_14:byte], byte, word32))
		{
			a2Out.u0 = <invalid>;
			a3Out.u0 = <invalid>;
			a4Out.u0 = <invalid>;
			a5Out = a5_14;
			return 0x00;
		}
		a5_14 = (word32) a5_14.u0 + 1;
	} while (a5_14 != 0x06);
	a2Out.u0 = <invalid>;
	a3Out.u0 = <invalid>;
	a4Out.u0 = <invalid>;
	a5Out = a5_14;
	return 0x01;
}

// 2302A5B4: Register Eq_2 Mont2GF(Register Eq_2 ra, Register ui32 s1, Register ui32 a0, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArg64, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      ecc_multiplication_event_handler
Eq_2 Mont2GF(Eq_2 ra, ui32 s1, ui32 a0, ui32 s2, ui32 s3, Eq_2 dwArg64, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	sec_eng_pka0_pld(0x08, 587945800, 0x0D, 0x03, 57, 0x00);
	sec_eng_pka0_clir(0x01, 0x03, 0x06, 0x00);
	sec_eng_pka0_clir(0x01, 0x03, 0x07, 0x00);
	ui32 s0_60;
	ui32 s1_61;
	ui32 s2_62;
	ui32 s3_63;
	ptr32 s1_85;
	ptr32 s2_86;
	ptr32 s3_87;
	ptr32 s4_88;
	word32 s0_112;
	Eq_2 ra_83 = sec_eng_pka0_mrem(sec_eng_pka0_lmul(ra, s1, 0x00, 0x04, 0x03, 0x03, a0, 0x03, s2, s3, ra, out s0_60, out s1_61, out s2_62, out s3_63), s1_61, 0x00, 0x03, s0_60, 0x04, 0x03, 0x03, s2_62, s3_63, dwArg64, out s0_112, out s1_85, out s2_86, out s3_87, out s4_88);
	sec_eng_pka0_clir(0x01, 0x04, 0x03, 0x00);
	s1Out = s1_85;
	s2Out = s2_86;
	s3Out = s3_87;
	s4Out = s4_88;
	return ra_83;
}

// 2302A622: Register Eq_2 getFinalPoint(Register Eq_2 ra, Register ui32 s1, Register ui32 a0, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArg64, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      ecc_multiplication_event_handler
Eq_2 getFinalPoint(Eq_2 ra, ui32 s1, ui32 a0, ui32 s2, ui32 s3, Eq_2 dwArg64, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	sec_eng_pka0_clir(0x01, 0x03, 0x06, 0x00);
	sec_eng_pka0_clir(0x01, 0x03, 0x07, 0x00);
	ui32 s0_47;
	ui32 s1_48;
	ui32 s2_49;
	ui32 s3_50;
	ptr32 s1_72;
	ptr32 s2_73;
	ptr32 s3_74;
	ptr32 s4_75;
	word32 s0_99;
	Eq_2 ra_70 = sec_eng_pka0_mrem(sec_eng_pka0_lmul(ra, s1, 0x00, 0x04, 0x03, 0x03, a0, 0x03, s2, s3, ra, out s0_47, out s1_48, out s2_49, out s3_50), s1_48, 0x00, 0x03, s0_47, 0x04, 0x03, 0x03, s2_49, s3_50, dwArg64, out s0_99, out s1_72, out s2_73, out s3_74, out s4_75);
	sec_eng_pka0_clir(0x01, 0x04, 0x03, 0x00);
	s1Out = s1_72;
	s2Out = s2_73;
	s3Out = s3_74;
	s4Out = s4_75;
	return ra_70;
}

// 2302A678: Register Eq_2 pka_point_addition.constprop.3(Register Eq_2 ra, Register ui32 a0, Register ui32 a1, Register ui32 a2, Stack Eq_2 dwArg54, Stack word32 dwArgF8, Stack word32 dwArg0128, Register out (ptr32 Eq_131872) s0Out, Register out (ptr32 Eq_131873) s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      pka_addition_win.constprop.1
//      ecc_multiplication_event_handler
Eq_2 pka_point_addition.constprop.3(Eq_2 ra, ui32 a0, ui32 a1, ui32 a2, Eq_2 dwArg54, word32 dwArgF8, word32 dwArg0128, struct Eq_131872 & s0Out, struct Eq_131873 & s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ui32 s0_47;
	ui32 s2_49;
	ui32 s3_50;
	ui32 s2_76;
	ui32 s3_77;
	ui32 s2_102;
	ui32 s3_103;
	ui32 s2_128;
	ui32 s3_129;
	ui32 s2_154;
	ui32 s3_155;
	ui32 s1_179;
	ui32 s2_180;
	ui32 s3_181;
	ui32 s0_204;
	ui32 s2_206;
	ui32 s3_207;
	ui32 s0_230;
	ui32 s1_231;
	ui32 s2_232;
	ui32 s3_233;
	ui32 s2_258;
	ui32 s3_259;
	ui32 s2_284;
	ui32 s3_285;
	ui32 s2_310;
	ui32 s3_311;
	ui32 s2_336;
	ui32 s3_337;
	ui32 s2_362;
	ui32 s3_363;
	ui32 s2_388;
	ui32 s3_389;
	ui32 s0_412;
	ui32 s2_414;
	ui32 s3_415;
	ui32 s1_439;
	ui32 s2_440;
	ui32 s3_441;
	ui32 s1_465;
	ui32 s2_466;
	ui32 s3_467;
	ui32 s2_493;
	ui32 s3_494;
	ui32 s0_517;
	ui32 s2_519;
	ui32 s3_520;
	ui32 s0_543;
	ui32 s2_545;
	ui32 s3_546;
	ui32 s0_569;
	ui32 s2_571;
	ui32 s3_572;
	struct Eq_131873 * s1_597;
	ptr32 s2_598;
	word32 s1_658;
	word32 s0_659;
	word32 s1_660;
	word32 s0_661;
	word32 s1_662;
	word32 s0_663;
	word32 s1_664;
	word32 s0_665;
	word32 s1_666;
	word32 s0_667;
	word32 s1_668;
	word32 s0_669;
	word32 s1_670;
	word32 s0_671;
	word32 s1_672;
	word32 s0_673;
	word32 s1_674;
	word32 s0_675;
	word32 s1_676;
	word32 s0_677;
	word32 s1_678;
	word32 s0_679;
	word32 s1_680;
	word32 s1_681;
	word32 s0_682;
	word32 s0_683;
	word32 s0_684;
	word32 s1_685;
	word32 s1_686;
	word32 s1_687;
	word32 s1_688;
	word32 s0_689;
	word32 s3_690;
	Eq_2 ra_595 = sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(ra, 0x00, 0x03, 0x0D, 0x03, a1 + 1 & 0x00FF, 0x03, 0x03, a0, a2, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_47, out s1_658, out s2_49, out s3_50), 0x00, 0x03, 0x0E, 0x03, s0_47, 0x03, 0x03, s2_49, s3_50, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_659, out s1_660, out s2_76, out s3_77), 0x00, 0x03, 0x0F, 0x03, a1, 0x03, 0x03, s2_76, s3_77, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_661, out s1_662, out s2_102, out s3_103), 0x00, 0x03, 0x10, 0x03, s2_102, 0x03, 0x03, s2_102, s3_103, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_663, out s1_664, out s2_128, out s3_129), 0x00, 0x03, 0x0D, 0x03, 0x0D, 0x03, 0x03, s2_128, s3_129, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_665, out s1_666, out s2_154, out s3_155), 0x00, 0x03, 0x0F, 0x03, 0x0F, 0x03, 0x03, s2_154, s3_155, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_667, out s1_179, out s2_180, out s3_181), 0x00, 0x03, s2_180, 0x03, s1_179, 0x03, 0x03, s2_180, s3_181, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_204, out s1_668, out s2_206, out s3_207), 0x00, 0x03, s0_204, 0x03, 0x0F, 0x03, 0x03, s2_206, s3_207, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_230, out s1_231, out s2_232, out s3_233), 0x00, 0x03, s1_231, 0x03, s0_230, 0x03, 0x03, s2_232, s3_233, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_669, out s1_670, out s2_258, out s3_259), 0x00, 0x03, 0x11, 0x03, 0x0D, 0x03, 0x03, s2_258, s3_259, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_671, out s1_672, out s2_284, out s3_285), 0x00, 0x03, 0x11, 0x03, 0x11, 0x03, 0x03, s2_284, s3_285, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_673, out s1_674, out s2_310, out s3_311), 0x00, 0x03, 0x11, 0x03, 0x11, 0x03, 0x03, s2_310, s3_311, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_675, out s1_676, out s2_336, out s3_337), 0x00, 0x03, 0x12, 0x03, 0x09, 0x03, 0x03, s2_336, s3_337, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_677, out s1_678, out s2_362, out s3_363), 0x00, 0x03, 0x12, 0x03, 0x12, 0x03, 0x03, s2_362, s3_363, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_679, out s1_680, out s2_388, out s3_389), 0x00, 0x03, 0x12, 0x03, 0x11, 0x03, 0x03, s2_388, s3_389, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_412, out s1_681, out s2_414, out s3_415), 0x00, 0x03, s0_412, 0x03, s0_412, 0x03, 0x03, s2_414, s3_415, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_682, out s1_439, out s2_440, out s3_441), 0x00, 0x03, 0x0E, 0x03, s1_439, 0x03, 0x03, s2_440, s3_441, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_683, out s1_465, out s2_466, out s3_467), 0x00, 0x03, s3_467 + 2 & 0x00FF, 0x03, s1_465, 0x03, 0x03, s2_466, s3_467, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_684, out s1_685, out s2_493, out s3_494), 0x00, 0x03, s3_494, 0x03, 0x0F, 0x03, 0x03, s2_493, s3_494, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_517, out s1_686, out s2_519, out s3_520), 0x00, 0x03, s0_517, 0x03, s0_517, 0x03, 0x03, s2_519, s3_520, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_543, out s1_687, out s2_545, out s3_546), 0x00, 0x03, s0_543, 0x03, 0x0D, 0x03, 0x03, s2_545, s3_546, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_569, out s1_688, out s2_571, out s3_572), 0x01, 0x03, s3_572 + 1 & 0x00FF, 0x03, s0_569, 0x03, 0x03, s2_571, s3_572, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_689, out s1_597, out s2_598, out s3_690);
	sec_eng_pka0_wait_4_isr();
	0x00 = dwArg0128;
	sec_eng_pka0_clear_int();
	s0Out = dwArgE4;
	s1Out = s1_597;
	s2Out = s2_598;
	s4Out = dwArg78;
	return ra_595;
}

// 2302A8B4: Register Eq_2 pka_read_result.constprop.4(Register Eq_2 ra, Register Eq_132314 a0, Register ui32 a1, Stack word32 dwArg0118, Stack word32 dwArg0128, Register out (ptr32 Eq_132318) s0Out, Register out (ptr32 Eq_132319) s1Out, Register out ptr32 s2Out)
// Called from:
//      pka_addition_win.constprop.1
//      ecc_multiplication_event_handler
//      ecc_gen_new_public_key
Eq_2 pka_read_result.constprop.4(Eq_2 ra, Eq_132314 a0, ui32 a1, word32 dwArg0118, word32 dwArg0128, struct Eq_132318 & s0Out, struct Eq_132319 & s1Out, ptr32 & s2Out)
{
	word32 s0_25;
	word32 s1_26;
	word32 s0_48;
	word32 s1_49;
	word32 tp_95;
	word32 a4_96;
	word32 a6_97;
	word32 s2_98;
	word32 s3_99;
	word32 s4_100;
	word32 s5_101;
	word32 s6_102;
	word32 s8_103;
	word32 tp_104;
	word32 a4_105;
	word32 a6_106;
	word32 s2_107;
	word32 s3_108;
	word32 s4_109;
	word32 s5_110;
	word32 s6_111;
	word32 s8_112;
	Eq_2 ra_47 = sec_eng_pka0_read_data(sec_eng_pka0_read_data(ra, 0x03, a1, a0, 0x08, dwArg0118, out tp_95, out s0_25, out s1_26, out a4_96, out a6_97, out s2_98, out s3_99, out s4_100, out s5_101, out s6_102, out s8_103), 0x03, s0_25 + 1 & 0x00FF, s1_26 + 40, 0x08, dwArg0118, out tp_104, out s0_48, out s1_49, out a4_105, out a6_106, out s2_107, out s3_108, out s4_109, out s5_110, out s6_111, out s8_112);
	ui32 a1_64 = s0_48 + 2 & 0x00FF;
	struct Eq_132318 * s0_75;
	struct Eq_132319 * s1_76;
	ptr32 s2_77;
	word32 tp_113;
	word32 a4_114;
	word32 a6_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	word32 s6_119;
	word32 s8_120;
	Eq_2 ra_74 = sec_eng_pka0_read_data(ra_47, 0x03, a1_64, s1_49 + 80, 0x08, dwArg0128, out tp_113, out s0_75, out s1_76, out a4_114, out a6_115, out s2_77, out s3_116, out s4_117, out s5_118, out s6_119, out s8_120);
	s0Out = s0_75;
	s1Out = s1_76;
	s2Out = s2_77;
	return ra_74;
}

// 2302A8FA: Register Eq_2 pka_cp_x2_to_x1.constprop.5(Register Eq_2 ra, Register ui32 a0, Register ui32 a1, Register ui32 s2, Register ui32 s3, Stack ui32 dwArg10, Stack Eq_2 dwArg84, Stack Eq_2 dwArg94, Register out (ptr32 Eq_132440) s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      pka_addition_win.constprop.1
//      ecc_multiplication_event_handler
Eq_2 pka_cp_x2_to_x1.constprop.5(Eq_2 ra, ui32 a0, ui32 a1, ui32 s2, ui32 s3, ui32 dwArg10, Eq_2 dwArg84, Eq_2 dwArg94, struct Eq_132440 & s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ui32 s1_29;
	ui32 s2_30;
	ui32 s3_31;
	ui32 s1_50;
	ui32 s2_51;
	ui32 s3_52;
	word32 s4_90;
	word32 s4_91;
	Eq_2 ra_49 = sec_eng_pka0_movdat(sec_eng_pka0_movdat(ra, a1, 0x00, 0x03, a0, 0x03, a1, s2, s3, dwArg84, out s1_29, out s2_30, out s3_31, out s4_90), s1_29, 0x00, 0x03, a0 + 1 & 0x00FF, 0x03, s1_29 + 1 & 0x00FF, s2_30, s3_31, dwArg84, out s1_50, out s2_51, out s3_52, out s4_91);
	ui32 a4_60 = s1_50 + 2 & 0x00FF;
	struct Eq_132440 * s1_74;
	ptr32 s2_75;
	ptr32 s4_77;
	word32 s3_92;
	Eq_2 ra_73 = sec_eng_pka0_movdat(ra_49, s1_50, 0x00, 0x03, dwArg10 & 0x00FF, 0x03, a4_60, s2_51, s3_52, dwArg94, out s1_74, out s2_75, out s3_92, out s4_77);
	s1Out = s1_74;
	s2Out = s2_75;
	s4Out = s4_77;
	return ra_73;
}

// 2302A950: Register Eq_2 pka_point_inf_check.constprop.7(Register Eq_2 ra, Register ui32 a0, Register word32 s4, Stack word32 dwArg08, Stack word32 dwArg0128, Register out (ptr32 Eq_132519) s0Out, Register out (ptr32 Eq_132520) s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      pka_point_double.constprop.2
//      pka_addition_win.constprop.1
//      ecc_multiplication_event_handler
Eq_2 pka_point_inf_check.constprop.7(Eq_2 ra, ui32 a0, word32 s4, word32 dwArg08, word32 dwArg0128, struct Eq_132519 & s0Out, struct Eq_132520 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	byte bLoc21_139 = SLICE(s4, byte, 24);
	ui32 s3_39;
	ui32 s3_60;
	word32 s2_80;
	ui32 s3_81;
	int32 s1_103;
	ptr32 s2_104;
	ptr32 s3_105;
	byte * s4_106;
	word32 s1_151;
	word32 s2_152;
	word32 s4_153;
	word32 s1_154;
	word32 s2_155;
	word32 s4_156;
	word32 s1_157;
	word32 s4_158;
	Eq_2 ra_102 = sec_eng_pka0_lcmp(sec_eng_pka0_lcmp(sec_eng_pka0_lcmp(sec_eng_pka0_lcmp(ra, fp + -33, 0x03, a0, 0x03, 0x08, a0 + 1 & 0x00FF, dwArg08, ra, out s1_151, out s2_152, out s3_39, out s4_153), fp + -33, 0x03, s3_39, 0x03, 0x13, s3_39, dwArg08, ra, out s1_154, out s2_155, out s3_60, out s4_156), fp + -33, 0x03, 0x14, 0x03, s3_60, s3_60, dwArg08, ra, out s1_157, out s2_80, out s3_81, out s4_158), fp + -33, 0x03, s2_80 + 2 & 0x00FF, 0x03, 0x08, s3_81, dwArg08, ra, out s1_103, out s2_104, out s3_105, out s4_106);
	*s4_106 = (byte) (word32) ((int32) (byte) ((int32) (byte) ((word32) bLoc21_139 << 2 | s1_103 >> 24 | (word32) bLoc21_139) | (word32) bLoc21_139 << 3) < ~0x0F);
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_103 >> 24;
	s2Out = s2_104;
	s3Out = s3_105;
	s4Out = dwArg78;
	return ra_102;
}

// 2302A9F8: Register Eq_2 GF2Mont.constprop.8(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 s2, Register word32 s3, Register Eq_2 s4, Stack Eq_2 dwArg64, Stack word32 dwArg0118, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      ecc_gen_new_public_key
Eq_2 GF2Mont.constprop.8(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 s2, word32 s3, Eq_2 s4, Eq_2 dwArg64, word32 dwArg0118, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	sec_eng_pka0_pld(0x08, 587945864, 0x00, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, a0, 0x01, 0x03, 57, 0x00);
	ui32 s1_57;
	ui32 s2_58;
	ui32 s3_59;
	Eq_132314 s0_80;
	ptr32 a4_92;
	ptr32 s2_102;
	ptr32 s3_103;
	ptr32 s4_104;
	ptr32 s5_105;
	ptr32 s6_106;
	ptr32 s8_107;
	word32 s1_138;
	word32 s2_139;
	word32 s3_140;
	word32 s4_141;
	word32 tp_142;
	word32 s0_143;
	word32 s1_144;
	word32 a6_145;
	Eq_2 ra_99 = sec_eng_pka0_read_data(sec_eng_pka0_mrem(sec_eng_pka0_lmul2n(ra, a1, a0, 0x04, 0x01, 0x03, 0x01, 0x0100, s2, s3, s4, dwArg64, dwArg0118, out s1_57, out s2_58, out s3_59), s1_57, 0x00, 0x03, 0x04, 0x04, 0x01, 0x03, s2_58, s3_59, dwArg64, out s0_80, out s1_138, out s2_139, out s3_140, out s4_141), 0x03, 0x04, s0_80, 0x08, dwArg0118, out tp_142, out s0_143, out s1_144, out a4_92, out a6_145, out s2_102, out s3_103, out s4_104, out s5_105, out s6_106, out s8_107);
	a3Out = sec_eng_pka0_clir(0x01, 0x04, 0x01, 0x00);
	a4Out = a4_92;
	s2Out = s2_102;
	s3Out = s3_103;
	s4Out = s4_104;
	s5Out = s5_105;
	s6Out = s6_106;
	s8Out = s8_107;
	return ra_99;
}

