pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302AA72: Register Eq_2 pka_point_double.constprop.2(Register Eq_2 ra, Register ui32 a0, Register word32 s4, Stack Eq_2 dwArg54, Stack word32 dwArgF8, Stack word32 dwArg0128, Register out (ptr32 Eq_132756) s0Out, Register out (ptr32 Eq_132757) s1Out)
// Called from:
//      ecc_multiplication_event_handler
Eq_2 pka_point_double.constprop.2(Eq_2 ra, ui32 a0, word32 s4, Eq_2 dwArg54, word32 dwArgF8, word32 dwArg0128, struct Eq_132756 & s0Out, struct Eq_132757 & s1Out)
{
	ui32 s2_26;
	ui32 s3_27;
	word32 s0_678;
	word32 s4_679;
	struct Eq_132757 * s1_25;
	Eq_2 ra_23 = pka_point_inf_check.constprop.7(ra, a0, s4, dwLoc28, dwArgF8, out s0_678, out s1_25, out s2_26, out s3_27, out s4_679);
	if ((word32) bLoc11 == 0x00)
	{
		ui32 s0_53;
		ui32 s2_55;
		ui32 s3_56;
		ui32 s2_81;
		ui32 s3_82;
		ui32 s2_107;
		ui32 s3_108;
		ui32 s1_134;
		ui32 s2_135;
		ui32 s3_136;
		ui32 s2_161;
		ui32 s3_162;
		ui32 s0_185;
		ui32 s2_187;
		ui32 s3_188;
		ui32 s2_213;
		ui32 s3_214;
		ui32 s2_239;
		ui32 s3_240;
		ui32 s0_263;
		ui32 s2_265;
		ui32 s3_266;
		ui32 s2_291;
		ui32 s3_292;
		ui32 s2_317;
		ui32 s3_318;
		ui32 s2_343;
		ui32 s3_344;
		ui32 s2_369;
		ui32 s3_370;
		ui32 s2_395;
		ui32 s3_396;
		ui32 s1_420;
		ui32 s2_421;
		ui32 s3_422;
		ui32 s2_447;
		ui32 s3_448;
		ui32 s1_472;
		ui32 s2_473;
		ui32 s3_474;
		ui32 s1_498;
		ui32 s2_499;
		ui32 s3_500;
		ui32 s1_524;
		ui32 s2_525;
		ui32 s3_526;
		ui32 s0_549;
		ui32 s2_551;
		ui32 s3_552;
		ui32 s0_575;
		ui32 s2_577;
		ui32 s3_578;
		word32 s1_680;
		word32 s0_681;
		word32 s1_682;
		word32 s0_683;
		word32 s1_684;
		word32 s0_685;
		word32 s0_686;
		word32 s1_687;
		word32 s1_688;
		word32 s0_689;
		word32 s1_690;
		word32 s0_691;
		word32 s1_692;
		word32 s1_693;
		word32 s0_694;
		word32 s1_695;
		word32 s0_696;
		word32 s1_697;
		word32 s0_698;
		word32 s1_699;
		word32 s0_700;
		word32 s1_701;
		word32 s0_702;
		word32 s1_703;
		word32 s0_704;
		word32 s0_705;
		word32 s1_706;
		word32 s0_707;
		word32 s0_708;
		word32 s0_709;
		word32 s1_710;
		word32 s1_711;
		word32 s0_712;
		word32 s2_713;
		word32 s3_714;
		ra_23 = sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_mmul(sec_eng_pka0_msub(sec_eng_pka0_mmul(sec_eng_pka0_mmul(ra_23, 0x00, 0x03, 0x0D, 0x03, s2_26, 0x03, 0x03, s2_26, s3_27, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_53, out s1_680, out s2_55, out s3_56), 0x00, 0x03, 0x0E, 0x03, s0_53, 0x03, 0x03, s2_55, s3_56, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_681, out s1_682, out s2_81, out s3_82), 0x00, 0x03, 0x0D, 0x03, 0x0D, 0x03, 0x03, s2_81, s3_82, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_683, out s1_684, out s2_107, out s3_108), 0x00, 0x03, 0x0D, 0x03, 0x0A, 0x03, 0x03, s2_107, s3_108, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_685, out s1_134, out s2_135, out s3_136), 0x00, 0x03, 0x0E, 0x03, s1_134, 0x03, 0x03, s2_135, s3_136, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_686, out s1_687, out s2_161, out s3_162), 0x00, 0x03, 0x0F, 0x03, s2_161, 0x03, 0x03, s2_161, s3_162, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_185, out s1_688, out s2_187, out s3_188), 0x00, 0x03, s0_185, 0x03, 0x0D, 0x03, 0x03, s2_187, s3_188, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_689, out s1_690, out s2_213, out s3_214), 0x00, 0x03, 0x0F, 0x03, 0x0F, 0x03, 0x03, s2_213, s3_214, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_691, out s1_692, out s2_239, out s3_240), 0x00, 0x03, s2_239, 0x03, 0x0C, 0x03, 0x03, s2_239, s3_240, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_263, out s1_693, out s2_265, out s3_266), 0x00, 0x03, s0_263, 0x03, s0_263, 0x03, 0x03, s2_265, s3_266, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_694, out s1_695, out s2_291, out s3_292), 0x00, 0x03, s2_291, 0x03, 0x09, 0x03, 0x03, s2_291, s3_292, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_696, out s1_697, out s2_317, out s3_318), 0x00, 0x03, s2_317, 0x03, s2_317, 0x03, 0x03, s2_317, s3_318, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_698, out s1_699, out s2_343, out s3_344), 0x00, 0x03, 0x0F, 0x03, 11, 0x03, 0x03, s2_343, s3_344, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_700, out s1_701, out s2_369, out s3_370), 0x00, 0x03, 0x10, 0x03, 0x0E, 0x03, 0x03, s2_369, s3_370, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_702, out s1_703, out s2_395, out s3_396), 0x00, 0x03, 0x0F, 0x03, 0x0F, 0x03, 0x03, s2_395, s3_396, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_704, out s1_420, out s2_421, out s3_422), 0x00, 0x03, s1_420, 0x03, s1_420, 0x03, 0x03, s2_421, s3_422, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_705, out s1_706, out s2_447, out s3_448), 0x00, 0x03, 0x0F, 0x03, 0x0F, 0x03, 0x03, s2_447, s3_448, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_707, out s1_472, out s2_473, out s3_474), 0x00, 0x03, s1_472, 0x03, 0x0C, 0x03, 0x03, s2_473, s3_474, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_708, out s1_498, out s2_499, out s3_500), 0x00, 0x03, s1_498, 0x03, s1_498, 0x03, 0x03, s2_499, s3_500, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_709, out s1_524, out s2_525, out s3_526), 0x00, 0x03, s1_524, 0x03, 0x0F, 0x03, 0x03, s2_525, s3_526, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_549, out s1_710, out s2_551, out s3_552), 0x00, 0x03, s0_549, 0x03, 0x0E, 0x03, 0x03, s2_551, s3_552, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_575, out s1_711, out s2_577, out s3_578), 0x01, 0x03, s0_575, 0x03, 0x0C, 0x03, 0x03, s2_577, s3_578, 0x00, dwLoc28, dwArg54, dwArgF8, out s0_712, out s1_25, out s2_713, out s3_714);
		sec_eng_pka0_wait_4_isr();
		sec_eng_pka0_clear_int();
	}
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_25;
	return ra_23;
}

// 2302AC96: Register Eq_2 pka_addition_win.constprop.1(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register word32 s2, Register word32 s4, Stack Eq_2 dwArg34, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack word32 dwArgD8, Stack word32 dwArgF8, Stack word32 dwArg0108, Register out (ptr32 Eq_133171) s0Out, Register out (ptr32 Eq_133172) s1Out)
// Called from:
//      ecc_multiplication_event_handler
Eq_2 pka_addition_win.constprop.1(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, word32 s2, word32 s4, Eq_2 dwArg34, Eq_2 dwArg64, Eq_2 dwArg74, word32 dwArgD8, word32 dwArgF8, word32 dwArg0108, struct Eq_133171 & s0Out, struct Eq_133172 & s1Out)
{
	Eq_2 ra_144;
	Eq_132314 s2_147;
	ui32 a1_156;
	sec_eng_pka0_pld(0x08, a0, 0x15, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, (word32) a0 + 40, 22, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, (word32) a0 + 80, 0x17, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, a1, 0x18, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, (word32) a1 + 40, 0x19, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, (word32) a1 + 80, 0x1A, 0x03, 57, 0x00);
	byte bLoc11_220 = SLICE(s0, byte, 24);
	word32 s4_105;
	ui32 s2_122;
	ui32 s3_123;
	word32 s0_268;
	word32 s1_269;
	word32 s4_270;
	word32 s2_266;
	word32 s3_267;
	word32 s0_264;
	word32 s1_265;
	Eq_2 ra_119 = pka_point_inf_check.constprop.7(pka_point_inf_check.constprop.7(ra, 0x15, s4, s2, dwArg0108, out s0_264, out s1_265, out s2_266, out s3_267, out s4_105), 0x18, s4_105, s2, dwArg0108, out s0_268, out s1_269, out s2_122, out s3_123, out s4_270);
	ui32 a5_129 = (word32) SLICE(s0, byte, 16);
	if (a5_129 == 0x01)
	{
		a1_156 = 0x18;
		if ((word32) bLoc11_220 == 0x00)
			goto l2302AD42;
	}
	else if ((a5_129 | (word32) bLoc11_220) == 0x00)
	{
		word32 s1_274;
		word32 s4_275;
		word32 s0_273;
		ra_144 = pka_point_addition.constprop.3(ra_119, 0x15, 0x18, 0x1B, dwArg34, dwArgD8, dwArg0108, out s0_273, out s1_274, out s2_147, out s4_275);
l2302AD5C:
		struct Eq_133171 * s0_199;
		struct Eq_133172 * s1_200;
		word32 s2_276;
		Eq_2 ra_198 = pka_read_result.constprop.4(ra_144, s2_147, 0x1B, dwArgF8, dwArg0108, out s0_199, out s1_200, out s2_276);
		s0Out = s0_199;
		s1Out = s1_200;
		return ra_198;
	}
	a1_156 = 0x02;
l2302AD42:
	word32 s1_271;
	word32 s4_272;
	ra_144 = pka_cp_x2_to_x1.constprop.5(ra_119, 0x1B, a1_156, s2_122, s3_123, dwLoc10, dwArg64, dwArg74, out s1_271, out s2_147, out s4_272);
	goto l2302AD5C;
}

// 2302AD70: void ecc_multiplication_event_handler(Register Eq_2 ra, Register Eq_2 s0, Register word32 s2, Register word32 s3, Register word32 s4, Stack Eq_2 dwArg04, Stack word32 dwArg48, Stack word32 dwArg68, Stack word32 dwArg78, Stack word32 dwArg88, Stack word32 dwArg98)
void ecc_multiplication_event_handler(Eq_2 ra, Eq_2 s0, word32 s2, word32 s3, word32 s4, Eq_2 dwArg04, word32 dwArg48, word32 dwArg68, word32 dwArg78, word32 dwArg88, word32 dwArg98)
{
	struct Eq_133314 * sp_274 = fp + -144;
	Eq_2 s1_17 = 0x42026000;
	word32 a0_27;
	struct Eq_133321 * a5_30;
	word32 mstatus_1062;
	word32 a1_1063;
	word32 s8_1064;
	word32 a0_1061;
	Eq_2 s0_32;
	Eq_2 ra_31 = ble_co_list_pop_front(ble_ke_event_clear(ra, s0, 0x00, out a0_1061, out mstatus_1062), s0, 0x4202626C, out s0_32, out a0_27, out a1_1063, out a5_30, out s8_1064);
	if (a0_27 == 0x00)
	{
l2302AEE6:
		if (*((word32) s1_17 + 620) != 0x00)
		{
			word32 a4_1076;
			word32 a5_1077;
			word32 mstatus_1078;
			word32 t1_1070;
			word32 a2_1074;
			word32 a3_1075;
			word32 s0_1071;
			word32 a0_1072;
			word32 a1_1073;
			ble_ke_event_set(ra_31, s0_32, 0x00, sp_274->t0010, out t1_1070, out s0_1071, out a0_1072, out a1_1073, out a2_1074, out a3_1075, out a4_1076, out a5_1077, out mstatus_1078);
		}
		return;
	}
	Eq_2 a0_35 = a5_30->t0004;
	s0_32 = a0_35;
	if (a5_30 == null)
	{
		int32 a1_37 = (word32) *((word32) a0_35 + 0x0122);
		if (a1_37 != 0x00FF)
		{
			word32 a0_42;
			word32 s0_52;
			word32 s1_53;
			word32 s3_55;
			word32 s1_72;
			word32 s2_73;
			word32 s3_74;
			word32 s1_89;
			word32 s2_90;
			word32 s4_92;
			struct Eq_133643 * sp_101;
			ui32 s1_103;
			Eq_2 ra_104;
			ui32 s2_106;
			ui32 s3_107;
			g_ptr4200F3D4();
			sp_101->dw009C = 0x02;
			sec_eng_pka0_pld(0x08, &sp_101->dw0008 + 6, 0x0D, 0x03, 57, 0x00);
			ui32 s2_155;
			ui32 s3_156;
			Eq_2 ra_152 = sec_eng_pka0_lsub(ra_104, s1_103, 0x00, 0x03, 0x0D, 0x03, 0x00, 0x03, s2_106, s3_107, sp_101->t0084, out s2_155, out s3_156);
			sp_101->t0000.u1 = 0x00;
			word32 s0_178;
			word32 s1_179;
			word32 s2_180;
			word32 s3_181;
			word32 ra_177 = sec_eng_pka0_mexp(ra_152, 0x01, 0x03, 0x0E, 0x03, 0x04, 0x03, 0x03, s2_155, s3_156, sp_101->t0000, sp_101->dw0008, sp_101->t0084, sp_101->dw0128, out s0_178, out s1_179, out s2_180, out s3_181);
			sec_eng_pka0_wait_4_isr();
			sec_eng_pka0_clear_int();
			word32 s1_201;
			word32 s2_202;
			word32 s3_203;
			word32 s1_218;
			word32 s2_219;
			word32 s3_220;
			word32 s1_235;
			word32 s2_236;
			struct Eq_133758 * s3_237;
			word32 s4_238;
			struct Eq_133760 * sp_246;
			word32 s1_248;
			word32 ra_249;
			word32 s0_250;
			word32 s2_251;
			struct Eq_133765 * s3_252;
			word32 s4_253;
			s3_237->ptr03D4();
			<anonymous> * a5_268 = s3_252->ptr03D4;
			sp_246->dw0020 = 0x00;
			sp_246->dw00A0 = 0x00;
			Eq_2 ra_277;
			word32 a7_291;
			word32 s6_935;
			word32 s5_934;
			a5_268();
			sp_274->dw0034 = 0x00;
			sp_274->dw00B4 = 0x00;
			word32 a6_326;
			word32 tp_341;
			word32 s2_1101;
			word32 s5_1104;
			word32 s3_1102;
			word32 s4_1103;
			word32 a6_1100;
			word32 a4_1099;
			word32 tp_1096;
			word32 s0_1097;
			word32 s1_1098;
			word32 s6_1105;
			word32 s8_1106;
			word32 a4_1107;
			word32 s6_1108;
			word32 s8_1109;
			Eq_2 s0_332;
			Eq_2 s1_333;
			Eq_2 s2_334;
			Eq_2 s3_335;
			Eq_2 s4_336;
			Eq_2 s5_337;
			Eq_2 ra_331 = sec_eng_pka0_read_data(sec_eng_pka0_read_data(ra_277, 0x03, 0x02, (char *) &sp_274->t0010 + 16, 0x08, sp_274->dw0128, out tp_1096, out s0_1097, out s1_1098, out a4_1099, out a6_1100, out s2_1101, out s3_1102, out s4_1103, out s5_1104, out s6_1105, out s8_1106), 0x03, 0x03, &sp_274->dw0034 + 5, 0x08, sp_274->dw0128, out tp_341, out s0_332, out s1_333, out a4_1107, out a6_326, out s2_334, out s3_335, out s4_336, out s5_337, out s6_1108, out s8_1109);
			if ((word32) *((word32) s0_332 + 300) == s4_336)
			{
				word32 tp_1123;
				word32 a0_1124;
				word32 a1_1125;
				word32 a2_1126;
				word32 a3_1127;
				word32 a4_1128;
				word32 a5_1129;
				word32 a6_1130;
				word32 s8_1131;
				word32 mstatus_1132;
				ra_331 = ble_ke_free(ra_331, s0_332, s1_333, *((word32) s0_332 + 304), s2_334, s3_335, s4_336, s5_337, out tp_1123, out s0_332, out s1_333, out a0_1124, out a1_1125, out a2_1126, out a3_1127, out a4_1128, out a5_1129, out a6_1130, out s2_334, out s3_335, out s4_336, out s5_337, out s8_1131, out mstatus_1132);
				((word32) s0_332 + 304)->u0 = 0x00;
			}
			Eq_2 s0_380;
			Eq_2 s1_381;
			Eq_2 s2_382;
			word32 tp_1110;
			word32 a0_1111;
			word32 a1_1112;
			word32 a2_1113;
			word32 a3_1114;
			word32 a4_1115;
			word32 a5_1116;
			word32 a6_1117;
			word32 s3_1118;
			word32 s4_1119;
			word32 s5_1120;
			word32 s8_1121;
			word32 mstatus_1122;
			Eq_2 ra_379 = ble_ke_free(ra_331, s0_332, s1_333, s0_332, s2_334, s3_335, s4_336, s5_337, out tp_1110, out s0_380, out s1_381, out a0_1111, out a1_1112, out a2_1113, out a3_1114, out a4_1115, out a5_1116, out a6_1117, out s2_382, out s3_1118, out s4_1119, out s5_1120, out s8_1121, out mstatus_1122);
			struct Eq_133924 * a5_390 = (char *) &sp_274->t0010 + 16 + 3;
			Eq_2 a4_391 = (word32) s2_382 + 28;
			while (true)
			{
				*((word32) a4_391 + 3) = (byte) (word32) a5_390->b0000;
				++a5_390;
				*((word32) a4_391 + 2) = (byte) (word32) a5_390->wFFFFFFFE;
				*((word32) a4_391 + 1) = (byte) (a5_390->tFFFFFFFC >> 8);
				*a4_391 = a5_390->tFFFFFFFC;
				Eq_2 a3_405 = (word32) a4_391 - 4;
				if (s2_382 == a4_391)
					break;
				a4_391 = a3_405;
			}
			struct Eq_134064 * a5_409 = (char *) (&sp_274->dw0034 + 5) + 3;
			struct Eq_134069 * a4_410 = (word32) s2_382 + 60;
			do
			{
				a4_410 = (struct Eq_134069 *) ((char *) a4_410 - 4);
				a4_410->b0007 = (byte) (word32) a5_409->b0000;
				++a5_409;
				a4_410->b0006 = (byte) (word32) a5_409->wFFFFFFFE;
				a4_410->b0005 = (byte) (a5_409->tFFFFFFFC >> 8);
				a4_410[1] = (struct Eq_134069) a5_409->tFFFFFFFC;
			} while (a4_410 != (word32) s2_382 + 28);
			word32 tp_1134;
			word32 t1_1135;
			word32 a0_1136;
			word32 a2_1137;
			word32 a3_1138;
			word32 a4_1139;
			word32 a5_1140;
			word32 mstatus_1141;
			ra_31 = ble_ke_msg_send(ra_379, s0_380, s1_381, s2_382, sp_274->t0010, out tp_1134, out t1_1135, out s0_32, out s1_17, out a0_1136, out a2_1137, out a3_1138, out a4_1139, out a5_1140, out mstatus_1141);
		}
		goto l2302AEE6;
	}
	Eq_133367 a5_489;
	word32 s2_448 = (word32) *((word32) a0_35 + 300);
	Eq_133367 a4_450 = *((word32) a0_35 + 296);
	if ((s2_448 + -1 & 0x00FF) <= 0x01)
	{
		Eq_2 a1_670;
		if (s2_448 != 0x01)
			a1_670 = *((word32) a0_35 + 304);
		else
			a1_670.u0 = 0x230B5040;
		ui32 a5_717 = (((((word32) a0_35 + ((63 - a4_450 >> 5) + 60 << 2) + 8 >> (a4_450 & 31) & 0x01) << 1) + (((word32) a0_35 + ((0x007F - a4_450 >> 5) + 60 << 2)) + 8 >> (a4_450 & 31) & 0x01) << 1) + (((word32) a0_35 + ((191 - a4_450 >> 5) + 60 << 2)) + 8 >> (a4_450 & 31) & 0x01) << 1) + (((word32) a0_35 + ((0x00FF - a4_450 >> 5) + 60 << 2)) + 8 >> (a4_450 & 31) & 0x01);
		if (a5_717 != 0x00)
		{
			Eq_2 s2_726 = (byte) a1_670.u0 + a5_717;
			sec_eng_pka0_pld(0x08, s2_726, 0x15, 0x03, 57, 0x00);
			sec_eng_pka0_pld(0x08, (word32) s2_726 + 40, 22, 0x03, 57, 0x00);
			sec_eng_pka0_pld(0x08, (word32) s2_726 + 80, 0x17, 0x03, 57, 0x00);
			word32 s4_776;
			ui32 s2_793;
			ui32 s3_794;
			word32 s1_1066;
			word32 s2_1067;
			word32 s3_1068;
			word32 s0_1065;
			ra_31 = pka_point_inf_check.constprop.7(pka_point_inf_check.constprop.7(ra_31, 0x02, s4, dwLoc88, dwArg98, out s0_1065, out s1_1066, out s2_1067, out s3_1068, out s4_776), 0x15, s4_776, dwLoc88, dwArg98, out s0_32, out s1_17, out s2_793, out s3_794, out s4);
			ui32 a5_800 = (word32) bLoc71;
			if (a5_800 == 0x01)
			{
				if ((word32) bLoc70 == 0x00)
				{
					word32 s2_1069;
					ra_31 = pka_cp_x2_to_x1.constprop.5(ra_31, 0x02, 0x15, s2_793, s3_794, dwLoc80, dwLoc0C, dwArg04, out s1_17, out s2_1069, out s4);
				}
			}
			else if ((a5_800 | (word32) bLoc70) == 0x00)
			{
				word32 s2_1079;
				ra_31 = pka_point_addition.constprop.3(ra_31, 0x02, 0x15, 0x02, dwLoc3C, dwArg68, dwArg98, out s0_32, out s1_17, out s2_1079, out s4);
			}
		}
		if (*((word32) s0_32 + 296) == 0x00)
		{
			*((word32) s0_32 + 4) = 0x00;
			goto l2302AEDC;
		}
		ra_31 = pka_point_double.constprop.2(ra_31, 0x02, s4, dwLoc3C, dwArg68, dwArg98, out s0_32, out s1_17);
		a5_489 = (word32) *((word32) s0_32 + 296) - 1;
l2302AEB4:
		*((word32) s0_32 + 296) = a5_489;
		goto l2302AEDC;
	}
	if (s2_448 == 0x03)
	{
		Eq_132314 a0_642;
		ra_31 = pka_point_double.constprop.2(ra_31, 0x05, s4, dwLoc3C, dwArg68, dwArg98, out s0_32, out s1_17);
		Eq_133367 a5_610 = *((word32) s0_32 + 296);
		*((word32) s0_32 + 296) = (word32) a5_610.u0 + 1;
		if (a5_610 == ~0x3E)
			a0_642 = (word32) *((word32) s0_32 + 304) + 0x0078;
		else
		{
			if (a5_610 != ~0x7E)
			{
				if (a5_610 == ~0xBE)
				{
					Eq_133367 s2_629;
					ra_31 = pka_read_result.constprop.4(ra_31, (word32) *((word32) s0_32 + 304) + 840, 0x05, dwArg88, dwArg98, out s0_32, out s1_17, out s2_629);
					((word32) s0_32 + 300)->u0 = 0x04;
					*((word32) s0_32 + 296) = s2_629;
				}
				goto l2302AEDC;
			}
			a0_642 = (word32) *((word32) s0_32 + 304) + 360;
		}
		word32 s2_1133;
		ra_31 = pka_read_result.constprop.4(ra_31, a0_642, 0x05, dwArg88, dwArg98, out s0_32, out s1_17, out s2_1133);
	}
	else
	{
		if (s2_448 != 0x04)
			goto l2302AEDC;
		if (a4_450 == 0x03)
		{
			Eq_2 a0_566 = *((word32) a0_35 + 304);
			ra_31 = pka_addition_win.constprop.1(ra_31, a0_35, a0_566, (word32) a0_566 + 0x0078, s2_448, s4, dwLoc5C, dwLoc2C, dwLoc1C, dwArg48, dwArg68, dwArg78, out s0_32, out s1_17);
			a5_489.u0 = 0x05;
			goto l2302AEB4;
		}
		if (a4_450 == 0x05)
		{
			Eq_2 a0_542 = *((word32) a0_35 + 304);
			ra_31 = pka_addition_win.constprop.1(ra_31, a0_35, a0_542, (word32) a0_542 + 360, s2_448, s4, dwLoc5C, dwLoc2C, dwLoc1C, dwArg48, dwArg68, dwArg78, out s0_32, out s1_17);
			a5_489.u0 = 0x06;
			goto l2302AEB4;
		}
		if (a4_450 == 0x06)
		{
			Eq_2 a0_517 = *((word32) a0_35 + 304);
			ra_31 = pka_addition_win.constprop.1(ra_31, a0_35, (word32) a0_517 + 0x0078, (word32) a0_517 + 360, s2_448, s4, dwLoc5C, dwLoc2C, dwLoc1C, dwArg48, dwArg68, dwArg78, out s0_32, out s1_17);
			a5_489.u0 = 0x07;
			goto l2302AEB4;
		}
		if (a4_450 == 0x07)
		{
			Eq_2 a0_493 = *((word32) a0_35 + 304);
			ra_31 = pka_addition_win.constprop.1(ra_31, a0_35, a0_493, (word32) a0_493 + 600, s2_448, s4, dwLoc5C, dwLoc2C, dwLoc1C, dwArg48, dwArg68, dwArg78, out s0_32, out s1_17);
			a5_489.u0 = 0x09;
			goto l2302AEB4;
		}
		if (a4_450 <= ~0x0E)
		{
			Eq_2 a0_461 = *((word32) a0_35 + 304);
			ra_31 = pka_addition_win.constprop.1(ra_31, a0_35, (word32) a0_461 + 840, (word32) a0_461 + ((word32) a4_450 - 960), s2_448, s4, dwLoc5C, dwLoc2C, dwLoc1C, dwArg48, dwArg68, dwArg78, out s0_32, out s1_17);
			Eq_133367 a5_487 = *((word32) s0_32 + 296);
			if (a5_487 == 0x0F)
			{
				((word32) s0_32 + 300)->u0 = 0x02;
				a5_489.u0 = 63;
			}
			else
				a5_489 = (word32) a5_487.u0 + 1;
			goto l2302AEB4;
		}
	}
l2302AEDC:
	word32 a0_1080;
	word32 a5_1081;
	ra_31 = ble_co_list_push_back(ra_31, s0_32, s1_17, (word32) s1_17 + 620, s0_32, out s1_17, out a0_1080, out a5_1081);
	goto l2302AEE6;
}

// 2302B176: Register Eq_2 ecc_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out ptr32 s0Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      rwip_init
Eq_2 ecc_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 & s0Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_10 = 0x42026000;
	if (a0 != 0x00)
	{
		while (*((word32) s0_10 + 620) != 0x00)
		{
			Eq_2 a0_15;
			Eq_2 s0_20;
			word32 a1_111;
			word32 a5_112;
			word32 s8_113;
			word32 tp_114;
			word32 a0_115;
			word32 a1_116;
			word32 a2_117;
			word32 a3_118;
			word32 a4_119;
			word32 a5_120;
			word32 a6_121;
			word32 s8_122;
			ra = ble_ke_free(ble_co_list_pop_front(ra, s0_10, (word32) s0_10 + 620, out s0_20, out a0_15, out a1_111, out a5_112, out s8_113), s0_20, s1, a0_15, s2, s3, s4, s5, out tp_114, out s0_10, out s1, out a0_115, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120, out a6_121, out s2, out s3, out s4, out s5, out s8_122, out mstatus);
		}
	}
	word32 a0_107;
	word32 a1_108;
	Eq_2 ra_53 = ble_co_list_init(ra, s0_10, (word32) s0_10 + 620, out a0_107, out a1_108);
	ptr32 s0_70;
	word32 s1_109;
	word32 s4_110;
	Eq_2 ra_69 = ble_ke_event_callback_set(ra_53, s0, s1, 0x00, 0x2302AD70, out s0_70, out s1_109, out s4_110);
	s0Out = s0_70;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra_69;
}

