pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302B1B0: Register word32 ecc_generate_key256(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register ptr32 a3, Register word32 a4, Register Eq_2 a5, Register word32 s7, Register word32 s9, Register word32 s10)
// Called from:
//      ecc_gen_new_public_key
//      hci_le_generate_dhkey_cmd_handler
word32 ecc_generate_key256(Eq_2 ra, word32 a0, Eq_2 a1, ptr32 a3, word32 a4, Eq_2 a5, word32 s7, word32 s9, word32 s10)
{
	sec_eng_pka0_reset();
	int32 * a7_103 = fp + -328;
	int32 * a6_137 = fp + -0x00F8 + 40;
	Eq_2 a4_100 = (word32) a1 + 28;
	struct Eq_134299 * a2_49 = (word32) dwLocFC + 28;
	struct Eq_134303 * a3_50 = a3 + 0x1C;
	struct Eq_134306 * t1_51 = fp + -0x00F8;
	struct Eq_134308 * t3_52 = fp + -328;
	while (true)
	{
		++t3_52;
		t3_52[0x03FF] = (struct Eq_134308) (((word32) *((word32) a4_100 + 3) << 24) + ((word32) (*((word32) a4_100 + 2)) << 16) + (word32) (*a4_100) + ((word32) (*((word32) a4_100 + 1)) << 8));
		a2_49 = (struct Eq_134299 *) ((char *) a2_49 - 4);
		++t1_51;
		t1_51[0x03FF] = (struct Eq_134306) (((word32) a2_49->b0007 << 24) + ((word32) a2_49->b0006 << 16) + (word32) a2_49[1] + ((word32) a2_49->b0005 << 8));
		a3_50 = (struct Eq_134303 *) ((char *) a3_50 - 4);
		t1_51[9] = (struct Eq_134306) (((word32) a3_50->b0007 << 24) + ((word32) a3_50->b0006 << 16) + (word32) a3_50[1] + ((word32) a3_50->b0005 << 8));
		Eq_2 a5_98 = (word32) a4_100 - 4;
		if (a1 == a4_100)
			break;
		a4_100 = a5_98;
	}
	word32 a5_101 = 0x00;
	while (*a7_103 == 0x00)
	{
		++a5_101;
		++a7_103;
		if (a5_101 == 0x08)
			break;
	}
	word32 a5_121 = 0x00;
	while (a2_49 == null)
	{
		++a5_121;
		if (a5_121 == 0x08)
			break;
	}
	word32 a5_136 = 0x00;
	while (*a6_137 == 0x00)
	{
		++a5_136;
		++a6_137;
		if (a5_136 == 0x08)
			break;
	}
	struct Eq_134440 * a0_175;
	word32 s1_186;
	Eq_2 s4_187;
	word32 s0_1291;
	word32 a3_1292;
	word32 a4_1293;
	word32 a5_1294;
	word32 a6_1295;
	word32 s8_1296;
	word32 mstatus_1297;
	Eq_2 ra_184 = ble_ke_malloc(ra, a1, a5, 308, 0x00, out s0_1291, out s1_186, out a0_175, out a3_1292, out a4_1293, out a5_1294, out a6_1295, out s4_187, out s8_1296, out mstatus_1297);
	a0_175->b012C = (byte) a0;
	a0_175->w0120 = (word16) a4;
	a0_175->w0122 = (word16) s1_186;
	word32 s2_221;
	word32 s3_222;
	Eq_2 s4_223;
	word32 a3_235;
	word32 a4_236;
	word32 s4_244;
	word32 s5_245;
	word32 s6_246;
	word32 s8_247;
	word32 a4_1299;
	word32 s5_1300;
	word32 s6_1301;
	word32 s8_1302;
	word32 s2_1303;
	word32 s3_1304;
	word32 a3_1298;
	Eq_2 ra_240 = GF2Mont.constprop.8(GF2Mont.constprop.8(ra_184, s4_187, s4_187, a0, a4, s4_187, dwLocFC, dwLoc48, out a3_1298, out a4_1299, out s2_221, out s3_222, out s4_223, out s5_1300, out s6_1301, out s8_1302), fp + -0x00D0, fp + -0x00D0, s2_221, s3_222, s4_223, dwLocFC, dwLoc48, out a3_235, out a4_236, out s2_1303, out s3_1304, out s4_244, out s5_245, out s6_246, out s8_247);
	<anonymous> * a5_252 = g_ptr4200F3D4;
	word32 sp_281;
	struct Eq_134523 * s1_282;
	word32 s2_283;
	word32 s3_284;
	word32 s4_285;
	word32 s5_286;
	word32 a3_289;
	word32 a4_290;
	word32 ra_291;
	word32 s0_292;
	word32 s6_293;
	word32 s7_294;
	word32 s8_295;
	word32 s10_297;
	a5_252();
	<anonymous> * a5_309 = s1_282->ptr03D0;
	word32 sp_314;
	struct Eq_134541 * s1_315;
	word32 s2_316;
	word32 s3_317;
	word32 s4_318;
	word32 s5_319;
	word32 a3_322;
	word32 a4_323;
	word32 ra_324;
	word32 s0_325;
	word32 s6_326;
	word32 s7_327;
	word32 s8_328;
	word32 s9_329;
	word32 s10_330;
	a5_309();
	<anonymous> * a5_342 = s1_315->ptr03D0;
	struct Eq_134559 * sp_346;
	struct Eq_134560 * s1_347;
	word32 s2_348;
	word32 s3_349;
	word32 s5_351;
	word32 a3_354;
	word32 ra_356;
	word32 s0_357;
	word32 s6_358;
	word32 s9_361;
	word32 s10_362;
	word32 a5_364;
	a5_342();
	sp_346->dw006C = a5_364;
	word32 a4_378 = sp_346->dw00E4;
	sp_346->dw00EC = a5_364;
	<anonymous> * a5_382 = s1_347->ptr03D0;
	struct Eq_134585 * sp_385;
	struct Eq_134586 * s1_386;
	word32 s3_388;
	word32 s4_389;
	word32 s5_390;
	word32 a3_393;
	word32 a4_394;
	word32 ra_395;
	word32 s0_396;
	word32 s7_398;
	word32 s8_399;
	word32 s9_400;
	word32 a5_403;
	a5_382();
	word32 s2_413 = sp_385->dw01F4;
	sp_385->dw0100 = a5_403;
	word32 s6_417 = sp_385->dw01F4;
	sp_385->dw0104 = a5_403;
	<anonymous> * a5_421 = s1_386->ptr03D0;
	struct Eq_134616 * sp_422;
	struct Eq_134617 * s1_423;
	word32 s2_424;
	word32 s3_425;
	word32 s4_426;
	word32 s5_427;
	word32 a3_430;
	word32 a4_431;
	word32 s0_433;
	word32 s6_434;
	word32 s7_435;
	word32 s8_436;
	word32 s9_437;
	word32 s10_438;
	word32 a5_440;
	a5_421();
	word32 ra_450 = sp_422->dw01F4;
	sp_422->dw0128 = a5_440;
	word32 t0_454 = sp_422->dw01F4;
	sp_422->dw012C = a5_440;
	<anonymous> * a5_457 = s1_423->ptr03D0;
	struct Eq_134649 * sp_458;
	struct Eq_134650 * s1_459;
	word32 s2_460;
	word32 s3_461;
	word32 s4_462;
	word32 s5_463;
	word32 a3_466;
	word32 a4_467;
	word32 ra_468;
	struct Eq_134658 * s0_469;
	word32 s6_470;
	word32 s7_471;
	word32 s8_472;
	word32 s9_473;
	word32 s10_474;
	word32 a5_476;
	a5_457();
	word32 s11_486 = sp_458->dw00E4;
	s0_469->dw00A0 = a5_476;
	word32 t6_490 = sp_458->dw00E4;
	s0_469->dw00A4 = a5_476;
	<anonymous> * a5_493 = s1_459->ptr03D0;
	struct Eq_134683 * sp_494;
	struct Eq_134684 * s1_495;
	word32 s2_496;
	word32 s3_497;
	word32 s4_498;
	word32 s5_499;
	word32 a3_502;
	word32 a4_503;
	word32 ra_504;
	struct Eq_134692 * s0_505;
	word32 s6_506;
	word32 s7_507;
	word32 s8_508;
	word32 s9_509;
	word32 s10_510;
	a5_493();
	s0_505->dw00C8 = sp_494->dw0100;
	s0_505->dw00CC = sp_494->dw0104;
	<anonymous> * a5_529 = s1_495->ptr03D0;
	struct Eq_134714 * sp_530;
	struct Eq_134715 * s1_531;
	word32 s2_532;
	word32 s3_533;
	word32 s4_534;
	word32 s5_535;
	word32 a3_538;
	word32 a4_539;
	word32 ra_540;
	struct Eq_134723 * s0_541;
	word32 s6_542;
	word32 s7_543;
	word32 s8_544;
	word32 s9_545;
	word32 s10_546;
	a5_529();
	s0_541->dw00F0 = sp_530->dw0128;
	s0_541->dw00F4 = sp_530->dw012C;
	<anonymous> * a5_566 = s1_531->ptr03D0;
	struct Eq_134745 * sp_567;
	word32 s1_568;
	struct Eq_134747 * s2_569;
	word32 s3_570;
	word32 s4_571;
	word32 s5_572;
	word32 a3_575;
	word32 a4_576;
	word32 ra_577;
	struct Eq_134754 * s0_578;
	word32 s6_579;
	word32 s7_580;
	word32 s9_582;
	word32 s10_583;
	word32 a5_585;
	a5_566();
	word32 s8_595 = sp_567->dw01F4;
	s0_578->dw0118 = a5_585;
	word32 t3_599 = sp_567->dw01F4;
	s0_578->dw011C = a5_585;
	<anonymous> * a5_602 = s2_569->ptr03D4;
	sp_567->dw0030 = s3_570;
	sp_567->dw00B0 = 0x00;
	struct Eq_134785 * sp_605;
	struct Eq_134786 * s1_606;
	word32 s2_607;
	word32 s3_608;
	word32 s4_609;
	word32 s5_610;
	word32 a3_613;
	word32 a4_614;
	word32 ra_615;
	word32 s0_616;
	word32 s6_617;
	word32 s7_618;
	word32 s8_619;
	word32 s9_620;
	word32 s10_621;
	a5_602();
	<anonymous> * a5_633 = s1_606->ptr03D0;
	sp_605->dw00AC = 0x00;
	struct Eq_134808 * sp_638;
	struct Eq_134809 * s1_639;
	word32 s2_640;
	word32 s3_641;
	word32 s4_642;
	word32 s5_643;
	word32 a3_646;
	word32 a4_647;
	word32 s0_649;
	word32 s6_650;
	word32 s7_651;
	word32 s8_652;
	word32 s9_653;
	word32 s10_654;
	struct Eq_134822 * a5_656;
	a5_633();
	word32 ra_666 = sp_638->dw01F4;
	a5_656->dw0028 = s0_649;
	word32 t0_670 = sp_638->dw01F4;
	a5_656->dw002C = s0_649;
	<anonymous> * a5_674 = s1_639->ptr03D0;
	word32 sp_675;
	struct Eq_134842 * s1_676;
	word32 s2_677;
	word32 s3_678;
	word32 s4_679;
	word32 s5_680;
	word32 a3_683;
	word32 a4_684;
	word32 ra_685;
	word32 s0_686;
	word32 s6_687;
	word32 s7_688;
	word32 s8_689;
	word32 s9_690;
	word32 s10_691;
	a5_674();
	<anonymous> * a5_703 = s1_676->ptr03D0;
	struct Eq_134860 * sp_707;
	word32 s1_708;
	struct Eq_134862 * s2_709;
	word32 s3_710;
	word32 s4_711;
	word32 s5_712;
	word32 a3_715;
	word32 a4_716;
	word32 s0_718;
	word32 s6_719;
	word32 s7_720;
	word32 s8_721;
	word32 s9_722;
	word32 s10_723;
	struct Eq_134874 * a5_725;
	a5_703();
	word32 ra_735 = sp_707->dw01F4;
	a5_725->dw0050 = s0_718;
	word32 t0_739 = sp_707->dw01F4;
	a5_725->dw0054 = s0_718;
	<anonymous> * a5_742 = s2_709->ptr03D4;
	struct Eq_134893 * sp_743;
	struct Eq_134894 * s1_744;
	word32 s2_745;
	word32 s3_746;
	word32 s4_747;
	word32 s5_748;
	word32 a3_751;
	word32 a4_752;
	word32 ra_753;
	word32 s0_754;
	word32 s6_755;
	word32 s7_756;
	word32 s8_757;
	word32 s9_758;
	word32 s10_759;
	a5_742();
	<anonymous> * a5_771 = s1_744->ptr03D0;
	sp_743->dw00AC = 0x00;
	struct Eq_134916 * sp_776;
	word32 s1_777;
	struct Eq_134918 * s2_778;
	word32 s3_779;
	word32 s4_780;
	word32 s5_781;
	word32 a3_784;
	word32 a4_785;
	word32 s0_787;
	word32 s6_788;
	word32 s7_789;
	word32 s8_790;
	word32 s9_791;
	word32 s10_792;
	struct Eq_134930 * a5_794;
	a5_771();
	word32 ra_804 = sp_776->dw01F4;
	a5_794->dw0078 = s0_787;
	word32 t0_808 = sp_776->dw01F4;
	a5_794->dw007C = s0_787;
	<anonymous> * a5_811 = s2_778->ptr03D4;
	Eq_2 s4_816;
	Eq_2 s5_817;
	word32 s6_824;
	Eq_2 s7_825;
	Eq_2 s8_826;
	Eq_2 s9_827;
	Eq_2 s10_828;
	Eq_2 s0_1063;
	Eq_2 s1_1064;
	Eq_2 ra_1062;
	a5_811();
	sec_eng_pka0_pld(0x08, 587945864, 0x00, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 587945832, 0x01, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, s10_828, 0x02, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, s9_827, 0x03, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, s5_817, 0x04, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, s8_826, 0x05, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, s7_825, 0x06, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, s4_816, 0x07, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, fp - 288, 0x08, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 587943808, 0x09, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 0x230B4FA0, 0x0A, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 0x230B4FC0, 11, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 0x230B4FE0, 0x0C, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 587943776, 0x13, 0x03, 57, 0x00);
	sec_eng_pka0_pld(0x08, 0x230B4F40, 0x14, 0x03, 57, 0x00);
	word32 a4_1029 = (word32) *((word32) s0_1063 + 300);
	*((word32) s0_1063 + 296) = 63;
	*((word32) s0_1063 + 292) = 0x00;
	*((word32) s0_1063 + 4) = s6_824;
	if (a4_1029 == 0x02)
	{
		Eq_132314 a0_1037;
		struct Eq_135093 * s0_1047;
		word32 a4_1307;
		word32 a5_1308;
		word32 a6_1309;
		word32 s4_1310;
		word32 s8_1311;
		word32 mstatus_1312;
		word32 s1_1305;
		word32 a3_1306;
		Eq_2 ra_1046 = ble_ke_malloc(ra_1062, s0_1063, s1_1064, 1800, 0x00, out s0_1047, out s1_1305, out a0_1037, out a3_1306, out a4_1307, out a5_1308, out a6_1309, out s4_1310, out s8_1311, out mstatus_1312);
		s0_1047->t0130 = a0_1037;
		word32 s2_1313;
		ra_1062 = pka_read_result.constprop.4(ra_1046, a0_1037, 0x05, dwLoc48, dwLoc38, out s0_1063, out s1_1064, out s2_1313);
		((word32) s0_1063 + 300)->u0 = 0x03;
		*((word32) s0_1063 + 296) = 0x00;
	}
	word32 a4_1323;
	word32 a5_1324;
	word32 mstatus_1325;
	word32 a0_1315;
	word32 a5_1316;
	word32 t1_1317;
	word32 s0_1318;
	word32 a0_1319;
	word32 a1_1320;
	word32 a2_1321;
	word32 a3_1322;
	word32 s1_1314;
	ble_ke_event_set(ble_co_list_push_back(ra_1062, s0_1063, s1_1064, 0x4202626C, s0_1063, out s1_1314, out a0_1315, out a5_1316), s0_1063, 0x00, dwLoc0150, out t1_1317, out s0_1318, out a0_1319, out a1_1320, out a2_1321, out a3_1322, out a4_1323, out a5_1324, out mstatus_1325);
	return 0x00;
}

// 2302B648: void ecc_gen_new_public_key(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register word32 s7, Register word32 s9, Register word32 s10)
// Called from:
//      hci_le_rd_local_p256_public_key_cmd_handler
void ecc_gen_new_public_key(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a2, word32 s7, word32 s9, word32 s10)
{
	ecc_generate_key256(ra, 0x01, a0, 0x230B5020, a1, a2, s7, s9, s10);
}

// 2302B664: Register Eq_2 ecc_gen_new_secret_key(Register Eq_2 a0, Register word32 a1, Register (ptr32 Eq_64398) a2, Stack Eq_2 dwArg38, Register out ptr32 s4Out)
// Called from:
//      lld_init
//      hci_le_rd_local_p256_public_key_cmd_handler
Eq_2 ecc_gen_new_secret_key(Eq_2 a0, word32 a1, struct Eq_64398 * a2, Eq_2 dwArg38, ptr32 & s4Out)
{
	if (a1 != 0x00)
	{
		s4Out = s4;
		return s1;
	}
	else
	{
		a0_162 = a0;
		do
		{
l2302B67E:
			Eq_2 a0_162;
			uint32 a0_20;
			struct Eq_64398 * a2_21;
			word32 a5_282;
			word32 s4_283;
			word32 s8_284;
			word32 a1_279;
			word32 a3_280;
			word32 a4_281;
			bl_rand(a0_162, a2, out a0_20, out a1_279, out a2_21, out a3_280, out a4_281, out a5_282, out s4_283, out s8_284);
			*a0 = (byte) a0_20;
			*((word32) a0 + 1) = (byte) (a0_20 >> 0x08);
			*((word32) a0 + 2) = (byte) (a0_20 >> 0x10);
			*((word32) a0 + 3) = (byte) (a0_20 >> 24);
			uint32 a0_39;
			struct Eq_64398 * a2_40;
			word32 s8_290;
			word32 a3_286;
			word32 a4_287;
			word32 a5_288;
			word32 s4_289;
			word32 a1_285;
			bl_rand(a0_20 >> 24, a2_21, out a0_39, out a1_285, out a2_40, out a3_286, out a4_287, out a5_288, out s4_289, out s8_290);
			*((word32) a0 + 4) = (byte) a0_39;
			*((word32) a0 + 5) = (byte) (a0_39 >> 0x08);
			*((word32) a0 + 6) = (byte) (a0_39 >> 0x10);
			*((word32) a0 + 7) = (byte) (a0_39 >> 24);
			uint32 a0_57;
			struct Eq_64398 * a2_58;
			word32 s4_295;
			word32 a5_294;
			word32 a4_293;
			word32 a3_292;
			word32 s8_296;
			word32 a1_291;
			bl_rand(a0_39 >> 24, a2_40, out a0_57, out a1_291, out a2_58, out a3_292, out a4_293, out a5_294, out s4_295, out s8_296);
			*((word32) a0 + 8) = (byte) a0_57;
			*((word32) a0 + 9) = (byte) (a0_57 >> 0x08);
			*((word32) a0 + 0x0A) = (byte) (a0_57 >> 0x10);
			*((word32) a0 + 11) = (byte) (a0_57 >> 24);
			uint32 a0_75;
			struct Eq_64398 * a2_76;
			word32 a3_298;
			word32 a1_297;
			word32 a4_299;
			word32 a5_300;
			word32 s4_301;
			word32 s8_302;
			bl_rand(a0_57 >> 24, a2_58, out a0_75, out a1_297, out a2_76, out a3_298, out a4_299, out a5_300, out s4_301, out s8_302);
			*((word32) a0 + 0x0C) = (byte) a0_75;
			*((word32) a0 + 0x0D) = (byte) (a0_75 >> 0x08);
			*((word32) a0 + 0x0E) = (byte) (a0_75 >> 0x10);
			*((word32) a0 + 0x0F) = (byte) (a0_75 >> 24);
			uint32 a0_93;
			struct Eq_64398 * a2_94;
			word32 a1_303;
			word32 a3_304;
			word32 a4_305;
			word32 a5_306;
			word32 s4_307;
			word32 s8_308;
			bl_rand(a0_75 >> 24, a2_76, out a0_93, out a1_303, out a2_94, out a3_304, out a4_305, out a5_306, out s4_307, out s8_308);
			*((word32) a0 + 16) = (byte) a0_93;
			*((word32) a0 + 0x0011) = (byte) (a0_93 >> 0x08);
			*((word32) a0 + 18) = (byte) (a0_93 >> 0x10);
			*((word32) a0 + 19) = (byte) (a0_93 >> 24);
			uint32 a0_111;
			struct Eq_64398 * a2_112;
			word32 a1_309;
			word32 a3_310;
			word32 a4_311;
			word32 a5_312;
			word32 s4_313;
			word32 s8_314;
			bl_rand(a0_93 >> 24, a2_94, out a0_111, out a1_309, out a2_112, out a3_310, out a4_311, out a5_312, out s4_313, out s8_314);
			*((word32) a0 + 20) = (byte) a0_111;
			*((word32) a0 + 21) = (byte) (a0_111 >> 0x08);
			*((word32) a0 + 22) = (byte) (a0_111 >> 0x10);
			*((word32) a0 + 23) = (byte) (a0_111 >> 24);
			uint32 a0_129;
			struct Eq_64398 * a2_130;
			word32 a1_315;
			word32 a3_316;
			word32 a4_317;
			word32 a5_318;
			word32 s4_319;
			word32 s8_320;
			bl_rand(a0_111 >> 24, a2_112, out a0_129, out a1_315, out a2_130, out a3_316, out a4_317, out a5_318, out s4_319, out s8_320);
			*((word32) a0 + 24) = (byte) a0_129;
			((word32) a0 + 25)->u0 = (byte) (a0_129 >> 0x08);
			*((word32) a0 + 26) = (byte) (a0_129 >> 0x10);
			*((word32) a0 + 27) = (byte) (a0_129 >> 24);
			uint32 a0_147;
			ptr32 s4_155;
			word32 a1_321;
			word32 a3_322;
			word32 a4_323;
			word32 a5_324;
			word32 s8_325;
			Eq_2 s1_152 = bl_rand(a0_129 >> 24, a2_130, out a0_147, out a1_321, out a2, out a3_322, out a4_323, out a5_324, out s4_155, out s8_325);
			*((word32) a0 + 28) = (byte) a0_147;
			*((word32) a0 + 29) = (byte) (a0_147 >> 0x08);
			*((word32) a0 + 30) = (byte) (a0_147 >> 0x10);
			*((word32) a0 + 31) = (byte) (a0_147 >> 24);
			a0_162 = a0_147 >> 24;
			int32 a5_165;
			for (a5_165 = 0x1F; a5_165 != ~0x00; a5_165 += ~0x00)
			{
				if ((word32) *((word32) a0 + a5_165) != 0x00)
					goto l2302B788;
			}
		} while ((word32) *a0 == 0x00);
l2302B788:
		int32 a5_174;
		for (a5_174 = 0x1F; a5_174 != ~0x00; a5_174 += ~0x00)
		{
			up32 a3_179 = (word32) *((word32) a0 + a5_174);
			up32 a4_182 = (word32) *((word32) s1_152 + a5_174);
			if (a4_182 < a3_179)
				goto l2302B67E;
			if (a3_179 < a4_182)
				break;
		}
		0x00 = (int8) dwArg38;
		s4Out = s4_155;
		return s1_152;
	}
}

// 2302B7B6: Register word32 ble_ke_event_init(Register word32 ra, Stack word32 dwArg10)
// Called from:
//      ble_ke_init
word32 ble_ke_event_init(word32 ra, word32 dwArg10)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 ra_12;
	word32 a0_13;
	a5_5();
	if (a0_13 != 0x00)
		return ra_12;
	word32 ra_29;
	g_ptr4200F3D4();
	return ra_29;
}

// 2302B7EA: Register Eq_2 ble_ke_event_callback_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register word32 a1, Register out Eq_134224 s0Out, Register out (ptr32 Eq_134225) s1Out, Register out ptr32 s4Out)
// Called from:
//      ecc_init
//      ble_ke_init
//      lld_evt_init
//      llm_init
//      ble_ke_task_init
Eq_2 ble_ke_event_callback_set(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, word32 a1, union Eq_134224 & s0Out, struct Eq_134225 & s1Out, ptr32 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_134225 * s1_23;
	Eq_2 ra_24;
	word32 a0_25;
	Eq_134224 s0_22;
	a5_5();
	if (a0_25 == 0x00 && s0_22 <= 0x09)
	{
		s1_23->dw0004 = (s0_22 << 2) + 0x42026274;
		s0_22 <<= 2;
	}
	s0Out = s0_22;
	s1Out = s1_23;
	s4Out = dwArg04;
	return ra_24;
}

