pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302B838: Register Eq_2 ble_ke_event_set(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Stack Eq_2 dwArg10, Register out ptr32 t1Out, Register out Eq_2 s0Out, Register out (ptr32 Eq_131267) a0Out, Register out Eq_131268 a1Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      rwip_wakeup_end
//      ecc_multiplication_event_handler
//      ecc_gen_new_public_key
//      ble_ke_timer_set
//      ble_ke_timer_clear
//      lld_evt_delete_elt_push
//      lld_evt_elt_insert
//      lld_evt_canceled
//      lld_evt_timer_isr
//      lld_evt_end_isr
//      lld_evt_rx_isr
//      lld_evt_afs_isr
//      lld_pdu_tx_flush
//      lld_crypt_isr
//      ble_ke_state_set
Eq_2 ble_ke_event_set(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 dwArg10, ptr32 & t1Out, union Eq_2 & s0Out, struct Eq_131267 & a0Out, union Eq_131268 & a1Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	up32 s0_17;
	Eq_2 ra_18;
	ptr32 mstatus_21;
	ptr32 t1_25;
	struct Eq_131267 * a0_19;
	Eq_131268 a1_20;
	ptr32 a3_23;
	Eq_2 a4_22;
	ptr32 a5_16;
	a5_5();
	if (a0_19 == null)
	{
		a4_22 = __csrrs(mstatus_21, 0x00);
		__csrrc(mstatus_21, 0x08);
		a3_23 = 0x09;
		Eq_2 a5_30 = 0x42026274;
		if (s0_17 <= 0x09)
		{
			a1_20 = 0x01 << s0_17;
			a5_30 = *(union Eq_2 *) 0x01;
			*(a1_20 | 0x01) = (union Eq_2 *) a5_30;
			a0_19 = a1_20 | 0x01;
		}
		__csrrw(mstatus_21, 0x00);
		a5_16 = (word32) *((word32) a5_30 + 44);
		if (a5_16 == 0x00)
		{
			ptr32 a5_54;
			Eq_2 s0_55;
			Eq_2 ra_56;
			struct Eq_131267 * a0_57;
			Eq_131268 a1_58;
			ptr32 mstatus_59;
			Eq_2 a4_60;
			ptr32 a3_61;
			Eq_2 a2_62;
			ptr32 t1_63;
			g_ptr4200F3D8();
			t1Out = t1_63;
			s0Out = s0_55;
			a0Out = a0_57;
			a1Out = a1_58;
			a2Out = a2_62;
			a3Out = a3_61;
			a4Out = a4_60;
			a5Out = a5_54;
			mstatusOut = mstatus_59;
			return ra_56;
		}
	}
	t1Out = t1_25;
	s0Out = s0;
	a0Out = a0_19;
	a1Out = a1_20;
	a2Out = dwArg10;
	a3Out = a3_23;
	a4Out = a4_22;
	a5Out = a5_16;
	mstatusOut = mstatus_21;
	return ra_18;
}

// 2302B894: Register Eq_2 ble_ke_event_clear(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register out (ptr32 Eq_133334) a0Out, Register out ptr32 mstatusOut)
// Called from:
//      ecc_multiplication_event_handler
//      ble_ke_timer_schedule
//      lld_evt_deffered_elt_handler
//      lld_evt_delete_elt_handler
//      llm_encryption_done
//      ble_ke_task_schedule
Eq_2 ble_ke_event_clear(Eq_2 ra, Eq_2 s0, word32 a0, struct Eq_133334 & a0Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	up32 s0_17;
	Eq_2 ra_18;
	ptr32 mstatus_21;
	word32 * a3_23;
	struct Eq_133334 * a0_19;
	a5_5();
	if (a0_19 == null)
	{
		__csrrs(mstatus_21, 0x00);
		__csrrc(mstatus_21, 0x08);
		if (s0_17 <= 0x09)
		{
			a0_19 = ~(0x01 << s0_17) & a3_23;
			a0_19->dw0000 = *a3_23;
		}
		__csrrw(mstatus_21, 0x00);
	}
	a0Out = a0_19;
	mstatusOut = mstatus_21;
	return ra_18;
}

// 2302B8DE: Register Eq_2 ble_ke_event_flush(Register Eq_2 ra)
// Called from:
//      ble_ke_flush
Eq_2 ble_ke_event_flush(Eq_2 ra)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_12;
	word32 a0_13;
	a5_5();
	if (a0_13 == 0x00)
		g_dw42026274 = 0x00;
	return ra_12;
}

// 2302B8FE: Register Eq_2 ble_ke_event_schedule(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out (ptr32 Eq_131149) s1Out, Register out Eq_131150 a3Out, Register out (ptr32 Eq_131151) a4Out, Register out (ptr32 Eq_131152) a5Out, Register out Eq_131153 s5Out)
// Called from:
//      rwip_schedule
Eq_2 ble_ke_event_schedule(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, struct Eq_131149 & s1Out, union Eq_131150 & a3Out, struct Eq_131151 & a4Out, struct Eq_131152 & a5Out, union Eq_131153 & s5Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_31;
	Eq_131150 a3_102;
	struct Eq_131151 * a4_103;
	struct Eq_131152 * a5_107;
	Eq_2 ra_133;
	struct Eq_131149 * s1_135;
	Eq_131153 s5_131;
	a5_5();
	if (a0_31 == 0x00)
	{
		s1_135 = (struct Eq_131149 *) &g_dw42026000;
		word32 s2_123 = 0x01;
		uint32 s3_125 = 0x80000000;
		int32 s4_128 = 32;
		s5_131.u0 = 0x1F;
		do
		{
			a4_103 = (struct Eq_131151 *) s1_135[1];
			struct Eq_135714 * s0_106 = s1_135 + 1;
			while (a4_103 != null)
			{
				s0_106->b002C = (byte) s2_123;
				int32 a5_52 = 0x00;
				do
				{
					a3_102 = s3_125 >> a5_52 & a4_103;
					if (a3_102 != 0x00)
						break;
					++a5_52;
				} while (a5_52 != s4_128);
				a5_107 = (&(s0_106 + ((s5_131 - a5_52 & 0x00FF) << 2) / 628)->dw0000)[1];
				if (a5_107 != null)
					a5_107();
				s0_106 = a4_103->dw0000;
			}
			*((word32) a5_107->t0000 + 44) = 0x00;
		} while (a5_107 != null);
	}
	s1Out = s1_135;
	a3Out = a3_102;
	a4Out = a4_103;
	a5Out = a5_107;
	s5Out = s5_131;
	return ra_133;
}

// 2302B97A: Register Eq_2 ble_ke_mem_is_in_heap(Register Eq_2 ra, Register (ptr32 Eq_133897) s0, Register (ptr32 Eq_133893) s1, Register (ptr32 Eq_133902) a0, Register (ptr32 Eq_133897) a1, Register out (ptr32 Eq_135762) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_135766 s4Out)
// Called from:
//      ble_ke_free
Eq_2 ble_ke_mem_is_in_heap(Eq_2 ra, struct Eq_133897 * s0, struct Eq_133893 * s1, struct Eq_133902 * a0, struct Eq_133897 * a1, struct Eq_135762 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_135766 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	ptr32 s1_23;
	Eq_2 ra_24;
	word32 a0_25;
	ptr32 a1_26;
	struct Eq_135762 * s0_22;
	a5_5();
	byte bLoc11_64 = SLICE(s0, byte, 24);
	if (a0_25 == 0x00)
	{
		ptr32 a4_37 = *((char *) &g_ptr420262AC + (&s0_22->wFFFFFFFE + 3) * 0x04);
		bLoc11_64 = 0x00;
		if (s1_23 >= a4_37)
		{
			struct Eq_135790 * s0_40 = &s0_22->wFFFFFFFE + 9 << 1;
			s0_22 = (struct Eq_135762 *) &s0_40->w420262A4;
			if ((word32) s0_40->w420262A4 + a4_37 >= s1_23)
				bLoc11_64 = 0x01;
		}
	}
	s0Out = s0_22;
	s1Out = s1_23;
	a0Out = (word32) bLoc11_64;
	a1Out = a1_26;
	s4Out = dwArg04;
	return ra_24;
}

// 2302B9DA: Register Eq_2 ble_ke_mem_init(Register Eq_2 ra, Register Eq_2 s0, Register word32 s1, Register word32 a0, Register int32 a1, Register word32 a2, Register word32 s2, Stack Eq_2 dwArg38, Register out (ptr32 word16) s1Out, Register out ptr32 s2Out)
// Called from:
//      rwip_init
Eq_2 ble_ke_mem_init(Eq_2 ra, Eq_2 s0, word32 s1, word32 a0, int32 a1, word32 a2, word32 s2, Eq_2 dwArg38, word16 & s1Out, ptr32 & s2Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 s0_27;
	ptr32 s2_29;
	Eq_2 ra_30;
	word32 a0_31;
	ptr32 mstatus_36;
	word16 * s1_28;
	a5_5();
	if (a0_31 == 0x00)
	{
		struct Eq_135815 * a3_43 = s0_27 + 3 & ~0x03;
		a3_43->dw0008 = (s1_28 + 2 << 2) + 0x420262A4;
		__csrrs(mstatus_36, 0x00);
		struct Eq_15 * a1_47 = __csrrc(mstatus_36, 0x08);
		a3_43->w0002 = (word16) ((s0_27 + s2_29 & ~0x03) - a3_43);
		a1_47->w0000 = 0x055A;
		struct Eq_135848 * a5_56 = *(struct Eq_135848 **) 0xFA000562;
		*(word32 *) 0xFA00055E = 0x00;
		a5_56->ptr0008->dw0008 = 0x00;
		struct Eq_135861 * s1_58 = s1_28 + 8 << 1;
		s1_58->w420262A4 = (word16) s2_29;
		__csrrw(mstatus_36, 0x00);
		s1_28 = &s1_58->w420262A4;
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_28;
	s2Out = s2_29;
	return ra_30;
}

// 2302BA5A: Register Eq_2 ble_ke_malloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register int32 a0, Register word32 a1, Register out (ptr32 Eq_129043) s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_129045) a0Out, Register out Eq_129046 a3Out, Register out (ptr32 Eq_129045) a4Out, Register out (ptr32 Eq_129045) a5Out, Register out Eq_2 a6Out, Register out Eq_129050 s4Out, Register out Eq_129051 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      ea_elt_create
//      ea_interval_create
//      ecc_gen_new_public_key
//      ble_ke_msg_alloc
//      ble_ke_timer_set
//      llc_start
//      lld_evt_deferred_elt_push
//      lld_evt_elt_wait_insert
//      lld_evt_delete_elt_push
//      lld_pdu_data_send
//      lld_pdu_rx_handler
//      llm_util_bl_add
//      llm_le_adv_report_ind
//      llm_test_mode_start_tx
//      llm_test_mode_start_rx
//      llm_set_adv_param
//      llm_set_adv_en
//      llm_set_adv_data
//      llm_set_scan_rsp_data
//      llm_set_scan_param
//      llm_set_scan_en
//      llc_llcp_send
Eq_2 ble_ke_malloc(Eq_2 ra, Eq_2 s0, Eq_2 s1, int32 a0, word32 a1, struct Eq_129043 & s0Out, ptr32 & s1Out, struct Eq_129045 & a0Out, union Eq_129046 & a3Out, struct Eq_129045 & a4Out, struct Eq_129045 & a5Out, union Eq_2 & a6Out, union Eq_129050 & s4Out, union Eq_129051 & s8Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_129043 * s0_22;
	ptr32 s1_23;
	Eq_2 ra_24;
	ptr32 mstatus_31;
	Eq_2 a6_201;
	Eq_129046 a3_103;
	struct Eq_129045 * a4_106;
	struct Eq_129045 * a0_101;
	struct Eq_129045 * a5_142;
	a5_5();
	if (a0_101 == null)
	{
		uint32 a0_38 = (char *) s0_22 + 3 & ~0x03;
		a0_101 = a0_38 + 0x04;
		if (a0_38 < ~0x07)
			a0_101 = (struct Eq_129045 *) 0x0C;
		a6_201 = __csrrs(mstatus_31, 0x00);
		__csrrc(mstatus_31, 0x08);
		a3_103.u0 = 0x00;
		do
		{
			struct Eq_129045 * t1_60 = &a0_101->dw0008 + 1;
			a5_142 = null;
			for (; a4_106 != null; a4_106 = a4_106->ptr0004)
			{
				struct Eq_129045 * a1_64 = (word32) a4_106->w0002;
				if (a1_64 >= a0_101 && (a1_64 >= t1_60 || a4_106->dw0008 != 0x00) && (a5_142 == null || a1_64 < (word32) a5_142->w0002))
					a5_142 = a4_106;
			}
			if (a5_142 != null)
			{
				a4_106 = (word32) a5_142->w0002;
				if (a4_106 < &a0_101->dw0008 + 1)
					a0_101 = a4_106;
			}
			if (a3_103 == 0x01)
			{
				if (a5_142 == null)
					goto l2302BB36;
				break;
			}
			a3_103.u0 = 0x01;
		} while (a5_142 == null);
		struct Eq_129045 * a5_108;
		uint32 a3_102 = a0_101 << 0x10;
		a4_106 = (word32) a5_142->w0002;
		a3_103 = a3_102 >> 16;
		if (a4_106 == a0_101)
		{
			g_ptr420262A8 = a4_106;
			a5_108 = a4_106->ptr0004;
			if (a4_106 != null)
			{
				a5_108 = g_ptr420262AC;
				g_ptr420262AC = a4_106;
			}
		}
		else
		{
			a4_106 = (word32) (word16) (a4_106 - (a3_102 >> 16));
			a5_142->w0002 = (word16) a4_106;
			a5_108 = a5_142 + a4_106;
		}
		a5_108->w0002 = (word16) (a3_102 >> 16);
		a4_106->w0000 = 0x0338;
		a5_142 = (struct Eq_129045 *) 0xF800033C;
l2302BB36:
		__csrrw(mstatus_31, 0x00);
	}
	s0Out = s0_22;
	s1Out = s1_23;
	a0Out = a0_101;
	a3Out = a3_103;
	a4Out = a4_106;
	a5Out = a5_142;
	a6Out = a6_201;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	mstatusOut = mstatus_31;
	return ra_24;
}

