pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302BB4A: Register Eq_2 ble_ke_free(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out ptr32 tpOut, Register out Eq_2 s0Out, Register out (ptr32 Eq_133893) s1Out, Register out (ptr32 Eq_133894) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out (ptr32 Eq_133897) a3Out, Register out (ptr32 Eq_133897) a4Out, Register out (ptr32 Eq_133897) a5Out, Register out ptr32 a6Out, Register out (ptr32 Eq_133901) s2Out, Register out (ptr32 Eq_133902) s3Out, Register out (ptr32 Eq_133903) s4Out, Register out Eq_2 s5Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      ecc_multiplication_event_handler
//      ecc_init
//      ble_ke_timer_schedule
//      ble_ke_timer_clear
//      ble_ke_flush
//      llc_stop
//      lld_evt_deferred_elt_pop
//      lld_evt_schedule
//      lld_evt_init
//      lld_evt_elt_delete
//      lld_evt_delete_elt_handler
//      lld_evt_canceled
//      lld_evt_schedule_next
//      lld_pdu_tx_flush_list
//      lld_pdu_check
//      lld_pdu_tx_prog
//      lld_pdu_tx_flush
//      lld_util_flush_list
//      lld_con_start
//      llm_init
Eq_2 ble_ke_free(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 & tpOut, union Eq_2 & s0Out, struct Eq_133893 & s1Out, struct Eq_133894 & a0Out, ptr32 & a1Out, ptr32 & a2Out, struct Eq_133897 & a3Out, struct Eq_133897 & a4Out, struct Eq_133897 & a5Out, ptr32 & a6Out, struct Eq_133901 & s2Out, struct Eq_133902 & s3Out, struct Eq_133903 & s4Out, union Eq_2 & s5Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_133897 * s0_27;
	ptr32 mstatus_36;
	struct Eq_133894 * a0_163;
	struct Eq_133897 * a3_126;
	ptr32 a1_169;
	struct Eq_133897 * a4_106;
	struct Eq_133897 * a5_100;
	Eq_2 ra_190;
	struct Eq_133893 * s1_116;
	struct Eq_133901 * s2_198;
	struct Eq_133902 * s3_202;
	Eq_2 s5_208;
	a5_5();
	if (a0_163 == null)
	{
		s0_27->w0FFC = 0x0F;
		s1_116 = (word32) s0_27->wFFFFFFFE;
		s5_208 = __csrrs(mstatus_36, 0x00);
		__csrrc(mstatus_36, 0x08);
		s2_198 = (struct Eq_133901 *) ((char *) s0_27 - 4);
		s3_202 = null;
		s0_54 = s0_27;
		do
		{
			struct Eq_133897 * s0_54;
			int32 s4_68;
			ra_190 = ble_ke_mem_is_in_heap(ra_190, s0_54, s1_116, s3_202, s0_54, out s0_54, out s1_116, out a0_163, out a1_169, out s4_68);
			if (a0_163 == null)
			{
				if (s3_202 == null)
				{
					s3_202 = (struct Eq_133902 *) 0x01;
					continue;
				}
				else
				{
					a4_106 = null;
					goto l2302BBFA;
				}
			}
			a5_100 = (word32) (&s3_202->w0004 << 2) + s4_68 + 8;
		} while (a5_100 == null);
		a4_106 = null;
		for (; a5_100 != null; a5_100 = a5_100->ptr0004)
		{
			a3_126 = (word32) a5_100->w0002;
			if (a3_126 + a5_100 == s0_27 + -4)
			{
				a5_100 = a4_106->ptr0004;
				s1_116 = CONVERT(SLICE(s1_116 + a3_126, word16, 0), word16, word32);
				a5_100->w0002 = (word16) s1_116;
				a3_126 = s1_116 + a5_100;
				if (a4_106 == a3_126)
				{
					a3_126 = (word32) a4_106->w0002;
					s1_116 += a3_126;
					a5_100->w0002 = (word16) s1_116;
					a4_106 = a4_106->ptr0004;
					a4_106->ptr0004 = a5_100;
					if (a4_106 != null)
						a5_100->ptr0008 = a4_106;
				}
				goto l2302BBDA;
			}
			if ((char *) s0_27 - 4 < a5_100)
			{
				a4_106->ptr0004 = (struct Eq_133897 *) ((char *) s0_27 - 4);
				a4_106->ptr0004 = s0_54;
				s0_54->w0FFC = 0x055A;
				a4_106 = s1_116 + (s0_27 + -4);
				if (a5_100 == a4_106)
				{
					struct Eq_133897 * a5_109 = a4_106->ptr0004;
					a4_106->ptr0000 = s0_54;
					if (a4_106 != null)
						a4_106->ptr0008 = (struct Eq_133897 *) ((char *) s0_27 - 4);
					a5_100 = (word32) a5_109->w0002;
					s1_116 += a5_100;
				}
				else
				{
					a5_100->ptr0000 = s0_54;
					a5_100->ptr0008 = (struct Eq_133897 *) ((char *) s0_27 - 4);
				}
				s0_54->w0FFE = (word16) s1_116;
				goto l2302BBDA;
			}
			a4_106 = a5_100;
		}
l2302BBFA:
		a4_106->ptr0004 = (struct Eq_133897 *) ((char *) s0_27 - 4);
		s0_54->ptr0000 = null;
		a4_106->ptr0004 = s0_54;
		s0_54->w0FFE = (word16) s1_116;
		s0_54->w0FFC = 0x055A;
		a5_100 = (struct Eq_133897 *) 0xFA00055A;
l2302BBDA:
		__csrrw(mstatus_36, 0x00);
	}
	tpOut = dwArg88;
	s0Out = s1;
	s1Out = s1_116;
	a0Out = a0_163;
	a1Out = a1_169;
	a2Out = dwArg48;
	a3Out = a3_126;
	a4Out = a4_106;
	a5Out = a5_100;
	a6Out = dwArg28;
	s2Out = s2_198;
	s3Out = s3_202;
	s4Out = dwArg04;
	s5Out = s5_208;
	s8Out = s4;
	mstatusOut = mstatus_36;
	return ra_190;
}

// 2302BC54: Register Eq_2 ble_ke_is_free(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register out (ptr32 Eq_136175) s0Out, Register out ptr32 a0Out)
// Called from:
//      ble_ke_task_schedule
Eq_2 ble_ke_is_free(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_136175 & s0Out, ptr32 & a0Out)
{
	ptr32 a0_27;
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_136175 * s0_17;
	Eq_2 ra_18;
	word32 a0_19;
	a5_5();
	byte bLoc11_42 = SLICE(s0, byte, 24);
	if (a0_19 != 0x00)
		a0_27 = (word32) bLoc11_42;
	else
		a0_27 = (word32) ((word32) s0_17->wFFFFFFFC != ~0x08000337);
	s0Out = s0_17;
	a0Out = a0_27;
	return ra_18;
}

// 2302BC8C: Register Eq_2 ble_ke_msg_alloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register int32 a3, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out (ptr32 byte) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_136212) a4Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out (ptr32 Eq_136215) s2Out, Register out (ptr32 Eq_136216) s3Out, Register out Eq_136217 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      ecc_multiplication_event_handler
//      ble_ke_msg_send_basic
//      llc_discon_event_complete_send
//      llc_le_con_cmp_evt_send
//      llc_start
//      llc_con_update_complete_send
//      llc_ltk_req_send
//      llc_feats_rd_event_send
//      llc_version_rd_event_send
//      llc_common_cmd_complete_send
//      llc_common_cmd_status_send
//      llc_common_flush_occurred_send
//      llc_common_enc_key_ref_comp_evt_send
//      llc_common_enc_change_evt_send
//      lld_evt_move_to_slave
//      lld_pdu_tx_flush
//      lld_pdu_rx_handler
//      llm_end_evt_defer
//      llm_le_adv_report_ind
//      llm_common_cmd_complete_send
//      llm_common_cmd_status_send
//      llm_encryption_done
//      llcp_enc_rsp_handler
//      llcp_unknown_rsp_handler
//      llcp_length_rsp_handler
//      llcp_con_param_req_handler
//      llcp_length_req_handler
//      llc_auth_payl_real_to_ind_handler
//      llc_task_random_gen_request
//      llc_end_evt_defer
//      llm_ecc_result_ind_handler
//      hci_le_ltk_req_reply_cmd_handler
//      hci_le_rd_chnl_map_cmd_handler
//      hci_rd_auth_payl_to_cmd_handler
//      hci_rd_rssi_cmd_handler
//      hci_rd_tx_pwr_lvl_cmd_handler
//      hci_le_con_update_cmd_handler
//      hci_wr_auth_payl_to_cmd_handler
//      hci_flush_cmd_handler
//      hci_le_rd_rfpath_compensation_cmd_handler
//      hci_le_rd_trans_pwr_cmd_handler
//      hci_rd_buff_size_cmd_handler
//      hci_rd_local_supp_feats_cmd_handler
//      hci_rd_local_supp_cmds_cmd_handler
//      hci_rd_local_ver_info_cmd_handler
//      hci_rd_bd_addr_cmd_handler
//      hci_le_rd_max_data_len_cmd_handler
//      hci_le_rd_suggted_dft_data_len_cmd_handler
//      hci_le_rd_supp_states_cmd_handler
//      hci_le_rd_wl_size_cmd_handler
//      hci_le_rd_adv_ch_tx_pw_cmd_handler
//      hci_le_rd_local_supp_feats_cmd_handler
//      hci_le_rd_buff_size_cmd_handler
//      hci_le_rand_cmd_handler
//      hci_le_test_end_cmd_handler
//      bt_onchiphci_send
Eq_2 ble_ke_msg_alloc(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, int32 a3, Eq_2 s2, Eq_2 s3, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, byte & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_136212 & a4Out, ptr32 & a6Out, ptr32 & a7Out, struct Eq_136215 & s2Out, struct Eq_136216 & s3Out, union Eq_136217 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_136223 * sp_31;
	Eq_2 s0_33;
	byte * a0_115;
	ptr32 a1_116;
	ptr32 a3_117;
	struct Eq_136212 * a4_118;
	ptr32 a6_109;
	ptr32 a7_110;
	ptr32 mstatus_111;
	Eq_2 ra_123;
	Eq_2 s1_124;
	struct Eq_136215 * s2_125;
	struct Eq_136216 * s3_126;
	Eq_136217 s4_112;
	ptr32 s8_113;
	a5_5();
	if (a0_115 == null)
	{
		Eq_2 a0_47;
		word32 a3_50;
		word32 s0_57;
		word32 s1_58;
		word32 a4_156;
		word32 a5_157;
		word32 a6_158;
		word32 s4_159;
		word32 s8_160;
		word32 mstatus_161;
		Eq_2 ra_56 = ble_ke_malloc(ra_123, s0_33, s1_124, (word32) s0_33 + 0x0C, 0x00, out s0_57, out s1_58, out a0_47, out a3_50, out a4_156, out a5_157, out a6_158, out s4_159, out s8_160, out mstatus_161);
		*(union Eq_2 *) ~0x00 = a0_47;
		<anonymous> * a5_66 = g_ptr4200F3D4;
		*((word32) a0_47 + 4) = (word16) s3_126;
		*((word32) a0_47 + 6) = (word16) s2_125;
		*((word32) a0_47 + 8) = (word16) s1_58;
		*((word32) a0_47 + 0x0A) = (word16) s0_57;
		sp_31->ptr0084 = (word32) a0_47 + 0x0C;
		a5_66();
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_124;
	a0Out = a0_115;
	a1Out = a1_116;
	a2Out = dwArg14;
	a3Out = a3_117;
	a4Out = a4_118;
	a6Out = a6_109;
	a7Out = a7_110;
	s2Out = s2_125;
	s3Out = s3_126;
	s4Out = s4_112;
	s8Out = s8_113;
	mstatusOut = mstatus_111;
	return ra_123;
}

