pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302BCFA: Register Eq_2 ble_ke_msg_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Stack Eq_2 dwArg10, Register out Eq_2 tpOut, Register out ptr32 t1Out, Register out Eq_2 s0Out, Register out (ptr32 Eq_130655) s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_130660) a5Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_send_2_host
//      hci_send_2_controller
//      ecc_multiplication_event_handler
//      ble_ke_msg_send_basic
//      lld_evt_move_to_slave
//      lld_pdu_rx_handler
//      llm_encryption_done
//      llcp_enc_rsp_handler
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_con_param_req_handler
//      llc_task_random_gen_request
//      llc_end_evt_defer
//      hci_le_rem_con_param_req_reply_cmd_handler
//      hci_le_ltk_req_reply_cmd_handler
//      hci_le_con_update_cmd_handler
Eq_2 ble_ke_msg_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 dwArg10, union Eq_2 & tpOut, ptr32 & t1Out, union Eq_2 & s0Out, struct Eq_130655 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_130660 & a5Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_130660 * a5_18;
	Eq_2 s0_19;
	Eq_2 ra_20;
	struct Eq_130655 * s1_21;
	ptr32 a0_22;
	ptr32 mstatus_24;
	ptr32 a3_61;
	ptr32 a4_62;
	ptr32 t1_63;
	a5_5();
	if (a0_22 != 0x00)
	{
		tpOut.u0 = <invalid>;
		t1Out = t1_63;
		s0Out = s0;
		s1Out = s1_21;
		a0Out = a0_22;
		a2Out = dwArg10;
		a3Out = a3_61;
		a4Out = a4_62;
		a5Out = a5_18;
		mstatusOut = mstatus_24;
		return ra_20;
	}
	else
	{
		Eq_2 s1_31 = __csrrs(mstatus_24, 0x00);
		__csrrc(mstatus_24, 0x08);
		struct Eq_130655 * s1_41;
		word32 a0_90;
		word32 a5_91;
		Eq_2 ra_40 = ble_co_list_push_back(ra_20, s0_19, s1_31, 0x420262A4, (word32) s0_19 - 0x0C, out s1_41, out a0_90, out a5_91);
		__csrrw(mstatus_24, 0x00);
		ptr32 a0_48;
		Eq_2 a2_50;
		ptr32 a3_51;
		ptr32 a4_52;
		struct Eq_130660 * a5_53;
		ptr32 mstatus_54;
		ptr32 t1_56;
		Eq_2 s0_57;
		word32 a1_92;
		Eq_2 ra_55 = ble_ke_event_set(ra_40, s0, 0x02, dwArg10, out t1_56, out s0_57, out a0_48, out a1_92, out a2_50, out a3_51, out a4_52, out a5_53, out mstatus_54);
		tpOut.u0 = <invalid>;
		t1Out = t1_56;
		s0Out = s0_57;
		s1Out = s1_41;
		a0Out = a0_48;
		a2Out = a2_50;
		a3Out = a3_51;
		a4Out = a4_52;
		a5Out = a5_53;
		mstatusOut = mstatus_54;
		return ra_55;
	}
}

// 2302BD48: Register Eq_2 ble_ke_msg_get_sent_num(Register Eq_2 ra, Register Eq_2 s0, Register out ptr32 a0Out)
// Called from:
//      llm_le_adv_report_ind
Eq_2 ble_ke_msg_get_sent_num(Eq_2 ra, Eq_2 s0, ptr32 & a0Out)
{
	ptr32 a0_24;
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_16;
	ptr32 mstatus_19;
	Eq_2 ra_14;
	a5_5();
	uint16 wLoc12_47 = SLICE(s0, uint16, 16);
	if (a0_16 != 0x00)
		a0_24 = (word32) wLoc12_47;
	else
	{
		Eq_2 s0_20 = __csrrs(mstatus_19, 0x00);
		__csrrc(mstatus_19, 0x08);
		word32 s0_53;
		ra_14 = ble_co_list_size(ra_14, s0_20, 0x420262A4, out s0_53, out a0_24);
		__csrrw(mstatus_19, 0x00);
	}
	a0Out = a0_24;
	return ra_14;
}

// 2302BD84: Register Eq_2 ble_ke_msg_send_basic(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register int32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 t1Out, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_136401) a4Out, Register out ptr32 a6Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_136405 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      ble_ke_timer_schedule
//      lld_evt_elt_delete
//      llm_end_evt_defer
//      llcp_pause_enc_req_handler
//      llcp_start_enc_req_handler
//      llcp_enc_req_handler
//      llm_enc_ind_handler
//      llc_chnl_assess_timer_handler
//      llc_pdu_llcp_tx_ack_defer
//      llc_pdu_acl_tx_ack_defer
//      hci_le_set_data_len_cmd_handler
//      hci_le_start_enc_cmd_handler
Eq_2 ble_ke_msg_send_basic(Eq_2 ra, Eq_2 s0, Eq_2 s1, int32 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & t1Out, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, struct Eq_136401 & a4Out, ptr32 & a6Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_136405 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 s0_27;
	Eq_2 s1_28;
	Eq_2 s2_29;
	Eq_2 ra_30;
	ptr32 a0_31;
	ptr32 a3_34;
	Eq_136405 s3_84;
	struct Eq_136401 * a4_85;
	ptr32 a6_86;
	ptr32 a7_87;
	ptr32 mstatus_88;
	ptr32 s4_89;
	ptr32 t1_91;
	a5_5();
	if (a0_31 != 0x00)
	{
		0x00 = (int8) dwArg38;
		t1Out = t1_91;
		s0Out = s0;
		s1Out = s1_28;
		a0Out = a0_31;
		a3Out = a3_34;
		a4Out = a4_85;
		a6Out = a6_86;
		a7Out = a7_87;
		s2Out = s2_29;
		s3Out = s3_84;
		s4Out = s4_89;
		mstatusOut = mstatus_88;
		return ra_30;
	}
	else
	{
		Eq_2 a0_45;
		ptr32 a6_51;
		ptr32 a7_52;
		Eq_2 s1_56;
		Eq_2 s2_57;
		Eq_136405 s3_58;
		ptr32 s4_59;
		word32 s0_130;
		word32 a1_131;
		word32 a2_132;
		word32 a3_133;
		word32 a4_134;
		word32 s8_135;
		word32 mstatus_136;
		Eq_2 ra_54 = ble_ke_msg_alloc(ra_30, s0_27, s1_28, s0_27, s1_28, s2_29, 0x00, s2_29, s3, dwArg0118, out s0_130, out s1_56, out a0_45, out a1_131, out a2_132, out a3_133, out a4_134, out a6_51, out a7_52, out s2_57, out s3_58, out s4_59, out s8_135, out mstatus_136);
		0x00 = (int8) dwArg38;
		ptr32 a0_68;
		ptr32 a3_71;
		struct Eq_136401 * a4_72;
		ptr32 mstatus_74;
		Eq_2 s1_76;
		ptr32 t1_77;
		Eq_2 s0_79;
		word32 tp_137;
		word32 a2_138;
		word32 a5_139;
		Eq_2 ra_75 = ble_ke_msg_send(ra_54, s0, s1_56, a0_45, dwArg10, out tp_137, out t1_77, out s0_79, out s1_76, out a0_68, out a2_138, out a3_71, out a4_72, out a5_139, out mstatus_74);
		t1Out = t1_77;
		s0Out = s0_79;
		s1Out = s1_76;
		a0Out = a0_68;
		a3Out = a3_71;
		a4Out = a4_72;
		a6Out = a6_51;
		a7Out = a7_52;
		s2Out = s2_57;
		s3Out = s3_58;
		s4Out = s4_59;
		mstatusOut = mstatus_74;
		return ra_75;
	}
}

// 2302BDCE: Register Eq_2 ble_ke_msg_free(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out ptr32 tpOut, Register out Eq_2 s0Out, Register out (ptr32 Eq_127923) s1Out, Register out (ptr32 Eq_127924) a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_127928) a5Out, Register out ptr32 s2Out, Register out Eq_127930 s3Out, Register out Eq_127931 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      ble_controller_deinit
//      hci_send_2_controller
//      ble_ke_flush
//      llc_stop
//      lld_pdu_tx_flush
//      llm_util_adv_data_update
//      llm_init
//      llm_encryption_done
//      ble_ke_task_schedule
//      llc_util_clear_operation_ptr
//      hci_le_set_scan_rsp_data_cmd_handler
//      hci_le_set_adv_data_cmd_handler
Eq_2 ble_ke_msg_free(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 & tpOut, union Eq_2 & s0Out, struct Eq_127923 & s1Out, struct Eq_127924 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_127928 & a5Out, ptr32 & s2Out, union Eq_127930 & s3Out, union Eq_127931 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_127928 * a5_16;
	Eq_2 s0_17;
	Eq_2 ra_18;
	struct Eq_127924 * a0_19;
	struct Eq_127923 * s1_54;
	ptr32 s2_55;
	Eq_127930 s3_56;
	Eq_127931 s4_57;
	ptr32 s5_58;
	ptr32 a3_59;
	ptr32 a4_60;
	ptr32 mstatus_62;
	ptr32 tp_65;
	a5_5();
	if (a0_19 != null)
	{
		tpOut = tp_65;
		s0Out = s0;
		s1Out = s1_54;
		a0Out = a0_19;
		a2Out = dwArg10;
		a3Out = a3_59;
		a4Out = a4_60;
		a5Out = a5_16;
		s2Out = s2_55;
		s3Out = s3_56;
		s4Out = s4_57;
		s5Out = s5_58;
		mstatusOut = mstatus_62;
		return ra_18;
	}
	else
	{
		struct Eq_127924 * a0_34;
		ptr32 a2_36;
		ptr32 a3_37;
		ptr32 a4_38;
		struct Eq_127928 * a5_39;
		ptr32 mstatus_41;
		Eq_2 s0_43;
		struct Eq_127923 * s1_44;
		ptr32 s2_45;
		Eq_127930 s3_46;
		Eq_127931 s4_47;
		ptr32 s5_48;
		ptr32 tp_51;
		word32 a1_100;
		word32 a6_101;
		word32 s8_102;
		Eq_2 ra_42 = ble_ke_free(ra_18, s0, s1, s0_17, s2, s3, s4, s5, out tp_51, out s0_43, out s1_44, out a0_34, out a1_100, out a2_36, out a3_37, out a4_38, out a5_39, out a6_101, out s2_45, out s3_46, out s4_47, out s5_48, out s8_102, out mstatus_41);
		tpOut = tp_51;
		s0Out = s0_43;
		s1Out = s1_44;
		a0Out = a0_34;
		a2Out = a2_36;
		a3Out = a3_37;
		a4Out = a4_38;
		a5Out = a5_39;
		s2Out = s2_45;
		s3Out = s3_46;
		s4Out = s4_47;
		s5Out = s5_48;
		mstatusOut = mstatus_41;
		return ra_42;
	}
}

// 2302BDFA: void ble_cmp_abs_time(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a1)
void ble_cmp_abs_time(word32 ra, word32 s0, word32 s1, word32 a0, word32 a1)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_25;
	a5_5();
}

// 2302BE34: void ble_cmp_timer_id(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a1)
void ble_cmp_timer_id(word32 ra, word32 s0, word32 s1, word32 a0, word32 a1)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	uint32 s0_22;
	struct Eq_136558 * s1_23;
	word32 a0_25;
	a5_5();
	if (a0_25 == 0x00)
		(word32) s1_23->w0004 != s0_22 >> 0x10;
}

// 2302BE80: Register Eq_2 ble_ke_time(Register Eq_2 ra, Register out Eq_136570 a0Out)
// Called from:
//      ble_ke_time_past
//      ble_ke_timer_set
Eq_2 ble_ke_time(Eq_2 ra, union Eq_136570 & a0Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_12;
	int32 a3_17;
	Eq_136570 a0_13;
	a5_5();
	if (a0_13 == 0x00)
	{
		*(word32 *) 0x8000001C = 0x28000000;
		do
			;
		while (a3_17 < 0x00);
		a0_13 = (word32) (a0_13 < 312) + 0x80000000 << 5 >> 9;
	}
	a0Out = a0_13;
	return ra_12;
}

// 2302BEBA: Register word32 ble_ke_time_cmp(Register word32 ra, Register (ptr32 Eq_136594) s0, Register Eq_2 s1, Register word32 a0, Register (ptr32 Eq_136594) a1, Register out Eq_136598 s0Out, Register out Eq_136599 s1Out, Register out Eq_136600 a0Out, Register out ptr32 a5Out)
// Called from:
//      ble_ke_time_past
word32 ble_ke_time_cmp(word32 ra, struct Eq_136594 * s0, Eq_2 s1, word32 a0, struct Eq_136594 * a1, union Eq_136598 & s0Out, union Eq_136599 & s1Out, union Eq_136600 & a0Out, ptr32 & a5Out)
{
	Eq_136600 a0_34;
	<anonymous> * a5_5 = g_ptr4200F3C8;
	ptr32 a5_21;
	Eq_136598 s0_22;
	Eq_136599 s1_23;
	word32 ra_24;
	word32 a0_25;
	a5_5();
	byte bLoc11_53 = SLICE(s0, byte, 24);
	if (a0_25 != 0x00)
		a0_34 = (word32) bLoc11_53;
	else
		a0_34 = (s0_22 - s1_23 >> 22 ^ 1) & 0x01;
	s0Out = s0_22;
	s1Out = s1_23;
	a0Out = a0_34;
	a5Out = a5_21;
	return ra_24;
}

// 2302BEF6: Register Eq_2 ble_ke_time_past(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register out (ptr32 Eq_136594) s0Out, Register out Eq_136628 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out)
// Called from:
//      ble_ke_timer_schedule
//      ble_ke_timer_set
//      ble_ke_timer_clear
Eq_2 ble_ke_time_past(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, struct Eq_136594 & s0Out, union Eq_136628 & s1Out, ptr32 & a0Out, ptr32 & a5Out)
{
	ptr32 a0_32;
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_19;
	ptr32 a5_16;
	Eq_2 ra_18;
	struct Eq_136594 * s0_17;
	Eq_136628 s1_38;
	a5_5();
	byte bLoc11_66 = SLICE(s0, byte, 24);
	if (a0_19 != 0x00)
		a0_32 = (word32) bLoc11_66;
	else
	{
		word32 a0_23;
		ra_18 = ble_ke_time_cmp(ble_ke_time(ra_18, out a0_23), s0_17, s1, a0_23, s0_17, out s0_17, out s1_38, out a0_32, out a5_16);
	}
	s0Out = s0_17;
	s1Out = s1_38;
	a0Out = a0_32;
	a5Out = a5_16;
	return ra_18;
}

// 2302BF28: Register Eq_2 ble_ke_timer_hw_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register out ptr32 a0Out)
// Called from:
//      ble_ke_timer_schedule
//      ble_ke_timer_set
//      ble_ke_timer_clear
Eq_2 ble_ke_timer_hw_set(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 & a0Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	struct Eq_136664 * a5_16;
	word32 s0_17;
	Eq_2 ra_18;
	ptr32 a0_19;
	struct Eq_136668 * a4_21;
	a5_5();
	if (a0_19 == 0x00)
	{
		if (s0_17 != 0x00)
		{
			*(struct Eq_136668 **) 0x280000F4 = a4_21;
			Eq_2 a5_29 = a4_21->t000C;
			if ((a4_21 >> 6 & 0x01) == 0x00)
			{
				*(union Eq_2 *) 88 = a5_29;
				*(word32 *) 0x4C = *(word32 *) 76;
			}
		}
		else
			(a5_16 & -65)->dw000C = a5_16->dw000C;
	}
	a0Out = a0_19;
	return ra_18;
}

// 2302BF78: void ble_ke_timer_schedule(Register word32 ra, Register Eq_2 s0, Register word32 s1, Register word32 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg0108)
void ble_ke_timer_schedule(word32 ra, Eq_2 s0, word32 s1, word32 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg0108)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_22;
	Eq_2 s0_136;
	Eq_2 ra_135;
	a5_5();
	if (a0_22 != 0x00)
	{
l2302BFF0:
		0x00 = dwArg38;
	}
	else
	{
		Eq_2 s2_138 = 0x42026000;
		while (true)
		{
			struct Eq_136728 * a0_32;
			word32 mstatus_268;
			Eq_2 ra_39 = ble_ke_event_clear(ra_135, s0_136, 0x03, out a0_32, out mstatus_268);
			Eq_2 s1_41 = *((word32) s0_136 + 16);
			if (s0_136 == 0x00)
				break;
			word32 a0_44;
			word32 a5_242;
			Eq_2 s0_51;
			Eq_2 s1_101;
			Eq_2 ra_50 = ble_ke_time_past(ra_39, a0_32->t0008, s1_41, (char *) a0_32 - 1, out s0_51, out s1_101, out a0_44, out a5_242);
			if (a0_44 == 0x00)
			{
				Eq_2 a0_57;
				word32 a0_64;
				word32 a5_244;
				ra_50 = ble_ke_time_past(ble_ke_timer_hw_set(ra_50, s0_51, s0_51, out a0_57), *((word32) a0_57 + 8), s1_101, a0_57, out s0_51, out s1_101, out a0_64, out a5_244);
				if (a0_64 == 0x00)
					goto l2302BFF0;
			}
			Eq_2 a0_88;
			Eq_2 s1_115;
			Eq_2 s2_116;
			Eq_2 s3_117;
			Eq_2 s4_118;
			Eq_2 s0_123;
			word32 mstatus_255;
			word32 a7_254;
			word32 a4_252;
			word32 a3_251;
			word32 t1_249;
			word32 s8_248;
			word32 a1_246;
			word32 s0_245;
			word32 a1_259;
			word32 a0_258;
			word32 s1_257;
			word32 tp_256;
			word32 a6_253;
			word32 a0_250;
			word32 a5_247;
			word32 a2_260;
			word32 a3_261;
			word32 a4_262;
			word32 a5_263;
			word32 a6_264;
			word32 s4_265;
			word32 s8_266;
			word32 mstatus_267;
			ra_135 = ble_ke_free(ble_ke_msg_send_basic(ble_co_list_pop_front(ra_50, s0_51, (word32) s2_138 + 692, out s0_245, out a0_88, out a1_246, out a5_247, out s8_248), a0_88, s1_101, (word32) *((word32) a0_88 + 4), (word32) *((word32) a0_88 + 6), 0x00FF, s2_138, s3, dwArg00, dwArg28, dwArg0108, out t1_249, out s0_123, out s1_115, out a0_250, out a3_251, out a4_252, out a6_253, out a7_254, out s2_116, out s3_117, out s4_118, out mstatus_255), s0_123, s1_115, s0_123, s2_116, s3_117, s4_118, s5, out tp_256, out s0_136, out s1_257, out a0_258, out a1_259, out a2_260, out a3_261, out a4_262, out a5_263, out a6_264, out s2_138, out s3, out s4_265, out s5, out s8_266, out mstatus_267);
		}
		0x00 = dwArg38;
		word32 a0_243;
		ble_ke_timer_hw_set(ra_39, s0, 0x00, out a0_243);
	}
}

