pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302BFFC: Register Eq_2 ble_ke_timer_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register out ptr32 s0Out, Register out ptr32 s4Out)
// Called from:
//      ble_ke_init
Eq_2 ble_ke_timer_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, ptr32 & s0Out, ptr32 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	Eq_2 ra_12;
	word32 a0_13;
	ptr32 s0_36;
	ptr32 s4_38;
	a5_5();
	if (a0_13 != 0x00)
	{
		s0Out = s0_36;
		s4Out = s4_38;
		return ra_12;
	}
	else
	{
		ptr32 s0_30;
		ptr32 s4_32;
		word32 s1_56;
		Eq_2 ra_29 = ble_ke_event_callback_set(ra_12, s0, s1, 0x03, 587382648, out s0_30, out s1_56, out s4_32);
		s0Out = s0_30;
		s4Out = s4_32;
		return ra_29;
	}
}

// 2302C026: Register Eq_2 ble_ke_timer_set(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register int32 a0, Register Eq_2 a1, Register Eq_136887 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg10, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a5Out, Register out (ptr32 Eq_136899) s2Out, Register out Eq_136900 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_start
//      llc_common_enc_change_evt_send
//      llc_lsto_con_update
//      llcp_enc_rsp_handler
//      llc_llcp_pause_enc_req_pdu_send
//      llcp_pause_enc_rsp_handler
//      llc_llcp_enc_req_pdu_send
//      llcp_start_enc_rsp_handler
//      llcp_con_param_req_handler
//      llc_llcp_terminate_ind_pdu_send
//      llc_auth_payl_real_to_ind_handler
//      llc_length_req_ind_handler
//      llc_enc_mgt_ind_handler
//      llc_chnl_assess_timer_handler
//      llc_link_sup_to_ind_handler
//      llc_auth_payl_nearly_to_ind_handler
//      llc_pdu_defer
//      hci_le_rem_con_param_req_reply_cmd_handler
//      hci_le_ltk_req_neg_reply_cmd_handler
//      hci_le_rd_rem_used_feats_cmd_handler
//      hci_wr_auth_payl_to_cmd_handler
//      hci_rd_rem_ver_info_cmd_handler
//      hci_le_set_host_ch_class_cmd_handler
Eq_2 ble_ke_timer_set(Eq_2 ra, Eq_2 s0, Eq_2 s1, int32 a0, Eq_2 a1, Eq_136887 a2, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg10, Eq_2 dwArgA8, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a5Out, struct Eq_136899 & s2Out, union Eq_136900 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	ui32 s5_36;
	ui32 s6_37;
	word32 a0_43;
	ptr32 a5_180;
	Eq_2 s0_35;
	ptr32 mstatus_110;
	Eq_2 ra_181;
	Eq_2 s1_183;
	struct Eq_136899 * s2_153;
	Eq_136900 s3_154;
	a5_5();
	if (a0_43 == 0x00)
	{
		Eq_2 a5_55 = g_t420262B4;
		word32 s4_114 = 0x420262A4;
		if (s0_35 < 0x00400000)
		{
			if (s0_35 == 0x00)
				s0_35.u0 = 0x01;
		}
		else
			s0_35.u0 = 0x003FFFFF;
		ptr32 s2_59 = 0x00;
		if (a5_55 != 0x00 && (word32) (*((word32) a5_55 + 4)) == s6_37)
			s2_59 = (word32) ((word32) *((word32) a5_55 + 6) - s5_36 < 1);
		Eq_2 a0_86;
		word32 s2_95;
		word32 s3_96;
		word32 a3_367;
		word32 a4_368;
		word32 s1_365;
		word32 a1_366;
		Eq_2 s0_112;
		Eq_2 ra_111 = ble_ke_queue_extract(ra_181, s0_35, s1_183, 0x420262B4, 587382324, s6_37 << 0x10 | s5_36, s2_59, 0x42026000, dwArg0108, out s0_112, out s1_365, out a0_86, out a1_366, out a3_367, out a4_368, out s2_95, out s3_96);
		Eq_2 s1_118 = a0_86;
		if (a0_86 == 0x00)
		{
			Eq_2 a0_102;
			word32 a6_373;
			word32 s8_374;
			word32 a3_370;
			word32 a4_371;
			word32 a5_372;
			word32 s1_369;
			ra_111 = ble_ke_malloc(ra_111, s0_112, a0_86, 0x0C, 0x00, out s0_112, out s1_369, out a0_102, out a3_370, out a4_371, out a5_372, out a6_373, out s4_114, out s8_374, out mstatus_110);
			*((word32) a0_102 + 4) = (word16) s6_37;
			*((word32) a0_102 + 6) = (word16) s5_36;
			s1_118 = a0_102;
		}
		word32 s0_130 = (word32) s0_112 + a0_122;
		word32 a0_122;
		word32 ra_127 = ble_ke_time(ra_111, out a0_122);
		((Eq_2[]) 8)[(word32) (word23) s0_130 / 4] = s1_118;
		Eq_2 s0_151;
		Eq_2 s1_152;
		struct Eq_137009 * s4_155;
		Eq_2 ra_150 = ble_ke_queue_insert(ra_127, s0_130, s1_118, s3_96 + 692, s1_118, 587382266, s2_95, s3_96, s4_114, out s0_151, out s1_152, out s2_153, out s3_154, out s4_155);
		if (s2_153 != null || s4_155->t0010 == s1_152)
		{
			word32 a0_375;
			ra_150 = ble_ke_timer_hw_set(ra_150, s0_151, s4_155->t0010, out a0_375);
		}
		word32 a0_175;
		word32 s0_376;
		ra_181 = ble_ke_time_past(ra_150, s0_151, s1_152, s0_151, out s0_376, out s1_183, out a0_175, out a5_180);
		if (a0_175 != 0x00)
		{
			0x00 = (int8) dwArgA8;
			ptr32 a5_215;
			ptr32 mstatus_216;
			Eq_2 s0_219;
			word32 a1_379;
			word32 a2_380;
			word32 a4_382;
			word32 a3_381;
			word32 t1_377;
			word32 a0_378;
			Eq_2 ra_217 = ble_ke_event_set(ra_181, s1, 0x03, dwArg10, out t1_377, out s0_219, out a0_378, out a1_379, out a2_380, out a3_381, out a4_382, out a5_215, out mstatus_216);
			s0Out = s0_219;
			s1Out = s1_183;
			a5Out = a5_215;
			s2Out = s2_153;
			s3Out = s3_154;
			s4Out.u0 = <invalid>;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			mstatusOut = mstatus_216;
			return ra_217;
		}
	}
	0x00 = (int8) dwArgA8;
	s0Out = s1;
	s1Out = s1_183;
	a5Out = a5_180;
	s2Out = s2_153;
	s3Out = s3_154;
	s4Out.u0 = <invalid>;
	s5Out.u0 = <invalid>;
	s6Out.u0 = <invalid>;
	mstatusOut = mstatus_110;
	return ra_181;
}

// 2302C124: Register Eq_2 ble_ke_timer_clear(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register int32 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_common_enc_change_evt_send
//      llcp_ping_rsp_handler
//      llcp_terminate_ind_handler
//      llc_llcp_reject_ind
//      llcp_pause_enc_req_handler
//      llcp_enc_req_handler
//      llcp_unknown_rsp_handler
//      llcp_vers_ind_handler
//      llcp_pause_enc_rsp_handler
//      llcp_start_enc_rsp_handler
//      llcp_length_rsp_handler
//      llcp_con_param_rsp_handler
//      llcp_feats_rsp_handler
//      llcp_con_upd_ind_handler
//      lld_stop_ind_handler
//      llc_util_dicon_procedure
Eq_2 ble_ke_timer_clear(Eq_2 ra, Eq_2 s0, Eq_2 s1, int32 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg04, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	ptr32 mstatus_163;
	Eq_2 a0_167;
	ptr32 a1_169;
	ptr32 a3_160;
	ptr32 a4_161;
	Eq_2 ra_103;
	Eq_2 s0_104;
	Eq_2 s1_105;
	Eq_2 s2_132;
	Eq_2 s3_133;
	a5_5();
	if (a0_167 == 0x00)
	{
		s2_132.u0 = 0x420262A4;
		s0_104 = g_t420262B4;
		if (s0_104 != 0x00)
		{
			if ((word32) *((word32) s0_104 + 4) == s1_105 && (word32) (*((word32) s0_104 + 6)) == s3_133)
			{
				word32 a1_242;
				word32 a0_241;
				word32 a5_243;
				word32 s8_244;
				Eq_2 ra_84 = ble_co_list_pop_front(ra_103, s0_104, 0x420262B4, out s0_104, out a0_241, out a1_242, out a5_243, out s8_244);
				s1_105 = g_t420262B4;
				Eq_2 a0_90;
				ra_103 = ble_ke_timer_hw_set(ra_84, s0_104, s1_105, out a0_90);
				if (s1_105 != 0x00)
				{
					word32 a0_97;
					word32 a5_245;
					ra_103 = ble_ke_time_past(ra_103, s0_104, *((word32) a0_90 + 8), a0_90, out s0_104, out s1_105, out a0_97, out a5_245);
					if (a0_97 != 0x00)
					{
						word32 t1_246;
						word32 a0_247;
						word32 a1_248;
						word32 a2_249;
						word32 a3_250;
						word32 a4_251;
						word32 a5_252;
						word32 mstatus_253;
						ra_103 = ble_ke_event_set(ra_103, s0_104, 0x03, dwLoc10, out t1_246, out s0_104, out a0_247, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252, out mstatus_253);
					}
				}
l2302C18A:
				Eq_2 a0_137;
				ptr32 a1_138;
				ptr32 a2_139;
				ptr32 a3_140;
				ptr32 a4_141;
				ptr32 mstatus_144;
				Eq_2 s0_146;
				Eq_2 s1_147;
				Eq_2 s2_148;
				Eq_2 s3_149;
				Eq_2 s4_150;
				Eq_2 s5_151;
				ptr32 s8_152;
				word32 tp_254;
				word32 a5_255;
				word32 a6_256;
				Eq_2 ra_145 = ble_ke_free(ra_103, s0_104, s1_105, s0_104, s2_132, s3_133, dwArg04, s5, out tp_254, out s0_146, out s1_147, out a0_137, out a1_138, out a2_139, out a3_140, out a4_141, out a5_255, out a6_256, out s2_148, out s3_149, out s4_150, out s5_151, out s8_152, out mstatus_144);
				s0Out = s0_146;
				s1Out = s1_147;
				a0Out = a0_137;
				a1Out = a1_138;
				a2Out = a2_139;
				a3Out = a3_140;
				a4Out = a4_141;
				s2Out = s2_148;
				s3Out = s3_149;
				s4Out = s4_150;
				s5Out = s5_151;
				s8Out = s8_152;
				mstatusOut = mstatus_144;
				return ra_145;
			}
			word32 s0_240;
			ra_103 = ble_ke_queue_extract(ra_103, s0_104, s1_105, 0x420262B4, 587382324, s1_105 << 0x10 | s3_133, 0x420262A4, s3_133, dwArg0108, out s0_240, out s1_105, out a0_167, out a1_169, out a3_160, out a4_161, out s2_132, out s3_133);
			s0_104 = a0_167;
			if (a0_167 != 0x00)
				goto l2302C18A;
		}
	}
	s0Out = s0_104;
	s1Out = s1_105;
	a0Out = a0_167;
	a1Out = a1_169;
	a2Out = dwArg48;
	a3Out = a3_160;
	a4Out = a4_161;
	s2Out = s2_132;
	s3Out = s3_133;
	s4Out = dwArg04;
	s5Out = s5;
	s8Out = dwLoc1C;
	mstatusOut = mstatus_163;
	return ra_103;
}

// 2302C1C6: Register Eq_2 ble_ke_timer_active(Register Eq_2 ra, Register ui32 s0, Register Eq_2 s1, Register int32 a0, Register Eq_2 a1, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out)
// Called from:
//      llc_auth_payl_nearly_to_ind_handler
Eq_2 ble_ke_timer_active(Eq_2 ra, ui32 s0, Eq_2 s1, int32 a0, Eq_2 a1, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	ptr32 s0_22;
	ptr32 s1_23;
	Eq_2 ra_24;
	word32 a0_25;
	a5_5();
	byte bLoc11_76 = SLICE(s0, byte, 24);
	if (a0_25 == 0x00)
	{
		Eq_2 a5_33 = g_t420262B4;
		while (a5_33 != 0x00)
		{
			if ((word32) *((word32) a5_33 + 4) == s0_22 && (word32) (*((word32) a5_33 + 6)) == s1_23)
			{
				bLoc11_76 = 0x01;
				goto l2302C1E6;
			}
			a5_33 = *a5_33;
		}
		bLoc11_76 = 0x00;
	}
l2302C1E6:
	s0Out = s0_22;
	s1Out = s1_23;
	a0Out = (word32) bLoc11_76;
	return ra_24;
}

