pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302C220: Register word32 ble_ke_init(Register word32 ra, Register Eq_2 s0, Stack word32 dwArg00, Stack word32 dwArg10, Register out Eq_2 s0Out, Register out ptr32 s4Out)
// Called from:
//      rwip_init
word32 ble_ke_init(word32 ra, Eq_2 s0, word32 dwArg00, word32 dwArg10, union Eq_2 & s0Out, ptr32 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 ra_14;
	word32 a0_16;
	ptr32 s4_88;
	a5_5();
	if (a0_16 != 0x00)
	{
		s0Out = s0;
		s4Out = s4_88;
		return ra_14;
	}
	else
	{
		word32 ra_30;
		struct Eq_137324 * s0_31;
		g_ptr4200F3D4();
		word32 ra_42;
		s0_31->ptr03D4();
		Eq_2 ra_51 = ble_ke_event_init(ra_42, dwArg00);
		g_ptr420262AC = null;
		g_dw420262B0 = 0x00;
		g_dw420262A4 = 0x00;
		g_ptr420262A8 = null;
		g_t420262B4.u0 = 0x00;
		g_dw420262B8 = 0x00;
		Eq_2 s1_67;
		Eq_2 ra_65 = ble_ke_task_init(ra_51, dwArg00, out s1_67);
		Eq_2 s0_79;
		ptr32 s4_81;
		word32 ra_78 = ble_ke_timer_init(ra_65, s0, s1_67, out s0_79, out s4_81);
		s0Out = s0_79;
		s4Out = s4_81;
		return ra_78;
	}
}

// 2302C296: Register Eq_2 ble_ke_flush(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out)
// Called from:
//      rwip_init
Eq_2 ble_ke_flush(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out)
{
	<anonymous> * a5_5 = g_ptr4200F3C8;
	word32 a0_16;
	Eq_2 s1_149;
	Eq_2 s2_150;
	Eq_2 s3_151;
	Eq_2 s4_152;
	Eq_2 s5_153;
	Eq_2 ra_14;
	a5_5();
	if (a0_16 != 0x00)
	{
		s1Out = s1_149;
		s2Out = s2_150;
		s3Out = s3_151;
		s4Out = s4_152;
		s5Out = s5_153;
		return ra_14;
	}
	else
	{
		Eq_2 s0_21 = 0x42026000;
		while (true)
		{
			Eq_2 a0_25;
			Eq_2 s0_30;
			word32 a1_236;
			word32 a5_237;
			word32 s8_238;
			Eq_2 ra_29 = ble_co_list_pop_front(ra_14, s0_21, (word32) s0_21 + 676, out s0_30, out a0_25, out a1_236, out a5_237, out s8_238);
			if (a0_25 == 0x00)
				break;
			word32 tp_206;
			word32 a0_207;
			word32 a2_208;
			word32 a3_209;
			word32 a4_210;
			word32 a5_211;
			word32 mstatus_212;
			ra_14 = ble_ke_msg_free(ra_29, s0_30, s1, a0_25, s2, s3, s4, s5, out tp_206, out s0_21, out s1, out a0_207, out a2_208, out a3_209, out a4_210, out a5_211, out s2, out s3, out s4, out s5, out mstatus_212);
		}
		Eq_2 s0_56 = 0x42026000;
		while (true)
		{
			Eq_2 a0_60;
			Eq_2 s0_65;
			word32 a1_233;
			word32 a5_234;
			word32 s8_235;
			Eq_2 ra_125 = ble_co_list_pop_front(ra_29, s0_56, (word32) s0_56 + 684, out s0_65, out a0_60, out a1_233, out a5_234, out s8_235);
			if (a0_60 == 0x00)
				break;
			word32 tp_213;
			word32 a0_214;
			word32 a2_215;
			word32 a3_216;
			word32 a4_217;
			word32 a5_218;
			word32 mstatus_219;
			ra_29 = ble_ke_msg_free(ra_125, s0_65, s1, a0_60, s2, s3, s4, s5, out tp_213, out s0_56, out s1, out a0_214, out a2_215, out a3_216, out a4_217, out a5_218, out s2, out s3, out s4, out s5, out mstatus_219);
		}
		Eq_2 s0_126 = 0x42026000;
		while (true)
		{
			Eq_2 a0_95;
			Eq_2 s0_100;
			word32 a1_230;
			word32 a5_231;
			word32 s8_232;
			Eq_2 ra_99 = ble_co_list_pop_front(ra_125, s0_126, (word32) s0_126 + 692, out s0_100, out a0_95, out a1_230, out a5_231, out s8_232);
			if (a0_95 == 0x00)
				break;
			word32 tp_220;
			word32 a0_221;
			word32 a1_222;
			word32 a2_223;
			word32 a3_224;
			word32 a4_225;
			word32 a5_226;
			word32 a6_227;
			word32 s8_228;
			word32 mstatus_229;
			ra_125 = ble_ke_free(ra_99, s0_100, s1, a0_95, s2, s3, s4, s5, out tp_220, out s0_126, out s1, out a0_221, out a1_222, out a2_223, out a3_224, out a4_225, out a5_226, out a6_227, out s2, out s3, out s4, out s5, out s8_228, out mstatus_229);
		}
		Eq_2 ra_111 = ble_ke_event_flush(ra_99);
		s1Out = s1;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		return ra_111;
	}
}

// 2302C2F8: void rf_force_agc_enable()
void rf_force_agc_enable()
{
}

// 2302C2FA: void rf_txpwr_dbm_get()
void rf_txpwr_dbm_get()
{
}

struct Eq_131057 * g_ptr2302C2FC = &g_tC5034200;
// 2302C304: void rf_rssi_convert()
void rf_rssi_convert()
{
}

struct Eq_131057 * g_ptr2302C30E = &g_t45018082;
// 2302C310: void rf_reg_rd()
void rf_reg_rd()
{
}

// 2302C314: void rf_reg_wr()
void rf_reg_wr()
{
}

// 2302C316: void rf_sleep(Register (ptr32 Eq_137515) a5)
void rf_sleep(struct Eq_137515 * a5)
{
	(a5 | 7)->dw0030 = a5->dw0030;
}

struct Eq_131057 * g_ptr2302C320 = &g_t8082DB1C;
// 2302C324: void rf_txpwr_dec(Register int32 a0)
void rf_txpwr_dec(int32 a0)
{
	if (rfc_config_power_ble((int32) g_b4200F3EA + ((int32) g_b4200EB40 - a0)) != 0x00)
		g_b4200EB40 = (byte) ((word32) g_b4200EB40 - a0);
}

struct Eq_131057 * g_ptr2302C32C = &g_tB4040413;
struct Eq_131057 * g_ptr2302C330 = &g_t40703;
struct Eq_131057 * g_ptr2302C338 = &g_t8F09C226;
struct Eq_131057 * g_ptr2302C33E = &g_t3EA78503;
// 2302C360: void rf_txpwr_inc(Register word32 a0)
void rf_txpwr_inc(word32 a0)
{
	if (rfc_config_power_ble((int32) g_b4200F3EA + ((int32) g_b4200EB40 + a0)) != 0x00)
		g_b4200EB40 = (byte) (a0 + (word32) g_b4200EB40);
}

struct Eq_131057 * g_ptr2302C36C = &g_t40783;
// 2302C39C: void rf_txpwr_max_set(Register int32 a0)
// Called from:
//      rf_reset
void rf_txpwr_max_set(int32 a0)
{
	if ((int32) g_b4200EB40 == 0x007F)
		a0 = 0x0F;
	g_b4200EB40 = (byte) a0;
	if (rfc_config_power_ble(a0 + (int32) g_b4200F3EA) != 0x00)
		return;
	int32 a0_31 = (int32) g_b4200F3EA;
	rfc_config_power_ble(a0_31 + 0x0F);
}

struct Eq_131057 * g_ptr2302C3AC = &g_t879307F0;
// 2302C3E8: void rf_reset()
void rf_reset()
{
	*(int32 *) 0x28000080 = *(int32 *) 0x28000080 & -0x0100 | 66;
	*(int32 *) 0x28000080 &= 0xF00000FF;
	*(int32 *) 0x28000080 = *(int32 *) 0x28000080 & ~0x00FF0000 | 0x003C0000;
	*(int32 *) 0x28000080 &= ~0x7F000000;
	*(word32 *) 0x280001A4 = 0x0A;
	*(int32 *) 0x280001A8 = 0x007D;
	*(union Eq_137626 *) 0x280001AC = *(union Eq_137626 *) 0x280001AC & -64 | 40;
	bz_phy_reset();
	int32 a0_44 = (int32) g_b4200EB40;
	rf_txpwr_max_set(a0_44);
}

