pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302C468: void ble_rf_set_pwr_offset(Register int32 a0)
// Called from:
//      hal_board_cfg
void ble_rf_set_pwr_offset(int32 a0)
{
	g_b4200F3EA = (byte) a0;
}

// 2302C472: void ble_controller_set_tx_pwr(Register Eq_2 a0)
// Called from:
//      hal_board_cfg
void ble_controller_set_tx_pwr(Eq_2 a0)
{
	int32 a0_9 = (int32) (byte) a0;
	g_b4200FB40 = (byte) a0_9;
	if (rfc_config_power_ble(a0_9 + (int32) g_b4200F3EA) != 0x00)
		return;
	int32 a0_25 = (int32) g_b4200F3EA;
	rfc_config_power_ble(a0_25 + 0x0F);
}

// 2302C4B0: void ble_rf_init(Register (ptr32 Eq_131057) a0)
// Called from:
//      rwip_init
void ble_rf_init(struct Eq_131057 * a0)
{
	g_ptr2302C330 = a0;
	g_ptr2302C338 = a0;
	g_ptr2302C30E = a0;
	a0->b002C = 0x0F;
	g_ptr2302C3AC = a0;
	g_ptr2302C36C = a0;
	g_ptr2302C32C = a0;
	g_ptr2302C33E = a0;
	g_ptr2302C3E8 = a0;
	g_ptr2302C2FC = a0;
	g_ptr2302C320 = a0;
}

// 2302C51C: Register Eq_2 pka0_write_common_op_first_cfg(Register Eq_2 ra, Register ptr32 s0, Register ui32 s1, Register ui32 a0, Register ui32 a1, Register ui32 a2, Register word32 a3, Register int32 a4, Register word32 a5, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArgA4, Register out Eq_137706 s0Out, Register out Eq_137707 s1Out, Register out ptr32 a3Out, Register out Eq_131720 a4Out, Register out ptr32 a5Out, Register out ptr32 a6Out, Register out Eq_137712 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      sec_eng_pka0_movdat
//      sec_eng_pka0_msub
//      sec_eng_pka0_mrem
//      sec_eng_pka0_mmul
//      sec_eng_pka0_mexp
//      sec_eng_pka0_lcmp
//      sec_eng_pka0_lsub
//      sec_eng_pka0_lmul
//      sec_eng_pka0_lmul2n
Eq_2 pka0_write_common_op_first_cfg(Eq_2 ra, ptr32 s0, ui32 s1, ui32 a0, ui32 a1, ui32 a2, word32 a3, int32 a4, word32 a5, ui32 s2, ui32 s3, Eq_2 dwArgA4, union Eq_137706 & s0Out, union Eq_137707 & s1Out, ptr32 & a3Out, union Eq_131720 & a4Out, ptr32 & a5Out, ptr32 & a6Out, union Eq_137712 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	<anonymous> * a4_9 = g_ptr4200F3D4;
	ui32 s1_34;
	ptr32 s3_36;
	Eq_2 ra_39;
	ui32 a5_41;
	Eq_137712 s2_106;
	a4_9();
	Eq_137707 s1_53 = (s1_34 & 0x0F) << 8;
	ui32 a4_56 = 0x19;
	if (dwArgA4 != 0x19)
	{
		s2_106 <<= 0x0C;
		a4_56 = ~0x00F00000;
	}
	Eq_137706 s0_78 = (dwArgA4 & 0x007F) << 24;
	Eq_131720 a4_86 = (word32) (word31) (a4_56 & ~0x7F000000 | s0_78) | a5_41 << 31;
	*(union Eq_131720 *) 0x40004340 = a4_86;
	s0Out = s0_78;
	s1Out = s1_53;
	a3Out = ~0x7F000000;
	a4Out = a4_86;
	a5Out = 0x40004000;
	a6Out = dwArg0118;
	s2Out = s2_106;
	s3Out = s3_36;
	s4Out = dwArgF4;
	return ra_39;
}

// 2302C5B2: Register Eq_2 pka0_write_common_op_snd_cfg_S1(Register Eq_2 ra, Register ptr32 s0, Register word32 s1, Register word32 a0, Register ptr32 a1, Register out Eq_137760 s0Out, Register out Eq_137761 s1Out, Register out ptr32 s4Out)
// Called from:
//      sec_eng_pka0_lcmp
//      sec_eng_pka0_lsub
//      sec_eng_pka0_lmul
Eq_2 pka0_write_common_op_snd_cfg_S1(Eq_2 ra, ptr32 s0, word32 s1, word32 a0, ptr32 a1, union Eq_137760 & s0Out, union Eq_137761 & s1Out, ptr32 & s4Out)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	ui32 s0_22;
	ui32 s1_23;
	Eq_2 ra_24;
	ui32 a1_26;
	a5_5();
	Eq_137760 s0_40 = (s0_22 & 0x0F) << 20;
	*(union Eq_131720 *) 0x40004340 = (a1_26 & ~0x000FF000 | s1_23 << 0x0C) & ~0x00F00000 | s0_40;
	s0Out = s0_40;
	s1Out = s1_23 << 0x0C;
	s4Out = dwArg04;
	return ra_24;
}

// 2302C5FC: Register Eq_2 pka0_write_common_op_snd_cfg_S1_S2(Register Eq_2 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a1, Register word32 a2, Register word32 a3, Register word32 s2, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out Eq_137797 s1Out, Register out ptr32 s2Out)
// Called from:
//      sec_eng_pka0_msub
//      sec_eng_pka0_mmul
//      sec_eng_pka0_mexp
Eq_2 pka0_write_common_op_snd_cfg_S1_S2(Eq_2 ra, word32 s0, word32 s1, word32 a0, word32 a1, word32 a2, word32 a3, word32 s2, word32 dwArg0128, ptr32 & s0Out, union Eq_137797 & s1Out, ptr32 & s2Out)
{
	<anonymous> * a5_5 = g_ptr4200F3D4;
	ui32 s1_29;
	ptr32 s2_30;
	Eq_2 ra_31;
	ui32 a3_35;
	a5_5();
	*(union Eq_131720 *) 0x40004340 = a3_35 & 0x0F & 0xFF0000FF | (a3_35 & 0x0F) << 0x08;
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_29 << 0x0C;
	s2Out = s2_30;
	return ra_31;
}

// 2302C668: void sec_eng_pka0_reset()
// Called from:
//      ecc_gen_new_public_key
void sec_eng_pka0_reset()
{
	((union Eq_137820 *) 0x40004300)->u0 = 0x00;
	((union Eq_137820 *) 0x40004300)->u0 = 0x08;
}

// 2302C678: Register ui32 sec_eng_pka0_clear_int()
// Called from:
//      pka_point_addition.constprop.3
//      GF2Mont.constprop.8
//      pka_point_double.constprop.2
//      ecc_multiplication_event_handler
//      sec_eng_pka0_read_data
//      sec_eng_pka0_movdat
//      sec_eng_pka0_lcmp
ui32 sec_eng_pka0_clear_int()
{
	*(union Eq_137820 *) 0x40004300 |= 0x0200;
	Eq_137820 a4_8 = *(union Eq_137820 *) 0x40004300;
	*(union Eq_137820 *) 0x40004300 = a4_8 & -513;
	return a4_8 & -513;
}

// 2302C696: void sec_eng_pka0_pld(Register int32 a0, Register Eq_2 a1, Register ui32 a2, Register ui32 a3, Register int32 a4, Register ui32 a5)
// Called from:
//      Mont2GF
//      GF2Mont.constprop.8
//      pka_addition_win.constprop.1
//      ecc_multiplication_event_handler
//      ecc_gen_new_public_key
void sec_eng_pka0_pld(int32 a0, Eq_2 a1, ui32 a2, ui32 a3, int32 a4, ui32 a5)
{
	*(union Eq_131720 *) 0x40004340 = (word32) (word12) a0 | a2 << 0x0C | (a3 & 0x0F) << 20 | (a4 & 0x007F) << 24 | a5 << 31;
	int32 a4_22;
	for (a4_22 = 0x00; a4_22 < a0; ++a4_22)
	{
		ui32 a5_37;
		ui32 a5_29 = a4_22 & 7;
		ui32 * a2_34 = *((word32) a1 + a4_22 * 0x04);
		if ((a0 & 7) == 0x00)
			a5_37 = (a5_29 << 2) + 0x40004360;
		else
			a5_37 = (a5_29 << 2) + 0x40004340;
		*a2_34 = a5_37;
	}
}

// 2302C6F6: void sec_eng_pka0_wait_4_isr()
// Called from:
//      pka_point_addition.constprop.3
//      GF2Mont.constprop.8
//      pka_point_double.constprop.2
//      ecc_multiplication_event_handler
//      sec_eng_pka0_read_data
//      sec_eng_pka0_movdat
//      sec_eng_pka0_lcmp
void sec_eng_pka0_wait_4_isr()
{
	Eq_137820 a5_11 = *(union Eq_137820 *) 0x40004300;
	while ((a5_11 & 0x0100) == 0x00)
		a5_11 = *(union Eq_137820 *) 0x40004300;
}

// 2302C710: Register Eq_2 sec_eng_pka0_read_data(Register Eq_2 ra, Register ui32 a0, Register ui32 a1, Register Eq_132314 a2, Register Eq_132310 a3, Stack word32 dwArg0128, Register out ptr32 tpOut, Register out ptr32 s0Out, Register out Eq_132314 s1Out, Register out Eq_132310 a4Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out Eq_132310 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_132361) s6Out, Register out ptr32 s8Out)
// Called from:
//      pka_read_result.constprop.4
//      GF2Mont.constprop.8
//      ecc_multiplication_event_handler
Eq_2 sec_eng_pka0_read_data(Eq_2 ra, ui32 a0, ui32 a1, Eq_132314 a2, Eq_132310 a3, word32 dwArg0128, ptr32 & tpOut, ptr32 & s0Out, union Eq_132314 & s1Out, union Eq_132310 & a4Out, ptr32 & a6Out, ptr32 & s2Out, union Eq_132310 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_132361 & s6Out, ptr32 & s8Out)
{
	uint32 a5_5 = a0 + -1 & 0x00FF;
	ui32 a4_13 = 0x00;
	if (a5_5 <= 0x09)
		a4_13 = (word32) g_a230B57D0[a5_5 * 0x02];
	Eq_132310 a4_15 = a4_13 & 0x00FF;
	if (a4_15 < a3)
	{
		tpOut = tp;
		s0Out = s0;
		s1Out = s1;
		a4Out = a4_15;
		a6Out = 0x09;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		return ra;
	}
	else
	{
		*(union Eq_131720 *) 0x40004340 = a1 << 0x0C | a3 | (a0 & 0x0F) << 20 | 0xB8000000;
		((union Eq_131720 *) 0x40004340)->u0 = 0x00;
		sec_eng_pka0_wait_4_isr();
		Eq_132310 s0_114 = a3;
		Eq_132314 s1_115 = a2;
		ptr32 s5_119 = 0x40004340;
		Eq_132310 s3_117 = 0x00;
		Eq_132310 a4_110 = sec_eng_pka0_clear_int();
		ui32 s4_118 = a3 & 7;
		ptr32 s2_116 = 0x40004360;
		struct Eq_132361 * s6_120 = &g_t4200F000;
		while (s3_117 < s0_114)
		{
			ui32 a0_73 = s3_117 & 7;
			ui32 a5_76 = (a0_73 << 2) + s2_116;
			if (s4_118 != 0x00)
				a5_76 = (a0_73 << 2) + s5_119;
			<anonymous> * a5_91 = s6_120->ptr03D0;
			word32 tp_122;
			word32 t3_123;
			word32 s8_124;
			a5_91();
		}
		0x00 = dwArg0128;
		tpOut = dwArg0104;
		s0Out = dwArgE4;
		s1Out = s1_115;
		a4Out = a4_110;
		a6Out = dwArg98;
		s2Out = s2_116;
		s3Out = s3_117;
		s4Out = dwArg78;
		s5Out = s5_119;
		s6Out = s6_120;
		s8Out = s5;
		return ra;
	}
}

// 2302C7C6: Register Eq_131720 sec_eng_pka0_clir(Register word32 a0, Register ui32 a1, Register ui32 a2, Register Eq_131720 a3)
// Called from:
//      Mont2GF
//      getFinalPoint
//      GF2Mont.constprop.8
Eq_131720 sec_eng_pka0_clir(word32 a0, ui32 a1, ui32 a2, Eq_131720 a3)
{
	Eq_131720 a3_20 = a3 | a2 << 0x0C | (a1 & 0x0F) << 20 | 0x35000000 | (word32) (a0 != 0x00) << 31;
	*(union Eq_131720 *) 0x40004340 = a3_20;
	((union Eq_131720 *) 0x40004340)->u0 = 0x00;
	sec_eng_pka0_wait_4_isr();
	sec_eng_pka0_clear_int();
	return a3_20;
}

