pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302C7FA: Register Eq_2 sec_eng_pka0_movdat(Register Eq_2 ra, Register ui32 s1, Register ptr32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArg94, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      pka_cp_x2_to_x1.constprop.5
Eq_2 sec_eng_pka0_movdat(Eq_2 ra, ui32 s1, ptr32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 s2, ui32 s3, Eq_2 dwArg94, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 s0_31;
	word32 s1_32;
	word32 s2_33;
	word32 s3_34;
	word32 s4_35;
	word32 a6_77;
	word32 a5_76;
	word32 a4_75;
	word32 a3_74;
	pka0_write_common_op_first_cfg(ra, a0, s1, a4, a3, a2, a1, 50, (word32) (a0 != 0x00), s2, s3, dwArg94, out s0_31, out s1_32, out a3_74, out a4_75, out a5_76, out a6_77, out s2_33, out s3_34, out s4_35);
	((union Eq_131720 *) 0x40004340)->u0 = 0x00;
	if (s0_31 == 0x00)
		return;
	sec_eng_pka0_wait_4_isr();
	sec_eng_pka0_clear_int();
	return;
}

// 2302C836: Register Eq_2 sec_eng_pka0_msub(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ptr32 a5, Register word32 a7, Register ui32 s2, Register ui32 s3, Stack Eq_131977 bArg00, Stack word32 dwArg08, Stack Eq_2 dwArg84, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      pka_point_addition.constprop.3
//      pka_point_double.constprop.2
Eq_2 sec_eng_pka0_msub(Eq_2 ra, word32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ptr32 a5, word32 a7, ui32 s2, ui32 s3, Eq_131977 bArg00, word32 dwArg08, Eq_2 dwArg84, word32 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_131977 bArg00 = (byte) dwArg00;
	word32 a6_37;
	word32 s1_40;
	word32 s2_41;
	ptr32 s3_42;
	word32 s0_86;
	word32 a3_87;
	word32 a4_88;
	word32 a5_89;
	word32 s4_90;
	Eq_2 ra_38 = pka0_write_common_op_first_cfg(ra, a5, (word32) bArg00, a4, a3, a2, a1, 39, (word32) (a0 != 0x00), s2, s3, dwArg84, out s0_86, out s1_40, out a3_87, out a4_88, out a5_89, out a6_37, out s2_41, out s3_42, out s4_90);
	ptr32 s0_63;
	ptr32 s1_64;
	ptr32 s2_65;
	Eq_2 ra_62 = pka0_write_common_op_snd_cfg_S1_S2(ra_38, dwArg08, s1_40, a6_37, dwArg08, s1_40, a7, s2_41, dwArg0128, out s0_63, out s1_64, out s2_65);
	s0Out = s0_63;
	s1Out = s1_64;
	s2Out = s2_65;
	s3Out = s3_42;
	return ra_62;
}

// 2302C876: Register Eq_2 sec_eng_pka0_mrem(Register Eq_2 ra, Register ui32 s1, Register word32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ptr32 a5, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArg74, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      Mont2GF
//      getFinalPoint
//      GF2Mont.constprop.8
Eq_2 sec_eng_pka0_mrem(Eq_2 ra, ui32 s1, word32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ptr32 a5, ui32 s2, ui32 s3, Eq_2 dwArg74, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 a3_30;
	word32 a4_31;
	word32 a6_33;
	word32 s0_35;
	word32 s1_36;
	word32 s2_37;
	word32 s3_38;
	word32 a5_94;
	word32 s4_95;
	Eq_2 ra_34 = pka0_write_common_op_first_cfg(ra, a5, s1, a4, a3, a2, a1, 38, (word32) (a0 != 0x00), s2, s3, dwArg74, out s0_35, out s1_36, out a3_30, out a4_31, out a5_94, out a6_33, out s2_37, out s3_38, out s4_95);
	<anonymous> * a5_43 = g_ptr4200F3D4;
	ui32 s0_52;
	ui32 a5_54;
	Eq_2 ra_56;
	ptr32 s1_60;
	ptr32 s2_61;
	ptr32 s3_62;
	ptr32 s4_63;
	a5_43();
	*(union Eq_131720 *) 0x40004340 = a5_54 & 0xFF0000FF | (s0_52 & 0x0F) << 8;
	s0Out = dwArgE4;
	s1Out = s1_60;
	s2Out = s2_61;
	s3Out = s3_62;
	s4Out = s4_63;
	return ra_56;
}

// 2302C8CC: Register Eq_2 sec_eng_pka0_mmul(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ptr32 a5, Register word32 a7, Register ui32 s2, Register ui32 s3, Stack Eq_131997 bArg00, Stack word32 dwArg08, Stack Eq_2 dwArg84, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      pka_point_addition.constprop.3
//      pka_point_double.constprop.2
Eq_2 sec_eng_pka0_mmul(Eq_2 ra, word32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ptr32 a5, word32 a7, ui32 s2, ui32 s3, Eq_131997 bArg00, word32 dwArg08, Eq_2 dwArg84, word32 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_131997 bArg00 = (byte) dwArg00;
	word32 a6_37;
	word32 s1_40;
	word32 s2_41;
	ptr32 s3_42;
	word32 s0_86;
	word32 a3_87;
	word32 a4_88;
	word32 a5_89;
	word32 s4_90;
	Eq_2 ra_38 = pka0_write_common_op_first_cfg(ra, a5, (word32) bArg00, a4, a3, a2, a1, 37, (word32) (a0 != 0x00), s2, s3, dwArg84, out s0_86, out s1_40, out a3_87, out a4_88, out a5_89, out a6_37, out s2_41, out s3_42, out s4_90);
	ptr32 s0_63;
	ptr32 s1_64;
	ptr32 s2_65;
	Eq_2 ra_62 = pka0_write_common_op_snd_cfg_S1_S2(ra_38, dwArg08, s1_40, a6_37, dwArg08, s1_40, a7, s2_41, dwArg0128, out s0_63, out s1_64, out s2_65);
	s0Out = s0_63;
	s1Out = s1_64;
	s2Out = s2_65;
	s3Out = s3_42;
	return ra_62;
}

// 2302C90C: Register Eq_2 sec_eng_pka0_mexp(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ptr32 a5, Register word32 a7, Register ui32 s2, Register ui32 s3, Stack Eq_133693 bArg00, Stack word32 dwArg08, Stack Eq_2 dwArg84, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      ecc_multiplication_event_handler
Eq_2 sec_eng_pka0_mexp(Eq_2 ra, word32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ptr32 a5, word32 a7, ui32 s2, ui32 s3, Eq_133693 bArg00, word32 dwArg08, Eq_2 dwArg84, word32 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_133693 bArg00 = (byte) dwArg00;
	word32 a6_37;
	word32 s1_40;
	word32 s2_41;
	ptr32 s3_42;
	word32 s0_86;
	word32 a3_87;
	word32 a4_88;
	word32 a5_89;
	word32 s4_90;
	Eq_2 ra_38 = pka0_write_common_op_first_cfg(ra, a5, (word32) bArg00, a4, a3, a2, a1, 35, (word32) (a0 != 0x00), s2, s3, dwArg84, out s0_86, out s1_40, out a3_87, out a4_88, out a5_89, out a6_37, out s2_41, out s3_42, out s4_90);
	ptr32 s0_63;
	ptr32 s1_64;
	ptr32 s2_65;
	Eq_2 ra_62 = pka0_write_common_op_snd_cfg_S1_S2(ra_38, dwArg08, s1_40, a6_37, dwArg08, s1_40, a7, s2_41, dwArg0128, out s0_63, out s1_64, out s2_65);
	s0Out = s0_63;
	s1Out = s1_64;
	s2Out = s2_65;
	s3Out = s3_42;
	return ra_62;
}

// 2302C94C: Register Eq_2 sec_eng_pka0_lcmp(Register Eq_2 ra, Register ptr32 a0, Register ui32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ui32 s3, Stack word32 dwArg38, Stack Eq_2 dwArg94, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      pka_point_inf_check.constprop.7
Eq_2 sec_eng_pka0_lcmp(Eq_2 ra, ptr32 a0, ui32 a1, ui32 a2, ui32 a3, ui32 a4, ui32 s3, word32 dwArg38, Eq_2 dwArg94, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 s0_34;
	word32 s1_35;
	ptr32 s2_36;
	ptr32 s3_37;
	byte * s0_48;
	ptr32 s1_49;
	ptr32 s4_50;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 a6_81;
	word32 s4_82;
	Eq_2 ra_47 = pka0_write_common_op_snd_cfg_S1(pka0_write_common_op_first_cfg(ra, a0, a4, a2, a1, 0x00, 0x00, 0x19, 0x01, a3, s3, dwArg94, out s0_34, out s1_35, out a3_78, out a4_79, out a5_80, out a6_81, out s2_36, out s3_37, out s4_82), s0_34, s1_35, s1_35, s2_36, out s0_48, out s1_49, out s4_50);
	sec_eng_pka0_wait_4_isr();
	sec_eng_pka0_clear_int();
	*s0_48 = (byte) (*(union Eq_137820 *) 0x40004300 >> 24 & 0x01);
	0x00 = dwArg38;
	s1Out = s1_49;
	s2Out = s2_36;
	s3Out = s3_37;
	s4Out = s4_50;
	return ra_47;
}

// 2302C996: Register Eq_2 sec_eng_pka0_lsub(Register Eq_2 ra, Register ui32 s1, Register word32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ptr32 a5, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArg84, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      ecc_multiplication_event_handler
Eq_2 sec_eng_pka0_lsub(Eq_2 ra, ui32 s1, word32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ptr32 a5, ui32 s2, ui32 s3, Eq_2 dwArg84, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a6_33;
	ptr32 s0_35;
	word32 s1_36;
	ptr32 s2_37;
	ptr32 s3_38;
	word32 a3_67;
	word32 a4_68;
	word32 a5_69;
	word32 s4_70;
	Eq_2 ra_34 = pka0_write_common_op_first_cfg(ra, a5, s1, a4, a3, a2, a1, 0x17, (word32) (a0 != 0x00), s2, s3, dwArg84, out s0_35, out s1_36, out a3_67, out a4_68, out a5_69, out a6_33, out s2_37, out s3_38, out s4_70);
	word32 s0_71;
	word32 s1_72;
	word32 s4_73;
	Eq_2 ra_52 = pka0_write_common_op_snd_cfg_S1(ra_34, s0_35, s1_36, a6_33, s0_35, out s0_71, out s1_72, out s4_73);
	s2Out = s2_37;
	s3Out = s3_38;
	return ra_52;
}

// 2302C9C4: Register Eq_2 sec_eng_pka0_lmul(Register Eq_2 ra, Register ui32 s1, Register word32 a0, Register word32 a1, Register ui32 a2, Register ui32 a3, Register ui32 a4, Register ptr32 a5, Register ui32 s2, Register ui32 s3, Stack Eq_2 dwArg84, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      Mont2GF
//      getFinalPoint
Eq_2 sec_eng_pka0_lmul(Eq_2 ra, ui32 s1, word32 a0, word32 a1, ui32 a2, ui32 a3, ui32 a4, ptr32 a5, ui32 s2, ui32 s3, Eq_2 dwArg84, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a6_33;
	ptr32 s0_35;
	word32 s1_36;
	ptr32 s2_37;
	ptr32 s3_38;
	word32 a3_69;
	word32 a4_70;
	word32 a5_71;
	word32 s4_72;
	Eq_2 ra_34 = pka0_write_common_op_first_cfg(ra, a5, s1, a4, a3, a2, a1, 22, (word32) (a0 != 0x00), s2, s3, dwArg84, out s0_35, out s1_36, out a3_69, out a4_70, out a5_71, out a6_33, out s2_37, out s3_38, out s4_72);
	ptr32 s0_53;
	ptr32 s1_54;
	word32 s4_73;
	Eq_2 ra_52 = pka0_write_common_op_snd_cfg_S1(ra_34, s0_35, s1_36, a6_33, s0_35, out s0_53, out s1_54, out s4_73);
	s0Out = s0_53;
	s1Out = s1_54;
	s2Out = s2_37;
	s3Out = s3_38;
	return ra_52;
}

// 2302C9F2: Register Eq_2 sec_eng_pka0_lmul2n(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a1, Register word32 a2, Register word32 a3, Register word32 a4, Register int32 a5, Register word32 s2, Register word32 s3, Register Eq_2 s4, Stack Eq_2 dwArg74, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      GF2Mont.constprop.8
Eq_2 sec_eng_pka0_lmul2n(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a1, word32 a2, word32 a3, word32 a4, int32 a5, word32 s2, word32 s3, Eq_2 s4, Eq_2 dwArg74, word32 dwArg0128, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	<anonymous> * a5_9 = g_ptr4200F3D4;
	ptr32 s0_32;
	Eq_2 ra_34;
	ui32 s1_35;
	ui32 s2_36;
	ui32 s3_37;
	word32 s4_38;
	a5_9();
	ui32 a5_58;
	word32 s0_61;
	ptr32 s1_62;
	ptr32 s2_63;
	ptr32 s3_64;
	word32 a3_101;
	word32 a4_102;
	word32 a6_103;
	word32 s4_104;
	Eq_2 ra_60 = pka0_write_common_op_first_cfg(ra_34, s0_32, s1_35, s1_35, s2_36, s3_37, s4_38, 0x13, 0x00, s2_36, s3_37, dwArg74, out s0_61, out s1_62, out a3_101, out a4_102, out a5_58, out a6_103, out s2_63, out s3_64, out s4_104);
	*(union Eq_131720 *) 0x40004340 = a5_58 & 0xF8000000 | (word32) ((word15) s0_61);
	0x00 = dwArg0128;
	s1Out = s1_62;
	s2Out = s2_63;
	s3Out = s3_64;
	return ra_60;
}

// 2302CA50: Register Eq_2 em_buf_init(Register Eq_2 ra, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_128029 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_128033) s5Out)
// Called from:
//      rwble_init
//      rwble_reset
Eq_2 em_buf_init(Eq_2 ra, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, union Eq_128029 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_128033 & s5Out)
{
	g_b42026424 = 0x00;
	word32 a0_304;
	word32 a1_307;
	word32 a1_305;
	word32 a0_306;
	Eq_2 ra_115 = ble_co_list_init(ble_co_list_init(ra, 0x420262C8, &g_dw420262C8, out a0_304, out a1_305), 0x420262C8, &g_dw420262D0, out a0_306, out a1_307);
	g_dw42026420 = 671122122;
	struct Eq_128033 * s5_106 = &g_dw420262C8;
	struct Eq_138381 * a3_42 = g_a420262DC;
	struct Eq_138383 * a5_43 = (struct Eq_138383 *) 671122126;
	Eq_2 s1_121 = 0x00;
	do
	{
		uint32 a4_50 = s1_121 << 0x10;
		a3_42->w0000 = (word16) (a4_50 >> 16);
		++a5_43;
		a5_43->w0FF6 = (word16) (word32) (word16) ((a4_50 >> 16) + 0x0464);
		a5_43[0x0199] = (struct Eq_138383) 0x00;
		a5_43->w0FF8 = 0x00;
		a5_43->w0FF4 = (word16) (word32) (word16) ((word32) (word16) (word32) a5_43->wFFFFFFF4 & -33);
		a5_43->w0FF4 = (word16) (word32) (word16) ((word32) (word16) (word32) a5_43->wFFFFFFF4 & -33);
		a5_43->w0FF2 = 0x00;
		s1_121 = (word32) s1_121 + 1;
		++a3_42;
	} while (s1_121 != 0x06);
	Eq_2 s0_123 = 0x2800830A;
	do
	{
		s5_106->w005C = (word16) s1_121;
		*s0_123 = 0x00;
		*((word32) s0_123 + 4) = 0x00;
		*((word32) s0_123 + 2) = 0x00;
		*((word32) s0_123 + 0x0FFE) = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) s0_123 - 2) & -33);
		*((word32) s0_123 + 0x0FFE) = (word16) (word32) (word16) ((word32) (word16) (word32) *((word32) s0_123 - 2) & -33);
		*((word32) s0_123 + 0x0FFC) = 0x00;
		++s5_106;
		word32 a0_308;
		word32 a5_309;
		ra_115 = ble_co_list_push_back(ra_115, s0_123, (word32) s1_121 + 1, 0x420262C8, (char *) s5_106 + 88, out s1_121, out a0_308, out a5_309);
		s0_123 = (word32) s0_123 + 0x0A;
	} while (s1_121 != 0x1A);
	g_dw42026414 = 0x05220000;
	Eq_2 s1_139;
	word32 a5_311;
	word32 a0_310;
	Eq_2 ra_138 = ble_co_list_push_back(ra_115, s0_123, s1_121, 0x420262D0, 0x42026410, out s1_139, out a0_310, out a5_311);
	g_dw4202641C = 0x06260001;
	ptr32 s1_152;
	word32 a5_313;
	word32 a0_312;
	Eq_2 ra_151 = ble_co_list_push_back(ra_138, s0_123, s1_139, 0x420262D0, 0x42026418, out s1_152, out a0_312, out a5_313);
	struct Eq_138549 * a5_155 = (struct Eq_138549 *) 0x280083D6;
	ui32 a3_156 = 0x00;
	do
	{
		++a3_156;
		++a5_155;
		a5_155->w0FF2 = (word16) (word32) (word16) (a3_156 + 0x072A);
		a5_155[291] = (struct Eq_138549) (word16) ((a3_156 & 7) + 988);
		a5_155->w0FF6 = 0x00;
		a5_155->w0FEE = (word16) (word32) (word16) ((word32) (word16) (word32) a5_155->wFFFFFFEE & -33);
		a5_155->w0FEE = (word16) (word32) (word16) ((word32) (word16) (word32) a5_155->wFFFFFFEE & -33);
	} while (a3_156 != 0x08);
	struct Eq_138607 * a5_193 = (struct Eq_138607 *) 0x2800809E;
	do
	{
		++a5_193;
		a5_193->w0FA4 = (word16) ((word32) a5_193->w0000 & ~0x04000000);
		uint32 a4_207 = ((word32) (word16) (word32) a5_193->wFFFFFFB6 & -769) << 16;
		a5_193->w0FB6 = (word16) (a4_207 >> 16);
		a5_193->w0FEE = 0x00;
	} while (a5_193 != (struct Eq_138607 *) 0x2800820E);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_152;
	a4Out = a4_207 >> 16;
	s2Out = 0x42026000;
	s3Out = 0x42026000;
	s4Out = dwArg78;
	s5Out = s5_106;
	return ra_151;
}

