pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302CC48: void em_buf_rx_free(Register Eq_2 a0)
// Called from:
//      lld_pdu_rx_handler
//      llm_pdu_defer
//      llc_data_ind_handler
//      bt_onchiphci_hanlde_rx_acl
void em_buf_rx_free(Eq_2 a0)
{
	((word32) a0 + 0x280083DC)->u2 = (word16) (word32) (word15) (word32) *((word32) a0 + 0x280083DC);
}

// 2302CC66: Register (ptr32 Eq_138660) em_buf_rx_buff_addr_get(Register (ptr32 Eq_138660) a0)
// Called from:
//      hci_build_acl_rx_data
struct Eq_138660 * em_buf_rx_buff_addr_get(struct Eq_138660 * a0)
{
	return (word32) a0->w280083E4 + 0x28008000;
}

// 2302CC7E: Register Eq_2 em_buf_tx_free(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Register out Eq_2 s0Out, Register out (ptr32 Eq_138671) s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_138673) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_138675) s3Out, Register out Eq_138676 s4Out)
// Called from:
//      lld_evt_deffered_elt_handler
//      lld_pdu_tx_flush_list
//      lld_pdu_check
Eq_2 em_buf_tx_free(Eq_2 ra, Eq_2 a0, ptr32 mstatus, union Eq_2 & s0Out, struct Eq_138671 & s1Out, ptr32 & a0Out, struct Eq_138673 & a5Out, ptr32 & s2Out, struct Eq_138675 & s3Out, union Eq_138676 & s4Out)
{
	ui32 a1_24 = (word32) (word16) (word32) ((uint16[]) 0x280082DC)[(word32) *((word32) a0 + 4) / 2];
	Eq_2 s1_26 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	ptr32 s2_31 = 0x00;
	if ((int32) (word16) a1_24 < 0x00)
	{
		word32 a0_111;
		word32 a5_112;
		ra = ble_co_list_push_back(ra, a0, s1_26, 0x420262D0, ((a1_24 & 0x00FF) + 41 << 3) + 0x420262C8, out s1_26, out a0_111, out a5_112);
		s2_31 = 0x01;
	}
	((word16[]) 0x280082D6)[(word32) *((word32) a0 + 4) / 2] = 0x00;
	((word16[]) 0x280082DC)[(word32) *((word32) a0 + 4) / 2] = 0x00;
	((word16[]) 0x280082D8)[(word32) *((word32) a0 + 4) / 2] = 0x00;
	struct Eq_138673 * a5_74;
	struct Eq_138671 * s1_76;
	word32 a0_110;
	Eq_2 ra_75 = ble_co_list_push_back(ra, a0, s1_26, 0x420262C8, a0, out s1_76, out a0_110, out a5_74);
	__csrrw(mstatus, 0x00);
	s0Out = a0;
	s1Out = s1_76;
	a0Out = s2_31;
	a5Out = a5_74;
	s2Out = s2_31;
	s3Out = (struct Eq_138675 *) &g_dw42026000;
	s4Out = dwArg04;
	return ra_75;
}

// 2302CD38: Register Eq_2 llc_init(Register Eq_2 ra, Register word32 s0, Register word32 s1, Stack word32 dwArg10, Stack Eq_2 dwArgF8, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      rwble_init
Eq_2 llc_init(Eq_2 ra, word32 s0, word32 s1, word32 dwArg10, Eq_2 dwArgF8, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	word32 s0_19;
	word32 s1_20;
	word32 s1_35;
	word32 s0_43;
	word32 s1_55;
	word32 s0_63;
	Eq_2 ra_75;
	ptr32 a5_76;
	ptr32 s4_84;
	ptr32 s2_88;
	g_ptr4200F3D4();
	a5Out = a5_76;
	s2Out = s2_88;
	s4Out = s4_84;
	return ra_75;
}

// 2302CD7A: Register Eq_2 llc_stop(Register Eq_2 ra, Register Eq_2 s1, Register ui32 a0, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_138776) a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llc_reset
//      lld_stop_ind_handler
Eq_2 llc_stop(Eq_2 ra, Eq_2 s1, ui32 a0, Eq_2 dwArgE8, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & s1Out, struct Eq_138776 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_138776 ** a4_30;
	ptr32 s1_35;
	ptr32 s2_36;
	word32 s0_43;
	word32 a2_210;
	word32 a5_211;
	word32 s4_212;
	word32 mstatus_213;
	Eq_2 a0_26;
	Eq_2 s3_37;
	Eq_2 ra_34 = ble_ke_state_set(ra, 0x42026000, s1, (word32) (word16) (a0 << 8 | 1), 0x007F, dwArgE8, out s0_43, out s1_35, out a0_26, out a2_210, out a4_30, out a5_211, out s2_36, out s3_37, out s4_212, out mstatus_213);
	Eq_2 s4_45 = s3_37 << 0x02;
	struct Eq_138776 * a5_148 = *a4_30;
	if (a4_30 == null)
	{
		s0Out.u0 = <invalid>;
		s1Out = s1_35;
		a5Out = a5_148;
		s2Out = s2_36;
		s4Out = dwArg04;
		s5Out = s5;
		return ra_34;
	}
	else
	{
		Eq_2 s0_149 = s0_43 + 0x0428;
		Eq_2 s2_56 = 0x00;
		Eq_2 s5_58 = 0x04;
		do
		{
			Eq_2 s1_61 = a5_148->dw0000;
			a5_148 = (struct Eq_138776 *) *a0_26;
			if (a0_26 != 0x00)
			{
				word32 tp_214;
				word32 a2_215;
				word32 a3_216;
				word32 a4_217;
				word32 mstatus_218;
				ra_34 = ble_ke_msg_free(ra_34, s0_149, s1_61, (word32) a0_26 - 0x0C, s2_56, s3_37, s4_45, s5_58, out tp_214, out s0_149, out s1_61, out a0_26, out a2_215, out a3_216, out a4_217, out a5_148, out s2_56, out s3_37, out s4_45, out s5_58, out mstatus_218);
			}
			s2_56 = (word32) s2_56 + 1;
		} while (s2_56 != s5_58);
		word32 * s0_109;
		Eq_2 s1_110;
		Eq_2 s2_111;
		Eq_2 s3_112;
		Eq_2 s5_114;
		word32 tp_219;
		word32 a0_220;
		word32 a1_221;
		word32 a2_222;
		word32 a3_223;
		word32 a4_224;
		word32 a5_225;
		word32 a6_226;
		word32 s4_227;
		word32 s8_228;
		word32 mstatus_229;
		Eq_2 ra_108 = ble_ke_free(ra_34, *a0_26, s1_61, a0_26, s2_56, s3_37, s4_45, s5_58, out tp_219, out s0_109, out s1_110, out a0_220, out a1_221, out a2_222, out a3_223, out a4_224, out a5_225, out a6_226, out s2_111, out s3_112, out s4_227, out s5_114, out s8_228, out mstatus_229);
		*s0_109 = 0x00;
		struct Eq_138776 * a5_135;
		ptr32 s1_139;
		ptr32 s2_140;
		ptr32 s4_142;
		ptr32 s5_143;
		Eq_2 ra_138 = llm_util_bl_rem(ra_108, s1_110, s3_112, s2_111, s3_112, s5_114, dwArg0108, out s1_139, out a5_135, out s2_140, out s4_142, out s5_143);
		s0Out.u0 = <invalid>;
		s1Out = s1_139;
		a5Out = a5_135;
		s2Out = s2_140;
		s4Out = s4_142;
		s5Out = s5_143;
		return ra_138;
	}
}

// 2302CE06: Register Eq_2 llc_reset(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_128123 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      rwble_reset
Eq_2 llc_reset(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_128123 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out)
{
	int32 a0_8;
	word32 a1_133;
	word32 a4_134;
	word32 s8_135;
	Eq_2 s0_13;
	Eq_2 ra_12 = ble_ke_state_get(ra, s0, 0x01, out s0_13, out a0_8, out a1_133, out a4_134, out s8_135);
	if (a0_8 != 0x007F)
	{
		word32 a5_140;
		ra_12 = llc_stop(ra_12, s1, 0x00, dwArgD8, dwArgF8, out s0_13, out s1, out a5_140, out s2, out s4, out s5);
	}
	int32 a0_42;
	word32 s0_136;
	word32 a1_137;
	word32 a4_138;
	word32 s8_139;
	Eq_2 ra_46 = ble_ke_state_get(ra_12, s0_13, 0x0101, out s0_136, out a0_42, out a1_137, out a4_138, out s8_139);
	if (a0_42 == 0x007F)
	{
		a5Out.u0 = 0x007F;
		s2Out = s2;
		s4Out = s4;
		s5Out = s5;
		return ra_46;
	}
	else
	{
		Eq_128123 a5_64;
		ptr32 s2_70;
		ptr32 s4_72;
		ptr32 s5_77;
		word32 s0_141;
		word32 s1_142;
		Eq_2 ra_67 = llc_stop(ra_46, s1, 0x01, dwArgE8, dwArg0108, out s0_141, out s1_142, out a5_64, out s2_70, out s4_72, out s5_77);
		a5Out = a5_64;
		s2Out = s2_70;
		s4Out = s4_72;
		s5Out = s5_77;
		return ra_67;
	}
}

// 2302CE3E: void llc_discon_event_complete_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118)
// Called from:
//      lld_stop_ind_handler
void llc_discon_event_complete_send(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a0_24;
	word32 s0_34;
	word32 s1_35;
	Eq_2 s2_36;
	Eq_2 s3_37;
	Eq_2 s4_38;
	word32 a1_86;
	word32 a2_87;
	word32 a3_88;
	word32 a4_89;
	word32 a6_90;
	word32 a7_91;
	word32 s8_92;
	word32 mstatus_93;
	Eq_2 ra_33 = ble_ke_msg_alloc(ra, a2, a3, 0x00FFF803, a2, 0x05, 0x06, a1, s3, dwArg0118, out s0_34, out s1_35, out a0_24, out a1_86, out a2_87, out a3_88, out a4_89, out a6_90, out a7_91, out s2_36, out s3_37, out s4_38, out s8_92, out mstatus_93);
	*a0_24 = (byte) s2_36;
	*((word32) a0_24 + 4) = (byte) s1_35;
	*((word32) a0_24 + 2) = (word16) s0_34;
	0x00 = (int8) dwArg38;
	word32 tp_94;
	word32 s0_95;
	word32 s1_96;
	word32 a0_97;
	word32 a2_98;
	word32 a3_99;
	word32 a4_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s7_106;
	word32 s9_107;
	word32 s10_108;
	word32 mstatus_109;
	hci_send_2_host(ra_33, s0, a0_24, s2_36, s3_37, s4_38, s5, dwArg10, dwArg14, dwArg38, out tp_94, out s0_95, out s1_96, out a0_97, out a2_98, out a3_99, out a4_100, out s2_101, out s3_102, out s4_103, out s5_104, out s6_105, out s7_106, out s9_107, out s10_108, out mstatus_109);
}

// 2302CE78: Register Eq_2 llc_le_con_cmp_evt_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Stack word32 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack word32 dwArg28, Stack Eq_2 dwArg38, Stack Eq_139126 dwArg48, Stack word32 dwArg88, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_start
//      llm_end_evt_defer
//      lld_stop_ind_handler
Eq_2 llc_le_con_cmp_evt_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, word32 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, word32 dwArg28, Eq_2 dwArg38, Eq_139126 dwArg48, word32 dwArg88, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	if (llm_util_check_evt_mask(0x00) == 0x00)
	{
		ptr32 a0_29 = llm_util_check_evt_mask(0x09);
		if (a0_29 == 0x00)
		{
			s0Out = s1;
			s1Out = a2;
			a0Out = a0_29;
			s2Out = a0;
			s3Out = a1;
			s4Out = dwArg04;
			s5Out = s5;
			mstatusOut = mstatus;
			return ra;
		}
	}
	Eq_2 s3_125;
	Eq_2 s2_122;
	Eq_2 ra_126;
	Eq_2 s0_127;
	word32 s4_128;
	struct Eq_139155 * s1_124;
	ptr32 a1_144;
	word16 * a0_145;
	<anonymous> * a5_142;
	if (llm_util_check_evt_mask(0x09) == 0x00)
	{
		Eq_2 a0_412;
		word32 a6_966;
		word32 s8_968;
		word32 mstatus_969;
		word32 a7_967;
		word32 a4_965;
		word32 s0_961;
		word32 a1_962;
		word32 a3_964;
		word32 a2_963;
		ra_126 = ble_ke_msg_alloc(ra, s0, a2, 0x00FFF804, a1, 0x00, 0x14, a0, a1, dwArg0108, out s0_961, out s1_124, out a0_412, out a1_962, out a2_963, out a3_964, out a4_965, out a6_966, out a7_967, out s2_122, out s3_125, out s4_128, out s8_968, out mstatus_969);
		*a0_412 = 0x01;
		*((word32) a0_412 + 1) = (byte) s2_122;
		*((word32) a0_412 + 2) = (word16) s3_125;
		s0_127 = a0_412;
		if (s2_122 == 0x00)
		{
			struct Eq_139254 * s1_551;
			*((word32) a0_412 + 4) = (byte) (word32) (lld_get_mode(s3_125) != ~0x02);
			word32 a5_488 = (word32) s1_124->w0006;
			ptr32 s2_489 = (word32) a0_412 + 6;
			struct Eq_139274 * s3_490 = &g_t4200F000;
			if (a5_488 != 0x00)
			{
				struct Eq_139303 * a5_495 = (a5_488 + -558 >> 52 & 0x00FF) + 52;
				if (((word32) a5_495->w2800822E >> 1 & 0x01) != 0x00)
				{
					if ((word32) s1_124->b0011 == 0x00 || ((word32) a5_495->w2800822E >> 3 & 0x01) != 0x00)
					{
						((word32) a0_412 + 5)->u0 = 0x01;
						ui32 a5_578 = (word32) s1_124->w0006 + 0x12 << 16;
						word32 a3_599;
						word32 a7_606;
						word32 mstatus_607;
						word32 t1_608;
						word32 s10_820;
						word32 s11_821;
						word32 s6_822;
						word32 s7_823;
						word32 s9_824;
						word32 t0_825;
						word32 t4_826;
						g_ptr4200F3D0();
l2302CF3A:
						*((word32) s0_127 + 0x0C) = (word16) (word32) s1_551->w0000;
						*((word32) s0_127 + 0x0E) = (word16) (word32) s1_551->w0002;
						*((word32) s0_127 + 16) = (word16) (word32) s1_551->w0004;
						if ((word32) *((word32) s0_127 + 4) == 0x00)
							*((word32) s0_127 + 18) = 0x00;
						else
							*((word32) s0_127 + 18) = (byte) (word32) s1_551->b0010;
						goto l2302CF5C;
					}
					<anonymous> * a5_507 = g_ptr4200F3D4;
					word32 a3_522;
					word32 a7_529;
					word32 mstatus_530;
					word32 t1_531;
					word32 s10_794;
					word32 s11_795;
					word32 s6_796;
					word32 s7_797;
					word32 s9_798;
					word32 t0_799;
					word32 t4_800;
					a5_507();
				}
			}
			*((word32) s0_127 + 5) = (byte) ((word32) s1_124->b000E & 0x01);
			<anonymous> * a5_541 = s3_490->ptr03D0;
			word32 a3_559;
			word32 a7_566;
			word32 mstatus_567;
			word32 t1_568;
			word32 s10_807;
			word32 s11_808;
			word32 s6_809;
			word32 s7_810;
			word32 s9_811;
			word32 t0_812;
			word32 t4_813;
			a5_541();
			goto l2302CF3A;
		}
		if (s2_122 != 60)
			goto l2302CF5C;
		*((word32) a0_412 + 4) = 0x01;
		word32 a5_438 = (word32) s1_124->b000E;
		*((word32) a0_412 + 2) = 0x00;
		*((word32) a0_412 + 0x0C) = 0x00;
		*((word32) a0_412 + 5) = (byte) a5_438;
		a5_142 = g_ptr4200F3D0;
		((word32) a0_412 + 0x0E)->u2 = 0x00;
		*((word32) a0_412 + 16) = 0x00;
		a1_144 = &s1_124->w0006 + 1;
		a0_145 = (word32) a0_412 + 6;
l2302CFF4:
		word32 a3_472;
		word32 a7_479;
		word32 mstatus_480;
		word32 t1_481;
		word32 s10_787;
		word32 s11_788;
		word32 s6_789;
		word32 s7_790;
		word32 s9_791;
		word32 t0_792;
		word32 t4_793;
		a5_142();
		goto l2302CF5C;
	}
	Eq_2 a0_56;
	struct Eq_139165 * s1_67;
	word32 s4_70;
	word32 a6_957;
	word32 a7_958;
	word32 mstatus_960;
	word32 s8_959;
	word32 a1_953;
	word32 a3_955;
	word32 a4_956;
	word32 a2_954;
	word32 s0_952;
	ra_126 = ble_ke_msg_alloc(ra, s0, a2, 0x00FFF804, a1, 0x00, 32, a0, a1, dwArg0108, out s0_952, out s1_67, out a0_56, out a1_953, out a2_954, out a3_955, out a4_956, out a6_957, out a7_958, out s2_122, out s3_125, out s4_70, out s8_959, out mstatus_960);
	*a0_56 = 0x0A;
	*((word32) a0_56 + 1) = (byte) s2_122;
	*((word32) a0_56 + 2) = (word16) s3_125;
	s0_127 = a0_56;
	if (s2_122 != 0x00)
	{
		if (s2_122 != 60)
			goto l2302CF5C;
		*((word32) a0_56 + 4) = 0x01;
		word32 a5_83 = (word32) s1_67->b000E;
		*((word32) a0_56 + 2) = 0x00;
		*((word32) a0_56 + 5) = (byte) a5_83;
		<anonymous> * a5_88 = g_ptr4200F3D0;
		*((word32) a0_56 + 24) = 0x00;
		((word32) a0_56 + 26)->u0 = 0x00;
		*((word32) a0_56 + 28) = 0x00;
		word32 s2_96;
		word32 s3_99;
		word32 ra_100;
		word32 s0_101;
		word32 s4_102;
		word32 s5_103;
		a5_88();
		word32 a3_132;
		word32 a7_139;
		word32 mstatus_140;
		word32 t1_141;
		word32 s9_701;
		word32 t4_703;
		word32 t0_702;
		word32 s7_700;
		word32 s6_699;
		word32 s11_698;
		word32 s10_697;
		g_ptr4200F3D4();
		a5_142 = s1_124->ptr03D4;
		a1_144 = 0x00;
		a0_145 = (word32) s0_127 + 0x0C;
		goto l2302CFF4;
	}
	word32 s5_300;
	word32 ra_297;
	word32 s3_296;
	word32 s2_293;
	struct Eq_139496 * s4_299;
	struct Eq_139497 * s0_298;
	struct Eq_139498 * s1_295;
	word32 s5_169;
	struct Eq_139500 * s4_168;
	struct Eq_139501 * s0_167;
	word32 ra_166;
	word32 s3_165;
	struct Eq_139504 * s1_164;
	word32 a0_185;
	struct Eq_139506 * s2_162;
	<anonymous> * a5_182;
	*((word32) a0_56 + 4) = (byte) (word32) (lld_get_mode(s3_125) != ~0x02);
	word32 a1_152 = (word32) s1_67->w0006;
	if (a1_152 != 0x00)
	{
		word32 a1_205;
		<anonymous> * a5_203;
		struct Eq_139542 * s2_190 = (a1_152 + -558 >> 52 & 0x00FF) + 52;
		if (((word32) s2_190->w2800822E >> 1 & 0x01) != 0x00 && ((word32) s1_67->b0011 == 0x00 || ((word32) s2_190->w2800822E >> 3 & 0x01) != 0x00))
		{
			a5_203 = g_ptr4200F3D0;
			a1_205 = (word32) (word16) (a1_152 + 0x12) + 0x28008000;
		}
		else
		{
			a5_203 = g_ptr4200F3D4;
			a1_205 = 0x00;
		}
		word32 t4_735;
		word32 t0_734;
		word32 s9_733;
		word32 s7_732;
		word32 s6_731;
		word32 s11_730;
		word32 s10_729;
		word32 a3_254;
		word32 a7_261;
		word32 mstatus_262;
		word32 t1_263;
		a5_203();
		if (((word32) s2_162->w0000 >> 5 & 0x01) != 0x00 && ((word32) s0_167->b0004 != 0x01 || ((word32) (*((uint16 *) 0x28008154)) >> 2 & 0x01) != 0x00))
		{
			ui32 a5_281 = (word32) s1_164->w0006 + 46 << 16;
			word32 a3_303;
			word32 a7_310;
			word32 mstatus_311;
			word32 t1_312;
			word32 s10_742;
			word32 s11_743;
			word32 s6_744;
			word32 s7_745;
			word32 s9_746;
			word32 t0_747;
			word32 t4_748;
			s4_168->ptr03D0();
			goto l2302D0EC;
		}
		a5_182 = g_ptr4200F3D4;
		a0_185 = s3_165;
	}
	else
	{
		word32 a3_172;
		word32 a7_179;
		word32 mstatus_180;
		word32 t1_181;
		word32 t0_709;
		word32 t4_710;
		word32 s6_706;
		word32 s9_708;
		word32 s7_707;
		word32 s10_704;
		word32 s11_705;
		g_ptr4200F3D4();
		a5_182 = s2_162->ptr03D4;
		a0_185 = s5_169;
	}
	word32 a3_350;
	word32 a7_357;
	word32 mstatus_358;
	word32 t1_359;
	word32 s10_761;
	word32 s11_762;
	word32 s6_763;
	word32 s7_764;
	word32 s9_765;
	word32 t0_766;
	word32 t4_767;
	a5_182();
l2302D0EC:
	s0_298->b0005 = (byte) (word32) s1_295->b000E;
	<anonymous> * a5_369 = s4_299->ptr03D0;
	struct Eq_139639 * s1_379;
	word32 a3_387;
	word32 a7_394;
	word32 mstatus_395;
	word32 t1_396;
	word32 s10_774;
	word32 s11_775;
	word32 s6_776;
	word32 s7_777;
	word32 s9_778;
	word32 t0_779;
	word32 t4_780;
	a5_369();
	*((word32) s0_127 + 24) = (word16) (word32) s1_379->w0000;
	*((word32) s0_127 + 26) = (word16) (word32) s1_379->w0002;
	*((word32) s0_127 + 28) = (word16) (word32) s1_379->w0004;
	if ((word32) *((word32) s0_127 + 4) == 0x00)
		*((word32) s0_127 + 30) = 0x00;
	else
		*((word32) s0_127 + 30) = (byte) (word32) s1_379->b0010;
l2302CF5C:
	ptr32 a0_644;
	ptr32 mstatus_652;
	Eq_2 s0_654;
	Eq_2 s1_655;
	Eq_2 s2_658;
	Eq_2 s3_659;
	Eq_2 s4_660;
	Eq_2 s5_661;
	word32 tp_970;
	word32 a2_971;
	word32 a4_973;
	word32 s6_974;
	word32 s7_975;
	word32 s10_977;
	word32 s9_976;
	word32 a3_972;
	Eq_2 ra_653 = hci_send_2_host(ra_126, s1, s0_127, s2_122, s3_125, dwArg04, s5, dwArg10, dwArg14, dwArg38, out tp_970, out s0_654, out s1_655, out a0_644, out a2_971, out a3_972, out a4_973, out s2_658, out s3_659, out s4_660, out s5_661, out s6_974, out s7_975, out s9_976, out s10_977, out mstatus_652);
	s0Out = s0_654;
	s1Out = s1_655;
	a0Out = a0_644;
	s2Out = s2_658;
	s3Out = s3_659;
	s4Out = s4_660;
	s5Out = s5_661;
	mstatusOut = mstatus_652;
	return ra_653;
}

