pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302D1A6: Register Eq_2 llc_le_ch_sel_algo_evt_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 s6Out)
// Called from:
//      llc_start
Eq_2 llc_le_ch_sel_algo_evt_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & s6Out)
{
	if (llm_util_check_evt_mask(0x13) == 0x00)
	{
		s0Out = s0;
		s1Out = a0;
		s6Out = s6;
		return ra;
	}
	else
	{
		Eq_2 a0_29;
		word32 s0_39;
		word32 s1_40;
		Eq_2 s2_41;
		Eq_2 s3_42;
		Eq_2 s4_43;
		word32 a1_137;
		word32 a2_138;
		word32 a3_139;
		word32 a4_140;
		word32 a6_141;
		word32 a7_142;
		word32 s8_143;
		word32 mstatus_144;
		Eq_2 ra_38 = ble_ke_msg_alloc(ra, a1, a0, 0x00FFF804, a1, 0x00, 0x06, s2, s3, dwArg0118, out s0_39, out s1_40, out a0_29, out a1_137, out a2_138, out a3_139, out a4_140, out a6_141, out a7_142, out s2_41, out s3_42, out s4_43, out s8_143, out mstatus_144);
		*a0_29 = 0x14;
		*((word32) a0_29 + 4) = (byte) s1_40;
		*((word32) a0_29 + 2) = (word16) s0_39;
		Eq_2 s0_67;
		Eq_2 s1_68;
		ptr32 s6_75;
		word32 tp_145;
		word32 a0_146;
		word32 a2_147;
		word32 a3_148;
		word32 a4_149;
		word32 s2_150;
		word32 s3_151;
		word32 s4_152;
		word32 s5_153;
		word32 s7_154;
		word32 s9_155;
		word32 s10_156;
		word32 mstatus_157;
		Eq_2 ra_66 = hci_send_2_host(ra_38, s0, a0_29, s2_41, s3_42, s4_43, s5, dwArg10, dwArg14, dwArg38, out tp_145, out s0_67, out s1_68, out a0_146, out a2_147, out a3_148, out a4_149, out s2_150, out s3_151, out s4_152, out s5_153, out s6_75, out s7_154, out s9_155, out s10_156, out mstatus_157);
		s0Out = s0_67;
		s1Out = s1_68;
		s6Out = s6_75;
		return ra_66;
	}
}

// 2302D1EE: Register Eq_2 llc_start(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 word16) a0, Register (ptr32 Eq_139897) a1, Register (ptr32 Eq_2) a5, Register Eq_2 s2, Register word32 s3, Register Eq_2 s4, Register word32 s5, Register Eq_2 s8, Register word32 s10, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_139126 dwArg18, Stack word32 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_139915) s0Out, Register out ptr32 s1Out, Register out ptr32 s6Out)
// Called from:
//      llm_con_req_ind
//      llm_con_req_tx_cfm
Eq_2 llc_start(Eq_2 ra, Eq_2 s0, word16 * a0, struct Eq_139897 * a1, union Eq_2 * a5, Eq_2 s2, word32 s3, Eq_2 s4, word32 s5, Eq_2 s8, word32 s10, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_139126 dwArg18, word32 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_139915 & s0Out, ptr32 & s1Out, ptr32 & s6Out)
{
	ui32 s4_29 = (word32) a1->w0074;
	ui32 s8_32 = s4_29 << 0x02;
	Eq_2 s0_35 = *a5;
	word32 s2_42 = (word32) (word16) (s4_29 << 0x08 | 1);
	word32 s1_43 = 0x42026428;
	if (a5 == null)
	{
		union Eq_2 * a0_46;
		word32 a6_452;
		word32 mstatus_453;
		word32 a4_450;
		word32 a5_451;
		word32 a3_449;
		ra = ble_ke_malloc(ra, s0_35, 0x42026428, 0x00A8, 0x00, out s0_35, out s1_43, out a0_46, out a3_449, out a4_450, out a5_451, out a6_452, out s4_29, out s8_32, out mstatus_453);
		*a0_46 = (union Eq_2 *) s0_35;
	}
	<anonymous> * a5_67 = g_ptr4200F3D4;
	*((word32) s0_35 + 166) = 0x01;
	word32 s8_90;
	word32 s9_94;
	struct Eq_139950 * s10_95;
	Eq_2 s6_172;
	Eq_2 s0_166;
	Eq_2 s5_171;
	Eq_2 s2_168;
	Eq_2 ra_165;
	Eq_2 s1_167;
	Eq_2 s4_170;
	struct Eq_139958 * s7_132;
	a5_67();
	llm_util_get_channel_map();
	llm_util_get_channel_map();
	Eq_2 s3_121 = 0x42026460;
	if ((word32) *((word32) s6_172 + 0x007B) == 0x03)
	{
		<anonymous> * a5_122 = s10_95->ptr03D4;
		struct Eq_140210 * sp_126;
		Eq_2 s0_127;
		Eq_2 s1_128;
		Eq_2 s2_129;
		Eq_2 s5_130;
		Eq_2 s6_131;
		Eq_2 ra_134;
		Eq_2 s3_135;
		Eq_2 s4_136;
		up32 s9_137;
		a5_122();
		Eq_136887 a2_152 = (word32) *((word32) s3_135 + 44);
		*((word32) s0_127 + 58) = (byte) (word32) *((word32) s3_135 + 49);
		word32 mstatus_470;
		word32 a5_469;
		ra_165 = ble_ke_timer_set(ra_134, s0_127, s1_128, 261, s2_129, a2_152, s2_129, s3_135, s4_136, s5_130, s6_131, sp_126->t0010, sp_126->t00A8, sp_126->t0108, out s0_166, out s1_167, out a5_469, out s2_168, out s3_121, out s4_170, out s5_171, out s6_172, out mstatus_470);
		if (s9_137 < (word32) (*((word32) s6_172 + 94)))
			*((word32) s0_166 + 57) = (byte) s9_137;
		else
			((word32) s0_166 + 57)->u0 = 0x00;
	}
	*((word32) s0_166 + 16) = s6_172;
	Eq_136887 a2_184 = (word32) *((word32) s5_171 + 4);
	*((word32) s0_166 + 84) = (word16) a2_184;
	Eq_2 s0_204;
	Eq_2 s1_205;
	Eq_2 s2_206;
	Eq_2 s5_209;
	word32 mstatus_458;
	word32 s4_456;
	word32 s6_457;
	word32 a5_454;
	word32 s3_455;
	Eq_2 ra_203 = ble_ke_timer_set(ra_165, s0_166, s1_167, 0x0101, s2_168, a2_184, s2_168, s3_121, s4_170, s5_171, s6_172, s2, dwArg78, dwArgD8, out s0_204, out s1_205, out a5_454, out s2_206, out s3_455, out s4_456, out s5_209, out s6_457, out mstatus_458);
	*((word32) s0_204 + 161) = 0x08;
	((word32) s0_204 + 92)->u0 = 0x00;
	*((word32) s0_204 + 0x00A2) = 0x00;
	llm_util_get_supp_features();
	*s0_204 = 0x00;
	*((word32) s0_204 + 4) = 0x00;
	*((word32) s0_204 + 8) = 0x00;
	*((word32) s0_204 + 0x0C) = 0x00;
	struct Eq_140062 * a5_235;
	struct Eq_140063 * s3_241;
	Eq_2 s4_242;
	Eq_2 s0_247;
	word32 mstatus_464;
	word32 a4_462;
	word32 s2_463;
	word32 a0_460;
	word32 a2_461;
	word32 s1_459;
	Eq_2 ra_238 = ble_ke_state_set(ra_203, s0_204, s1_205, s2_206, 0x00, dwArgD8, out s0_247, out s1_459, out a0_460, out a2_461, out a4_462, out a5_235, out s2_463, out s3_241, out s4_242, out mstatus_464);
	a5_235->w0058 = 64440;
	a5_235->b00A3 = 0x00;
	a5_235->b00A4 = 0x00;
	llc_util_set_auth_payl_to_margin(s7_132);
	word32 a5_260 = (word32) s3_241->w0020;
	*((word32) s0_247 + 82) = 0x00;
	*((word32) s0_247 + 66) = (word16) a5_260;
	*((word32) s0_247 + 74) = (word16) (word32) s3_241->w0022;
	*(union Eq_2 *) 1769791 = s0_247;
	((word32) s0_247 + 72)->u0 = 0x1B;
	*(union Eq_2 *) 0x01480894 = s0_247;
	((word32) s0_247 + 80)->u0 = 0x0148;
	struct Eq_140135 * a5_280 = (word32) *((word32) s0_247 + 83) & ~0x01 | 2;
	*((word32) s0_247 + 83) = (byte) a5_280;
	a5_280->t0000.u0 = 0x00;
	a5_280->dw0004 = 0x00;
	Eq_2 s1_286 = a5_280->t0000;
	a5_280->dw0008 = 0x00;
	a5_280->dw000C = 0x00;
	a5_280->b00A5 = 0x00;
	Eq_2 s2_297;
	Eq_2 s3_298;
	Eq_2 s4_299;
	Eq_2 s5_310;
	word32 mstatus_468;
	word32 s1_466;
	word32 a0_467;
	word32 s0_465;
	Eq_2 ra_307 = llc_le_con_cmp_evt_send(ra_238, s0_247, s1_286, 0x00, s4_242, s5_209, s5_209, s10, s8, s2, s0, dwLoc08, dwArg08, dwArg18, s5, dwArgD8, out s0_465, out s1_466, out a0_467, out s2_297, out s3_298, out s4_299, out s5_310, out mstatus_468);
	0x00 = (int8) dwArg0128;
	uint32 a0_328 = (word32) *((word32) s4_299 + 0x280080FA);
	0x00 = dwArg1C;
	Eq_2 a0_336 = a0_328 >> 0x0E & 0x01;
	ptr32 s1_342;
	struct Eq_139915 * s0_350;
	ptr32 s6_357;
	Eq_2 ra_349 = llc_le_ch_sel_algo_evt_send(ra_307, s4, a0_336, s4_299, s2_297, s3_298, s5_310, dwArg10, dwArg14, dwArg38, dwArg0118, out s0_350, out s1_342, out s6_357);
	s0Out = s0_350;
	s1Out = s1_342;
	s6Out = s6_357;
	return ra_349;
}

// 2302D3C0: Register Eq_2 llc_con_update_complete_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_140290) s0Out, Register out (ptr32 Eq_140291) s1Out, Register out (ptr32 Eq_140292) s2Out, Register out ptr32 s3Out, Register out Eq_140294 s4Out, Register out ptr32 s5Out)
// Called from:
//      llc_con_update_ind
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_con_param_rsp_handler
//      lld_stop_ind_handler
//      hci_le_con_update_cmd_handler
Eq_2 llc_con_update_complete_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, struct Eq_140290 & s0Out, struct Eq_140291 & s1Out, struct Eq_140292 & s2Out, ptr32 & s3Out, union Eq_140294 & s4Out, ptr32 & s5Out)
{
	word32 a5_59;
	Eq_2 a0_23;
	ui32 s0_33;
	struct Eq_140299 * s1_34;
	Eq_2 s2_35;
	Eq_2 s3_36;
	Eq_2 s4_37;
	word32 a2_141;
	word32 a1_140;
	word32 a3_142;
	word32 a4_143;
	word32 a6_144;
	word32 a7_145;
	word32 s8_146;
	word32 mstatus_147;
	Eq_2 ra_32 = ble_ke_msg_alloc(ra, a1, a2, 0x00FFF804, a1, 0x00, 0x0A, a0, s3, dwArg0118, out s0_33, out s1_34, out a0_23, out a1_140, out a2_141, out a3_142, out a4_143, out a6_144, out a7_145, out s2_35, out s3_36, out s4_37, out s8_146, out mstatus_147);
	*a0_23 = 0x03;
	*((word32) a0_23 + 2) = (word16) s0_33;
	*((word32) a0_23 + 1) = (byte) s2_35;
	if (s1_34 != null)
	{
		*((word32) a0_23 + 4) = (word16) ((word32) s1_34->w0050 >> 1);
		*((word32) a0_23 + 6) = (word16) ((word32) s1_34->w0036 + ~0x00);
		a5_59 = (word32) *((char *) *((char *) &g_t42026428 + s0_33 * 0x04) + 84);
	}
	else
	{
		struct Eq_140345 * a5_51 = **((char *) &g_t42026428 + s0_33 * 0x04);
		if (a5_51 == null)
		{
			*((word32) a0_23 + 4) = 0x00;
			((word32) a0_23 + 6)->u2 = 0x00;
			*((word32) a0_23 + 8) = 0x00;
			goto l2302D418;
		}
		*((word32) a0_23 + 4) = (word16) (word32) a5_51->w000E;
		*((word32) a0_23 + 6) = (word16) (word32) a5_51->w0006;
		a5_59 = (word32) a5_51->w0008;
	}
	*((word32) a0_23 + 8) = (word16) a5_59;
l2302D418:
	0x00 = (int8) dwArg38;
	struct Eq_140290 * s0_101;
	struct Eq_140291 * s1_102;
	struct Eq_140292 * s2_105;
	ptr32 s3_106;
	Eq_140294 s4_107;
	ptr32 s5_108;
	word32 tp_148;
	word32 a0_149;
	word32 a2_150;
	word32 a3_151;
	word32 a4_152;
	word32 s6_153;
	word32 s7_154;
	word32 s9_155;
	word32 s10_156;
	word32 mstatus_157;
	Eq_2 ra_100 = hci_send_2_host(ra_32, s0, a0_23, s2_35, s3_36, s4_37, s5, dwArg10, dwArg14, dwArg38, out tp_148, out s0_101, out s1_102, out a0_149, out a2_150, out a3_151, out a4_152, out s2_105, out s3_106, out s4_107, out s5_108, out s6_153, out s7_154, out s9_155, out s10_156, out mstatus_157);
	s0Out = s0_101;
	s1Out = s1_102;
	s2Out = s2_105;
	s3Out = s3_106;
	s4Out = s4_107;
	s5Out = s5_108;
	return ra_100;
}

// 2302D452: Register Eq_2 llc_ltk_req_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_enc_mgt_ind_handler
Eq_2 llc_ltk_req_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_140473 * a0_22;
	struct Eq_140474 * s1_33;
	word32 s2_34;
	word32 s3_35;
	word32 s0_133;
	word32 a1_134;
	word32 a2_135;
	word32 a3_136;
	word32 a4_137;
	word32 a6_138;
	word32 a7_139;
	word32 s4_140;
	word32 s8_141;
	word32 mstatus_142;
	Eq_2 ra_31 = ble_ke_msg_alloc(ra, s0, a1, 0x00FFF804, a0, 0x00, 0x0E, a0, s3, dwArg0118, out s0_133, out s1_33, out a0_22, out a1_134, out a2_135, out a3_136, out a4_137, out a6_138, out a7_139, out s2_34, out s3_35, out s4_140, out s8_141, out mstatus_142);
	a0_22->w0002 = (word16) s2_34;
	a0_22->b0000 = 0x05;
	ui32 a4_45 = (word32) s1_33->b0009;
	a0_22->w000C = (word16) ((word32) s1_33->b000A << 8 | a4_45);
	<anonymous> * a5_51 = g_ptr4200F3D0;
	Eq_2 s2_57;
	Eq_2 ra_62;
	Eq_2 s0_63;
	Eq_2 s3_67;
	Eq_2 s4_71;
	a5_51();
	0x00 = (int8) dwArg38;
	ptr32 a3_84;
	ptr32 mstatus_89;
	ptr32 s0_91;
	ptr32 s1_92;
	ptr32 s2_95;
	ptr32 s3_96;
	ptr32 s4_97;
	ptr32 s5_98;
	word32 tp_143;
	word32 a0_144;
	word32 a2_145;
	word32 a4_146;
	word32 s6_147;
	word32 s7_148;
	word32 s9_149;
	word32 s10_150;
	Eq_2 ra_90 = hci_send_2_host(ra_62, s0, s0_63, s2_57, s3_67, s4_71, s5, dwArg10, dwArg14, dwArg38, out tp_143, out s0_91, out s1_92, out a0_144, out a2_145, out a3_84, out a4_146, out s2_95, out s3_96, out s4_97, out s5_98, out s6_147, out s7_148, out s9_149, out s10_150, out mstatus_89);
	s0Out = s0_91;
	s1Out = s1_92;
	a3Out = a3_84;
	s2Out = s2_95;
	s3Out = s3_96;
	s4Out = s4_97;
	s5Out = s5_98;
	mstatusOut = mstatus_89;
	return ra_90;
}

