pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302D4AE: Register Eq_2 llc_feats_rd_event_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      llcp_unknown_rsp_handler
//      llcp_feats_rsp_handler
//      lld_stop_ind_handler
//      hci_le_rd_rem_used_feats_cmd_handler
Eq_2 llc_feats_rd_event_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	if (llm_util_check_evt_mask(0x03) == 0x00)
	{
		s0Out = s0;
		s1Out = a1;
		s2Out = a2;
		s3Out = a0;
		return ra;
	}
	else
	{
		struct Eq_140598 * a0_35;
		word32 s1_46;
		word32 s2_47;
		word32 s3_48;
		word32 s0_186;
		word32 a1_187;
		word32 a2_188;
		word32 a3_189;
		word32 a4_190;
		word32 a6_191;
		word32 a7_192;
		word32 s4_193;
		word32 s8_194;
		word32 mstatus_195;
		Eq_2 ra_44 = ble_ke_msg_alloc(ra, s0, a1, 0x00FFF804, a1, 0x00, 0x0C, a2, a0, dwArg0108, out s0_186, out s1_46, out a0_35, out a1_187, out a2_188, out a3_189, out a4_190, out a6_191, out a7_192, out s2_47, out s3_48, out s4_193, out s8_194, out mstatus_195);
		a0_35->b0000 = 0x04;
		a0_35->b0001 = (byte) s3_48;
		a0_35->w0002 = (word16) s1_46;
		<anonymous> * a5_59 = g_ptr4200F3D0;
		Eq_2 s3_65;
		Eq_2 s2_68;
		Eq_2 ra_69;
		Eq_2 s0_70;
		word32 a3_73;
		word32 a7_80;
		word32 mstatus_81;
		word32 t1_82;
		word32 tp_83;
		word32 s10_131;
		word32 s11_132;
		word32 s6_133;
		word32 s7_134;
		word32 s9_135;
		word32 t0_136;
		word32 t4_137;
		a5_59();
		Eq_2 s0_102;
		Eq_2 s1_103;
		Eq_2 s2_106;
		Eq_2 s3_107;
		word32 tp_196;
		word32 a0_197;
		word32 a2_198;
		word32 a3_199;
		word32 a4_200;
		word32 s4_201;
		word32 s5_202;
		word32 s6_203;
		word32 s7_204;
		word32 s9_205;
		word32 s10_206;
		word32 mstatus_207;
		Eq_2 ra_101 = hci_send_2_host(ra_69, s0_70, s0_70, s2_68, s3_65, dwArg04, s5, dwArg10, dwArg14, dwArg38, out tp_196, out s0_102, out s1_103, out a0_197, out a2_198, out a3_199, out a4_200, out s2_106, out s3_107, out s4_201, out s5_202, out s6_203, out s7_204, out s9_205, out s10_206, out mstatus_207);
		s0Out = s0_102;
		s1Out = s1_103;
		s2Out = s2_106;
		s3Out = s3_107;
		return ra_101;
	}
}

// 2302D518: Register Eq_2 llc_version_rd_event_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llcp_vers_ind_handler
//      lld_stop_ind_handler
//      hci_rd_rem_ver_info_cmd_handler
Eq_2 llc_version_rd_event_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a0_20;
	struct Eq_140716 * a4_24;
	word32 s0_30;
	word32 s1_31;
	Eq_2 s2_32;
	Eq_2 s3_33;
	Eq_2 s4_34;
	word32 a1_97;
	word32 a2_98;
	word32 a3_99;
	word32 a6_100;
	word32 a7_101;
	word32 s8_102;
	word32 mstatus_103;
	Eq_2 ra_29 = ble_ke_msg_alloc(ra, a1, a0, 0x00FFF803, a1, 0x0C, 0x0A, s2, s3, dwArg0118, out s0_30, out s1_31, out a0_20, out a1_97, out a2_98, out a3_99, out a4_24, out a6_100, out a7_101, out s2_32, out s3_33, out s4_34, out s8_102, out mstatus_103);
	*((word32) a0_20 + 2) = (word16) s0_30;
	*a0_20 = (byte) s1_31;
	struct Eq_140757 * a4_45 = (word32) a4_24->w003E;
	*((word32) a0_20 + 6) = (word16) a4_45;
	*((word32) a0_20 + 8) = (word16) (word32) a4_45->w0040;
	*((word32) a0_20 + 4) = (byte) (word32) a4_45->b003C;
	ptr32 s0_67;
	ptr32 s1_68;
	ptr32 s2_71;
	ptr32 s3_72;
	ptr32 s4_73;
	ptr32 s5_74;
	word32 tp_104;
	word32 a0_105;
	word32 a2_106;
	word32 a3_107;
	word32 a4_108;
	word32 s6_109;
	word32 s7_110;
	word32 s9_111;
	word32 s10_112;
	word32 mstatus_113;
	Eq_2 ra_66 = hci_send_2_host(ra_29, s0, a0_20, s2_32, s3_33, s4_34, s5, dwArg10, dwArg14, dwArg38, out tp_104, out s0_67, out s1_68, out a0_105, out a2_106, out a3_107, out a4_108, out s2_71, out s3_72, out s4_73, out s5_74, out s6_109, out s7_110, out s9_111, out s10_112, out mstatus_113);
	s0Out = s0_67;
	s1Out = s1_68;
	s2Out = s2_71;
	s3Out = s3_72;
	s4Out = s4_73;
	s5Out = s5_74;
	return ra_66;
}

// 2302D56E: void llc_common_cmd_complete_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118)
// Called from:
//      hci_le_set_data_len_cmd_handler
//      hci_le_rem_con_param_req_neg_reply_cmd_handler
//      hci_le_rem_con_param_req_reply_cmd_handler
//      hci_le_ltk_req_neg_reply_cmd_handler
//      hci_le_ltk_req_reply_cmd_handler
void llc_common_cmd_complete_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118)
{
	Eq_2 a0_22;
	word32 s0_32;
	word32 s1_33;
	Eq_2 s2_34;
	Eq_2 s3_35;
	Eq_2 s4_36;
	word32 a1_82;
	word32 a2_83;
	word32 a3_84;
	word32 a4_85;
	word32 a6_86;
	word32 a7_87;
	word32 s8_88;
	word32 mstatus_89;
	Eq_2 ra_31 = ble_ke_msg_alloc(ra, a2, a1, 0x00FFF801, a2, a0, 0x04, s2, s3, dwArg0118, out s0_32, out s1_33, out a0_22, out a1_82, out a2_83, out a3_84, out a4_85, out a6_86, out a7_87, out s2_34, out s3_35, out s4_36, out s8_88, out mstatus_89);
	*a0_22 = (byte) s1_33;
	*((word32) a0_22 + 2) = (word16) s0_32;
	word32 tp_90;
	word32 s0_91;
	word32 s1_92;
	word32 a0_93;
	word32 a2_94;
	word32 a3_95;
	word32 a4_96;
	word32 s2_97;
	word32 s3_98;
	word32 s4_99;
	word32 s5_100;
	word32 s6_101;
	word32 s7_102;
	word32 s9_103;
	word32 s10_104;
	word32 mstatus_105;
	hci_send_2_host(ra_31, s0, a0_22, s2_34, s3_35, s4_36, s5, dwArg10, dwArg14, dwArg38, out tp_90, out s0_91, out s1_92, out a0_93, out a2_94, out a3_95, out a4_96, out s2_97, out s3_98, out s4_99, out s5_100, out s6_101, out s7_102, out s9_103, out s10_104, out mstatus_105);
}

