pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302D59E: Register Eq_2 llc_common_cmd_status_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out (ptr32 uint16) s1Out, Register out ptr32 a2Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      hci_disconnect_cmd_handler
//      hci_le_start_enc_cmd_handler
//      hci_le_rd_rem_used_feats_cmd_handler
//      hci_le_con_update_cmd_handler
//      hci_rd_rem_ver_info_cmd_handler
Eq_2 llc_common_cmd_status_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s0Out, uint16 & s1Out, ptr32 & a2Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a0_20;
	word32 s0_30;
	Eq_2 s2_32;
	Eq_2 s3_33;
	Eq_2 s4_34;
	word32 s1_84;
	word32 a1_85;
	word32 a2_86;
	word32 a3_87;
	word32 a4_88;
	word32 a6_89;
	word32 a7_90;
	word32 s8_91;
	word32 mstatus_92;
	Eq_2 ra_29 = ble_ke_msg_alloc(ra, a1, s1, 0x00FFF802, a2, a0, 0x01, s2, s3, dwArg0118, out s0_30, out s1_84, out a0_20, out a1_85, out a2_86, out a3_87, out a4_88, out a6_89, out a7_90, out s2_32, out s3_33, out s4_34, out s8_91, out mstatus_92);
	*a0_20 = (byte) s0_30;
	ptr32 a2_46;
	ptr32 s0_54;
	uint16 * s1_55;
	ptr32 s2_58;
	ptr32 s3_59;
	ptr32 s4_60;
	ptr32 s5_61;
	word32 tp_93;
	word32 a0_94;
	word32 a3_95;
	word32 a4_96;
	word32 s6_97;
	word32 s7_98;
	word32 s9_99;
	word32 s10_100;
	word32 mstatus_101;
	Eq_2 ra_53 = hci_send_2_host(ra_29, s0, a0_20, s2_32, s3_33, s4_34, s5, dwArg10, dwArg14, dwArg38, out tp_93, out s0_54, out s1_55, out a0_94, out a2_46, out a3_95, out a4_96, out s2_58, out s3_59, out s4_60, out s5_61, out s6_97, out s7_98, out s9_99, out s10_100, out mstatus_101);
	s0Out = s0_54;
	s1Out = s1_55;
	a2Out = a2_46;
	s2Out = s2_58;
	s3Out = s3_59;
	s4Out = s4_60;
	s5Out = s5_61;
	return ra_53;
}

// 2302D5C4: Register Eq_2 llc_common_flush_occurred_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_flush_cmd_handler
Eq_2 llc_common_flush_occurred_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & a0Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a0_18;
	word32 s0_28;
	Eq_2 s2_30;
	Eq_2 s3_31;
	Eq_2 s4_32;
	word32 s1_80;
	word32 a1_81;
	word32 a2_82;
	word32 a3_83;
	word32 a4_84;
	word32 a6_85;
	word32 a7_86;
	word32 s8_87;
	word32 mstatus_88;
	Eq_2 ra_27 = ble_ke_msg_alloc(ra, a0, s1, 0x00FFF803, a0, 0x11, 0x02, s2, s3, dwArg0118, out s0_28, out s1_80, out a0_18, out a1_81, out a2_82, out a3_83, out a4_84, out a6_85, out a7_86, out s2_30, out s3_31, out s4_32, out s8_87, out mstatus_88);
	*a0_18 = (word16) s0_28;
	ptr32 a0_42;
	ptr32 mstatus_50;
	ptr32 s0_52;
	ptr32 s4_58;
	ptr32 s5_59;
	word32 tp_89;
	word32 s1_90;
	word32 a2_91;
	word32 a3_92;
	word32 a4_93;
	word32 s2_94;
	word32 s3_95;
	word32 s6_96;
	word32 s7_97;
	word32 s9_98;
	word32 s10_99;
	Eq_2 ra_51 = hci_send_2_host(ra_27, s0, a0_18, s2_30, s3_31, s4_32, s5, dwArg10, dwArg14, dwArg38, out tp_89, out s0_52, out s1_90, out a0_42, out a2_91, out a3_92, out a4_93, out s2_94, out s3_95, out s4_58, out s5_59, out s6_96, out s7_97, out s9_98, out s10_99, out mstatus_50);
	s0Out = s0_52;
	a0Out = a0_42;
	s4Out = s4_58;
	s5Out = s5_59;
	mstatusOut = mstatus_50;
	return ra_51;
}

// 2302D5EA: Register Eq_2 llc_common_enc_key_ref_comp_evt_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llcp_start_enc_rsp_handler
//      lld_stop_ind_handler
Eq_2 llc_common_enc_key_ref_comp_evt_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a0_21;
	word32 s0_31;
	word32 s1_32;
	Eq_2 s2_33;
	Eq_2 s3_34;
	Eq_2 s4_35;
	word32 a1_85;
	word32 a2_86;
	word32 a3_87;
	word32 a4_88;
	word32 a6_89;
	word32 a7_90;
	word32 s8_91;
	word32 mstatus_92;
	Eq_2 ra_30 = ble_ke_msg_alloc(ra, a0, a1, 0x00FFF803, a0, 48, 0x04, s2, s3, dwArg0118, out s0_31, out s1_32, out a0_21, out a1_85, out a2_86, out a3_87, out a4_88, out a6_89, out a7_90, out s2_33, out s3_34, out s4_35, out s8_91, out mstatus_92);
	*((word32) a0_21 + 2) = (word16) s0_31;
	*a0_21 = (byte) s1_32;
	ptr32 s0_57;
	ptr32 s2_61;
	ptr32 s4_63;
	ptr32 s5_64;
	word32 tp_93;
	word32 s1_94;
	word32 a0_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 s3_99;
	word32 s6_100;
	word32 s7_101;
	word32 s9_102;
	word32 s10_103;
	word32 mstatus_104;
	Eq_2 ra_56 = hci_send_2_host(ra_30, s0, a0_21, s2_33, s3_34, s4_35, s5, dwArg10, dwArg14, dwArg38, out tp_93, out s0_57, out s1_94, out a0_95, out a2_96, out a3_97, out a4_98, out s2_61, out s3_99, out s4_63, out s5_64, out s6_100, out s7_101, out s9_102, out s10_103, out mstatus_104);
	s0Out = s0_57;
	s2Out = s2_61;
	s4Out = s4_63;
	s5Out = s5_64;
	return ra_56;
}

// 2302D61C: Register Eq_2 llc_common_enc_change_evt_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      llc_llcp_reject_ind
//      llcp_unknown_rsp_handler
//      llcp_start_enc_rsp_handler
//      lld_stop_ind_handler
Eq_2 llc_common_enc_change_evt_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 s5_119;
	Eq_2 ra_113;
	Eq_2 s3_117;
	Eq_2 s1_115;
	Eq_2 s0_114;
	Eq_2 s2_116;
	Eq_2 s0_25 = (word32) (word16) (a0 << 0x08 | 1);
	if (a1 != 0x00)
	{
		struct Eq_141267 * a5_84;
		Eq_2 s0_89;
		Eq_2 s2_91;
		Eq_2 s3_92;
		Eq_2 s4_93;
		Eq_2 s5_94;
		Eq_2 s6_95;
		word32 s1_243;
		word32 mstatus_244;
		word32 a5_245;
		word32 s4_246;
		word32 s6_247;
		word32 mstatus_248;
		ra_113 = ble_ke_timer_set(ble_ke_timer_set(ra, s0_25, g_t42026428, 259, s0_25, (uint16) (g_w42026480 - g_w42026482), a0, a1, a2, s5, s6, dwLoc10, dwArg88, dwArgE8, out s0_89, out s1_243, out a5_84, out s2_91, out s3_92, out s4_93, out s5_94, out s6_95, out mstatus_244), s0_89, a5_84->t0000, 260, s0_89, (word32) a5_84->w0058, s2_91, s3_92, s4_93, s5_94, s6_95, dwLoc10, dwArg88, dwArgE8, out s0_114, out s1_115, out a5_245, out s2_116, out s3_117, out s4_246, out s5_119, out s6_247, out mstatus_248);
	}
	else
	{
		Eq_2 s0_38;
		Eq_2 s1_39;
		Eq_2 s2_40;
		Eq_2 s3_41;
		Eq_2 s5_43;
		word32 a3_230;
		word32 a2_229;
		word32 a1_228;
		word32 a0_227;
		word32 a4_231;
		word32 s4_232;
		word32 s8_233;
		word32 mstatus_234;
		word32 a0_235;
		word32 a1_236;
		word32 a2_237;
		word32 a3_238;
		word32 a4_239;
		word32 s4_240;
		word32 s8_241;
		word32 mstatus_242;
		ra_113 = ble_ke_timer_clear(ble_ke_timer_clear(ra, s0_25, s1, 259, s0_25, a0, a1, s5, s4, dwArgE8, out s0_38, out s1_39, out a0_227, out a1_228, out a2_229, out a3_230, out a4_231, out s2_40, out s3_41, out s4_232, out s5_43, out s8_233, out mstatus_234), s0_38, s1_39, 260, s0_38, s2_40, s3_41, s5_43, s4, dwArgE8, out s0_114, out s1_115, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out s2_116, out s3_117, out s4_240, out s5_119, out s8_241, out mstatus_242);
	}
	Eq_2 a0_137;
	Eq_2 s2_149;
	Eq_2 s3_150;
	word32 s4_151;
	word32 s0_259;
	word32 s1_260;
	word32 a1_261;
	word32 a2_262;
	word32 a3_263;
	word32 a4_264;
	word32 a6_265;
	word32 a7_266;
	word32 s8_267;
	word32 mstatus_268;
	Eq_2 ra_146 = ble_ke_msg_alloc(ra_113, s0_114, s1_115, 0x00FFF803, s2_116, 0x08, 0x06, s2_116, s3_117, dwArg0108, out s0_259, out s1_260, out a0_137, out a1_261, out a2_262, out a3_263, out a4_264, out a6_265, out a7_266, out s2_149, out s3_150, out s4_151, out s8_267, out mstatus_268);
	*((word32) a0_137 + 2) = (word16) s2_149;
	*((word32) a0_137 + 4) = (byte) s3_150;
	*a0_137 = (byte) s4_151;
	ptr32 s0_177;
	ptr32 s1_178;
	ptr32 s2_181;
	ptr32 s3_182;
	ptr32 s4_183;
	ptr32 s5_184;
	word32 tp_249;
	word32 a0_250;
	word32 a2_251;
	word32 a3_252;
	word32 a4_253;
	word32 s6_254;
	word32 s7_255;
	word32 s9_256;
	word32 s10_257;
	word32 mstatus_258;
	Eq_2 ra_176 = hci_send_2_host(ra_146, s1, a0_137, s2_149, s3_150, dwArg04, s5_119, dwArg10, dwArg14, dwArg38, out tp_249, out s0_177, out s1_178, out a0_250, out a2_251, out a3_252, out a4_253, out s2_181, out s3_182, out s4_183, out s5_184, out s6_254, out s7_255, out s9_256, out s10_257, out mstatus_258);
	s0Out = s0_177;
	s1Out = s1_178;
	s2Out = s2_181;
	s3Out = s3_182;
	s4Out = s4_183;
	s5Out = s5_184;
	return ra_176;
}

