pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302D6B6: Register Eq_2 llc_common_nb_of_pkt_comp_evt_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out Eq_141412 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_pdu_tx_flush
//      llc_pdu_acl_tx_ack_defer
//      llc_hci_acl_data_tx_handler
Eq_2 llc_common_nb_of_pkt_comp_evt_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg0118, union Eq_141412 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a0_21;
	word32 s0_31;
	word32 s1_32;
	Eq_2 s2_33;
	Eq_2 s3_34;
	Eq_2 s4_35;
	word32 a1_95;
	word32 a2_96;
	word32 a3_97;
	word32 a4_98;
	word32 a6_99;
	word32 a7_100;
	word32 s8_101;
	word32 mstatus_102;
	Eq_2 ra_30 = ble_ke_msg_alloc(ra, a0, a1, 0x00FFF803, a0, 0x13, 0x06, s2, s3, dwArg0118, out s0_31, out s1_32, out a0_21, out a1_95, out a2_96, out a3_97, out a4_98, out a6_99, out a7_100, out s2_33, out s3_34, out s4_35, out s8_101, out mstatus_102);
	*((word32) a0_21 + 2) = (word16) s0_31;
	*((word32) a0_21 + 4) = (word16) s1_32;
	*a0_21 = 0x01;
	ptr32 a0_49;
	ptr32 a3_52;
	ptr32 a4_53;
	ptr32 mstatus_57;
	Eq_141412 s0_59;
	ptr32 s1_60;
	ptr32 s2_63;
	ptr32 s3_64;
	ptr32 s4_65;
	ptr32 s5_66;
	ptr32 s6_67;
	ptr32 s7_68;
	word32 tp_103;
	word32 a2_104;
	word32 s9_105;
	word32 s10_106;
	Eq_2 ra_58 = hci_send_2_host(ra_30, s0, a0_21, s2_33, s3_34, s4_35, s5, dwArg10, dwArg14, dwArg38, out tp_103, out s0_59, out s1_60, out a0_49, out a2_104, out a3_52, out a4_53, out s2_63, out s3_64, out s4_65, out s5_66, out s6_67, out s7_68, out s9_105, out s10_106, out mstatus_57);
	s0Out = s0_59;
	s1Out = s1_60;
	a0Out = a0_49;
	a3Out = a3_52;
	a4Out = a4_53;
	s2Out = s2_63;
	s3Out = s3_64;
	s4Out = s4_65;
	s5Out = s5_66;
	s6Out = s6_67;
	s7Out = s7_68;
	mstatusOut = mstatus_57;
	return ra_58;
}

// 2302D6EC: Register (ptr32 (arr (ptr32 Eq_141534))) llc_con_update_ind(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_141509) a3, Register Eq_2 s5, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8, Register out ptr32 a3Out)
// Called from:
//      lld_evt_deffered_elt_handler
struct Eq_141534 * (* llc_con_update_ind)[](Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_141509 * a3, Eq_2 s5, Eq_2 dwArg18, Eq_2 dwArgF8, ptr32 & a3Out)
{
	int32 s2_50 = a0 << 0x02;
	Eq_2 s1_21 = a1;
	struct Eq_141534 * s0_22[] = &g_t42026428;
	ui32 a4_23 = (word32) a3->w005C;
	if ((a4_23 & 0x00C0) != 0x00)
	{
		a3->w005C = (word16) (a4_23 & -0x00C1);
		if (llm_util_check_evt_mask(0x02) != 0x00)
		{
			word32 s5_158;
			word32 s4_157;
			word32 s3_156;
			llc_con_update_complete_send(ra, 0x42026428, 0x00, a0, (word32) a1 + 40, a0, s5, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_22, out s1_21, out s2_50, out s3_156, out s4_157, out s5_158);
		}
	}
	ptr32 a3_65 = (word32) *((word32) s1_21 + 94);
	struct Eq_141534 * a5_70 = s0_22[s2_50 / 4];
	if (a3_65 > 0x01)
		a5_70->b0039 = 0x01;
	else
		a5_70->b0039 = 0x00;
	a3Out = a3_65;
	return s0_22;
}

// 2302D75E: void llc_lsto_con_update(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register ui32 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg00, Stack Eq_2 dwArg98, Stack Eq_2 dwArgF8)
void llc_lsto_con_update(Eq_2 ra, Eq_2 s0, Eq_2 s1, ui32 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 dwArg00, Eq_2 dwArg98, Eq_2 dwArgF8)
{
	uint32 a5_13 = (word32) *((word32) s0 + 86);
	uint32 a2_14 = (word32) *((word32) s0 + 84);
	if (a2_14 < a5_13)
		a2_14 = a5_13;
	Eq_136887 a2_22 = (word32) (word16) (a2_14 << 1);
	*((word32) s0 + 84) = (word16) a2_22;
	word32 a5_81;
	word32 s2_82;
	word32 s3_83;
	word32 s4_84;
	struct Eq_141612 * s0_52;
	word32 s1_80;
	word32 s5_85;
	word32 s6_86;
	word32 mstatus_87;
	ble_ke_timer_set(ra, s0, s1, 0x0101, (word32) (word16) (a0 << 0x08 | 1), a2_22, s2, s3, s4, s5, s6, dwArg00, dwArg98, dwArgF8, out s0_52, out s1_80, out a5_81, out s2_82, out s3_83, out s4_84, out s5_85, out s6_86, out mstatus_87);
	s0_52->w005C = (word16) ((word32) s0_52->w005C | 32);
}

// 2302D7B4: Register (ptr32 byte) llc_map_update_ind(Register Eq_2 s1, Register (ptr32 Eq_141647) a0, Stack word32 dwArg38)
// Called from:
//      lld_ch_map_ind
byte * llc_map_update_ind(Eq_2 s1, struct Eq_141647 * a0, word32 dwArg38)
{
	word32 a3_81;
	Eq_2 a0_21 = llm_util_check_map_validity((word32) s1 + 99, 0x05, out a3_81);
	a0->w28008106 = (word16) ((word32) *((word32) s1 + 100) << 8 | (word32) (*((word32) s1 + 99)));
	a0->w28008108 = (word16) ((word32) *((word32) s1 + 0x0066) << 8 | (word32) (*((word32) s1 + 101)));
	a0->w2800810A = (word16) (word32) (word16) (a0_21 << 8 | (word32) (*((word32) s1 + 0x0067)));
	word32 a1_82;
	word32 a2_83;
	word32 a3_84;
	word32 a4_85;
	word32 a5_86;
	word32 a6_87;
	word32 a7_88;
	memcpy((word32) s1 + 94, (word32) s1 + 99, 0x05, out a1_82, out a2_83, out a3_84, out a4_85, out a5_86, out a6_87, out a7_88);
	0x00 = dwArg38;
	return (word32) s1 + 99;
}

// 2302D842: Register Eq_2 llc_con_update_finished(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_141729) a3, Register Eq_2 s5, Stack Eq_2 dwArgE8, Register out (ptr32 Eq_141732) s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
Eq_2 llc_con_update_finished(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_141729 * a3, Eq_2 s5, Eq_2 dwArgE8, struct Eq_141732 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s1_10 = (word32) (word16) (a0 << 0x08 | 1);
	Eq_2 s2_107 = a0;
	Eq_2 a0_23;
	word32 s0_164;
	word32 a1_165;
	word32 a4_166;
	word32 s8_167;
	Eq_2 ra_105 = ble_ke_state_get(ra, s0, s1_10, out s0_164, out a0_23, out a1_165, out a4_166, out s8_167);
	if ((a0_23 & 0x0F) != 0x0F)
	{
		if (lld_get_mode(a0) == 0x03)
		{
			Eq_2 s0_86;
			Eq_2 s1_87;
			ui32 s3_89;
			struct Eq_141784 * a5_102;
			word32 s2_168;
			word32 s4_169;
			word32 s0_170;
			word32 a0_171;
			word32 a2_172;
			word32 a4_173;
			word32 s3_174;
			word32 s4_175;
			ra_105 = ble_ke_state_set(llc_util_clear_operation_ptr(ra_105, 0x42026428, s1_10, a0, a0, a0_23, a0 << 0x02, s5, out s0_86, out s1_87, out s2_168, out s3_89, out s4_169, out s5), s0_86, s1_87, s1_87, s3_89 & 0x00FE, dwArgE8, out s0_170, out s1_10, out a0_171, out a2_172, out a4_173, out a5_102, out s2_107, out s3_174, out s4_175, out mstatus);
			a5_102->b00A3 = 0x00;
		}
		else
		{
			Eq_2 s0_42 = a3->t0000;
			ui32 a5_43 = (word32) a3->w005C;
			if ((a5_43 & 0x0400) != 0x00)
			{
				struct Eq_141843 * a5_56;
				word32 s0_176;
				word32 a0_177;
				word32 a2_178;
				word32 a4_179;
				word32 s3_180;
				word32 s4_181;
				ra_105 = ble_ke_state_set(ra_105, s0_42, s1_10, s1_10, a0_23 & 0x00FD, dwArgE8, out s0_176, out s1_10, out a0_177, out a2_178, out a4_179, out a5_56, out s2_107, out s3_180, out s4_181, out mstatus);
				ui32 a4_70 = (word32) a5_56->w005C;
				a5_56->b00A4 = 0x00;
				a5_56->w005C = (word16) (a4_70 & -0x0401);
			}
			else
				a3->w005C = (word16) (a5_43 | 0x00FFF800);
		}
	}
	s0Out = s1;
	s1Out = s1_10;
	s2Out = s2_107;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra_105;
}

// 2302D8EC: Register Eq_2 llc_map_update_finished(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_141509) a3, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
Eq_2 llc_map_update_finished(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_141509 * a3, Eq_2 dwArgE8, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 s1_10 = (word32) (word16) (a0 << 0x08 | 1);
	Eq_2 s2_128 = a0;
	ui32 a0_21;
	word32 a1_138;
	word32 a4_139;
	word32 s8_140;
	Eq_2 s0_126;
	Eq_2 ra_125 = ble_ke_state_get(ra, s0, s1_10, out s0_126, out a0_21, out a1_138, out a4_139, out s8_140);
	if ((a0_21 & 0x0F) != 0x0F)
	{
		s2_128 = a0 << 2;
		if (lld_get_mode(a0) == 0x03)
		{
			struct Eq_141932 * a5_79;
			word32 s0_141;
			word32 a0_142;
			word32 a2_143;
			word32 a4_144;
			word32 s3_145;
			word32 s4_146;
			ra_125 = ble_ke_state_set(ra_125, 0x42026428, s1_10, s1_10, a0_21 & 0x00FE, dwArgE8, out s0_141, out s1_10, out a0_142, out a2_143, out a4_144, out a5_79, out s2_128, out s3_145, out s4_146, out mstatus);
			s0_126 = a5_79->t0000;
			a5_79->b00A3 = 0x00;
		}
		else
		{
			s0_126 = a3->t0000;
			ui32 a5_41 = (word32) a3->w005C;
			if ((a5_41 & 0x0400) != 0x00)
			{
				struct Eq_141967 * a5_54;
				word32 s0_147;
				word32 a0_148;
				word32 a2_149;
				word32 a4_150;
				word32 s3_151;
				word32 s4_152;
				ra_125 = ble_ke_state_set(ra_125, s0_126, s1_10, s1_10, a0_21 & 0x00FD, dwArgE8, out s0_147, out s1_10, out a0_148, out a2_149, out a4_150, out a5_54, out s2_128, out s3_151, out s4_152, out mstatus);
				s0_126 = a5_54->t0000;
				ui32 a4_68 = (word32) a5_54->w005C;
				a5_54->b00A4 = 0x00;
				a5_54->w005C = (word16) (a4_68 & -0x0401);
			}
			else
				a3->w005C = (word16) (a5_41 | 0x00FFF800);
		}
	}
	s0Out = s0_126;
	s1Out = s1_10;
	s2Out = s2_128;
	mstatusOut = mstatus;
	return ra_125;
}

