pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302D988: void lld_evt_winsize_change(Register word32 a1, Register (ptr32 Eq_142007) a4, Register (ptr32 Eq_142008) a5)
// Called from:
//      lld_evt_rxwin_compute
//      lld_evt_move_to_slave
void lld_evt_winsize_change(word32 a1, struct Eq_142007 * a4, struct Eq_142008 * a5)
{
	struct Eq_142009 * a0_7 = a4->ptr0030;
	uint32 a3_10 = a5 + (a4 << 1) / 88;
	if (a5 << 0x10 < 0x00)
		a3_10 = (a5 & 0x07FFFFFF) + 625 + (a4 << 1);
	uint32 a5_19 = a3_10;
	if (a3_10 < 0x0E)
		a5_19 = 0x0E;
	if (a5_19 >= (((word32) a0_7->w0050 >> 1) + (word32) a0_7->w0036) + 475 && a1 == 0x00)
	{
		a0_7->b0056 = (byte) ((word32) a0_7->b0056 | 16);
		return;
	}
	struct Eq_142057 * a5_49;
	if (a3_10 >= 0x04000000)
	{
		a5_49 = (word32) (word16) (a5_19 + 624 >> 625 | 0xF8000000);
		if ((word32) a0_7->w0004 == 0x00)
			goto l2302DA0A;
		a5_19 = (char *) a5_49 + 1;
	}
	a5_49 = (word32) (word16) a5_19;
l2302DA0A:
	((word16[]) 671121662)[(word32) a0_7->w004C / 2] = (word16) a5_49;
	a5_49->ptr002C = a0_7;
}

// 2302DA28: Register uint32 lld_evt_slave_time_compute(Register Eq_2 a0, Register uint32 a1)
// Called from:
//      lld_evt_schedule_next
//      lld_evt_move_to_slave
uint32 lld_evt_slave_time_compute(Eq_2 a0, uint32 a1)
{
	uint32 a1_28;
	struct Eq_142093 * a2_9 = (word32) *((word32) a0 + 116);
	Eq_2 t3_10 = *((word32) a0 + 40);
	uint32 a1_11 = a1 + 625 + (word32) (*((word32) a0 + 44));
	uint32 a5_24 = (word32) (word16) (word32) a2_9->w280080FE;
	struct Eq_142117 * a3_19 = (word32) (word27) ((word32) t3_10 + (a1_11 >> 625));
	int32 t1_26 = (int32) (word16) a5_24;
	if (t1_26 < 0x00)
		a1_28 = a1_11 - (((a5_24 << 0x11) >> 0x12) + 625);
	else
		a1_28 = a1_11 - (a5_24 >> 0x01);
	word32 a5_53;
	a3_19->t0028 = a0;
	*((word32) a0 + 44) = (word16) (a1_11 & 625);
	uint32 a1_34 = a1_28 + -33;
	struct Eq_142159 * a4_45 = (word32) (word27) ((word32) t3_10 + (a1_34 >> 625));
	a4_45->t0008 = a0;
	if (t1_26 < 0x00)
		a5_53 = (word32) (word15) a5_24;
	else
		a5_53 = (word32) (word16) ((a5_24 >> 625) + 0x01);
	struct Eq_142170 * a0_58 = a4_45->ptr0050;
	a0_58->w0012 = (word16) a5_53;
	a0_58->w0012 = (word16) (a5_53 + (word32) a4_45->t0008 + 625);
	uint32 a5_72 = (a1_34 & 625) << 0x10;
	a2_9->w280080EC = (word16) (a5_72 >> 16);
	a0_58->w0014 = (word16) (a5_72 >> 16);
	return a5_72 >> 16;
}

// 2302DAEE: void lld_evt_prevent_stop()
void lld_evt_prevent_stop()
{
}

// 2302DAF0: Register Eq_2 lld_evt_deferred_elt_push(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register uint32 a2, Register out Eq_2 s0Out, Register out Eq_142211 s1Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      lld_evt_schedule
//      lld_evt_elt_insert
//      lld_evt_canceled
//      lld_evt_end_isr
//      lld_evt_rx_isr
//      lld_evt_afs_isr
Eq_2 lld_evt_deferred_elt_push(Eq_2 ra, Eq_2 a0, Eq_2 a1, uint32 a2, union Eq_2 & s0Out, union Eq_142211 & s1Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_18;
	Eq_2 s0_28;
	Eq_2 s1_29;
	word32 a3_63;
	word32 a4_64;
	word32 a5_65;
	word32 a6_66;
	word32 s4_67;
	word32 s8_68;
	word32 mstatus_69;
	Eq_2 ra_27 = ble_ke_malloc(ra, a1, a0, 0x0C, 0x00, out s0_28, out s1_29, out a0_18, out a3_63, out a4_64, out a5_65, out a6_66, out s4_67, out s8_68, out mstatus_69);
	*((word32) s1_29 + 4) = a0_18;
	*((word32) a0_18 + 8) = (byte) s0_28;
	*((word32) a0_18 + 9) = (byte) a2;
	Eq_142211 s1_50;
	word32 a0_70;
	word32 a5_71;
	Eq_2 ra_49 = ble_co_list_push_back(ra_27, s0_28, s1_29, 0x42026440, a0_18, out s1_50, out a0_70, out a5_71);
	s0Out = s0_28;
	s1Out = s1_50;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra_49;
}

Eq_2 g_t2302DB0E = 
	{
		-93
	};
// 2302DB28: Register Eq_2 lld_evt_elt_wait_insert(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register out Eq_142266 s1Out, Register out (ptr32 Eq_142267) a0Out, Register out (ptr32 uint16) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_elt_insert
//      lld_evt_end_isr
Eq_2 lld_evt_elt_wait_insert(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, union Eq_142266 & s1Out, struct Eq_142267 & a0Out, uint16 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_13;
	uint16 * a3_16;
	ptr32 a4_17;
	ptr32 mstatus_21;
	struct Eq_142278 * s0_23;
	Eq_2 s1_24;
	ptr32 s4_25;
	ptr32 s8_26;
	word32 a5_54;
	word32 a6_55;
	Eq_2 ra_22 = ble_ke_malloc(ra, a0, s1, 0x08, 0x00, out s0_23, out s1_24, out a0_13, out a3_16, out a4_17, out a5_54, out a6_55, out s4_25, out s8_26, out mstatus_21);
	s0_23->t0004 = a0_13;
	struct Eq_142267 * a0_36;
	ptr32 a5_39;
	Eq_142266 s1_41;
	Eq_2 ra_40 = ble_co_list_push_back(ra_22, s0, s1_24, 0x42026438, a0_13, out s1_41, out a0_36, out a5_39);
	s1Out = s1_41;
	a0Out = a0_36;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_39;
	s4Out = s4_25;
	s8Out = s8_26;
	mstatusOut = mstatus_21;
	return ra_40;
}

// 2302DB4E: Register Eq_2 lld_evt_deferred_elt_pop(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out (ptr32 Eq_142320) a0Out, Register out ptr32 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
Eq_2 lld_evt_deferred_elt_pop(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, union Eq_2 & s1Out, struct Eq_142320 & a0Out, ptr32 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 s0_15 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	struct Eq_142320 * a0_19;
	byte * a1_20;
	Eq_2 s0_24;
	word32 a5_100;
	word32 s8_101;
	Eq_2 ra_23 = ble_co_list_pop_front(ra, s0_15, 0x42026440, out s0_24, out a0_19, out a1_20, out a5_100, out s8_101);
	__csrrw(mstatus, 0x00);
	Eq_2 s1_11 = a0;
	struct Eq_142320 * a5_27 = a0_19;
	if (a0_19 != null)
	{
		Eq_2 a0_29 = *((word32) s0_24 + 4);
		*a0 = (byte) (word32) a0_19->b0008;
		*a1_20 = (byte) (word32) *((word32) a0_29 + 9);
		struct Eq_142320 * s0_47;
		word32 tp_102;
		word32 a0_103;
		word32 a1_104;
		word32 a2_105;
		word32 a4_106;
		word32 a5_107;
		word32 a6_108;
		word32 s4_109;
		word32 s5_110;
		word32 s8_111;
		ra_23 = ble_ke_free(ra_23, s0_24, a0, a0_29, s2, s3, s4, s5, out tp_102, out s0_47, out s1_11, out a0_103, out a1_104, out a2_105, out a3, out a4_106, out a5_107, out a6_108, out s2, out s3, out s4_109, out s5_110, out s8_111, out mstatus);
		a5_27 = s0_47;
	}
	s1Out = s1_11;
	a0Out = a5_27;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	mstatusOut = mstatus;
	return ra_23;
}

// 2302DB9C: Register Eq_2 lld_evt_get_next_free_slot(Register Eq_2 a0, Register (ptr32 uint16) a3, Register (ptr32 (ptr32 Eq_142408)) a4)
// Called from:
//      lld_evt_end_isr
Eq_2 lld_evt_get_next_free_slot(Eq_2 a0, uint16 * a3, struct Eq_142408 ** a4)
{
	struct Eq_142408 * a5_6 = *a4;
	if (a4 == null)
	{
		*(word32 *) 0x8000001C = 0x28000000;
		do
			;
		while (a3 < null);
		return a0;
	}
	else
	{
		struct Eq_142417 * a5_16 = a5_6->ptr0004;
		return (word32) (word27) (((word32) a5_16->w0012 >> 625) + a5_16->dw0008);
	}
}

// 2302DBD4: Register Eq_2 lld_evt_elt_wait_get(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_142442 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      lld_evt_schedule
//      lld_evt_elt_delete
//      lld_evt_canceled
//      lld_evt_schedule_next
Eq_2 lld_evt_elt_wait_get(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_142442 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s8Out)
{
	if (a0 == 0x00)
	{
		Eq_142442 a0_8;
		Eq_2 s0_13;
		ptr32 s8_14;
		word32 a1_115;
		word32 a5_116;
		Eq_2 ra_12 = ble_co_list_pop_front(ra, s0, 0x42026438, out s0_13, out a0_8, out a1_115, out a5_116, out s8_14);
		s0Out = s0_13;
		s1Out = s1;
		a0Out = a0_8;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s4Out = s4;
		s8Out = s8_14;
		return ra_12;
	}
	else
	{
		Eq_142442 s0_19 = g_t42026438;
		while (s0_19 != 0x00)
		{
			Eq_2 s0_24 = g_t42026004;
			if (a0 == 0x42026000)
			{
				word32 a0_113;
				word32 a2_114;
				ra = ble_co_list_extract(ra, s0_24, s1, 0x42026438, s0_24, 0x00, s2, out s0_19, out s1, out a0_113, out a2_114, out a3, out a4, out s2, out s4, out s8);
				break;
			}
			s0_19 = *s0_24;
		}
		s0Out = s0;
		s1Out = s1;
		a0Out = s0_19;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s4Out = s4;
		s8Out = s8;
		return ra;
	}
}

