pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302DC16: void lld_evt_schedule(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Stack word32 dwArg64, Stack ptr32 dwArg0118)
void lld_evt_schedule(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, word32 dwArg64, ptr32 dwArg0118)
{
	if (a0 == 0x00)
		return;
	word32 a3_434;
	word32 a4_435;
	word32 s8_436;
	Eq_2 a0_14;
	Eq_2 s2_26;
	Eq_2 s1_146;
	Eq_2 s4_203;
	Eq_2 s0_122;
	Eq_2 ra_18 = lld_evt_elt_wait_get(ra, a0, s1, *((word32) s1 + 8), s2, out s0_122, out s1_146, out a0_14, out a3_434, out a4_435, out s2_26, out s4_203, out s8_436);
	if (a0_14 != 0x00)
	{
		word32 mstatus_445;
		word32 a2_439;
		word32 a3_440;
		word32 s8_444;
		word32 a6_443;
		word32 a5_442;
		word32 a4_441;
		word32 tp_437;
		word32 a1_438;
		ra_18 = ble_ke_free(ra_18, s0_122, s1_146, a0_14, s2_26, s3, s4_203, s5, out tp_437, out s0_122, out s1_146, out a0_14, out a1_438, out a2_439, out a3_440, out a4_441, out a5_442, out a6_443, out s2_26, out s3, out s4_203, out s5, out s8_444, out mstatus_445);
	}
	word32 a5_50 = (word32) *((word32) s0_122 + 0x007B);
	if (a5_50 == 0x00 || a5_50 == 0x05)
	{
		if (((word32) *((word32) s0_122 + 0x007E) & 0x10) != 0x00)
			goto l2302DC44;
		word32 a4_71;
		ra_18 = llm_util_adv_data_update(ra_18, a0_14, s2_26, s3, s5, out s1_146, out a4_71, out s4_203);
		struct Eq_142598 * a5_87 = (word32) g_ptr42026474->b0021;
		if (a5_87 == null)
		{
			word32 a5_90 = a5_87 - a4_71;
			s0_122 = a5_87->t005C;
			word32 a4_91 = a5_90;
			if ((int32) (word16) a5_90 <= 0x00)
				a4_91 = 0x01;
			*(word16 *) 0x28008160 = (word16) a4_91;
		}
	}
	ui32 a4_101 = (word32) *((word32) s0_122 + 0x007B);
	if (a4_101 != 0x01)
	{
l2302DCFA:
		struct Eq_142634 * s1_153 = (s1_146 & 0x0F) + 0x0A002000 << 2;
		s1_153->w0000 = 0x00;
		if (((word32) *((word32) s0_122 + 0x007B) + ~0x02 & 0x00FF) <= 0x01)
			lld_util_dle_set_cs_fields((word32) *((word32) s0_122 + 116));
		((word16[]) 671121716)[(word32) *((word32) s0_122 + 116) / 2] = (word16) (word32) *((word32) s0_122 + 96);
		s1_153->w0000 = (word16) (word32) (word16) ((word32) (word16) (word32) s1_153->w0000 & -49);
		s1_153->w0000 = (word16) ((word32) (word16) (word32) s1_153->w0000 & ~0x0F | 2);
		s1_153->w0002 = (word16) (word32) *((word32) s0_122 + 118);
		Eq_2 s0_223;
		Eq_2 s1_224;
		Eq_2 ra_222 = lld_pdu_tx_prog(ra_18, s0_122, s4_203, dwArg64, dwArg0118, out s0_223, out s1_224);
		word32 s1_450;
		word32 a0_451;
		word32 a5_452;
		ble_co_list_push_back(ra_222, s0, s1_224, 0x42026430, s0_223, out s1_450, out a0_451, out a5_452);
		return;
	}
	ui32 a5_103 = (word32) *((word32) s0_122 + 0x007E);
	if ((a5_103 & 0x10) == 0x00)
	{
		int32 a5_109 = (int32) (word16) ((a5_103 & 0x10) - a4_101);
		int32 a4_110 = a5_109;
		if (a5_109 <= 0x00)
			a4_110 = 0x01;
		*(word16 *) 0x280081BC = (word16) a4_110;
		struct Eq_142675 * a5_120 = (word32) (word16) ((int32) (word16) a4_110 | 0xF8000000);
		*(word16 *) 0x280081B6 = (word16) a5_120;
		s0_122 = a5_120->t0004;
		if (a5_120 != null)
		{
			ui32 a3_123 = (word32) a5_120->w0078;
			s0_122 = *(union Eq_2 *) 0xF8000008;
			uint32 a5_133 = (word32) (word16) (a3_123 - ((word32) ((word27) (0xF8000000 - a5_120->dw0008)) & a3_123));
			if (a5_133 <= 0x05)
				a5_133 = (word32) (word16) (a5_133 + a3_123);
			*(word16 *) 0x280081BA = (word16) (word32) (word16) ((a5_133 >> 1) + ~0x00);
		}
		goto l2302DCFA;
	}
l2302DC44:
	word32 s4_448;
	word32 s8_449;
	word32 s0_446;
	word32 s1_447;
	lld_evt_deferred_elt_push(ra_18, s0_122, 0x01, 0x00, out s0_446, out s1_447, out s4_448, out s8_449);
}

Eq_2 g_t2302DC32 = 
	{
		-76
	};
// 2302DD8C: Register Eq_2 lld_evt_delete_elt_push(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a1, Register word32 a2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Register out (ptr32 Eq_142811) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s4Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
//      lld_evt_update_create
//      lld_evt_move_to_slave
//      lld_evt_end_isr
//      lld_scan_start
//      lld_con_stop
//      llm_end_evt_defer
Eq_2 lld_evt_delete_elt_push(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a1, word32 a2, ptr32 mstatus, Eq_2 dwArg10, struct Eq_142811 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s4Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 s1_13 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	if ((word32) *((word32) a0 + 0x007F) == 0x00)
	{
		Eq_2 a0_24;
		Eq_2 s1_35;
		word32 a3_115;
		word32 a4_116;
		word32 a5_117;
		word32 a6_118;
		word32 s4_119;
		word32 s8_120;
		Eq_2 ra_33 = ble_ke_malloc(ra, a0, s1_13, 0x0C, 0x00, out s0, out s1_35, out a0_24, out a3_115, out a4_116, out a5_117, out a6_118, out s4_119, out s8_120, out mstatus);
		*((word32) s0 + 4) = a0_24;
		*((word32) a0_24 + 8) = (byte) a1;
		*((word32) a0_24 + 9) = (byte) a2;
		*((word32) s0 + 0x007F) = 0x01;
		word32 a0_121;
		word32 a5_122;
		ra = ble_co_list_push_back(ra_33, s0, s1_35, 0x42026450, a0_24, out s1_13, out a0_121, out a5_122);
	}
	__csrrw(mstatus, 0x00);
	word32 a3_113;
	word32 a5_114;
	rwip_prevent_sleep_set(32, mstatus, out a3_113, out a5_114);
	ptr32 a0_72;
	ptr32 a1_73;
	ptr32 a2_74;
	ptr32 a3_75;
	ptr32 a4_76;
	ptr32 mstatus_78;
	struct Eq_142811 * s0_81;
	word32 t1_123;
	word32 a5_124;
	Eq_2 ra_79 = ble_ke_event_set(ra, s0, 0x09, dwArg10, out t1_123, out s0_81, out a0_72, out a1_73, out a2_74, out a3_75, out a4_76, out a5_124, out mstatus_78);
	s0Out = s0_81;
	s1Out = s1_13;
	a0Out = a0_72;
	a1Out = a1_73;
	a2Out = a2_74;
	a3Out = a3_75;
	a4Out = a4_76;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	mstatusOut = mstatus_78;
	return ra_79;
}

// 2302DDEE: void lld_evt_deffered_elt_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s9, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack word32 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack word32 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArg0128)
void lld_evt_deffered_elt_handler(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s9, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, word32 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, word32 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArg0128)
{
	byte bLoc22_464 = SLICE(s4, byte, 16);
	ptr32 mstatus_27;
	Eq_2 a0_40;
	word32 s4_537;
	word32 a0_533;
	word32 s1_534;
	word32 s2_535;
	word32 s3_536;
	struct Eq_141509 * a3_159;
	ptr32 mstatus_150;
	Eq_2 ra_114 = lld_evt_deferred_elt_pop(ble_ke_event_clear(ra, s0, 0x08, out a0_533, out mstatus_27), fp + -0x0022, s2, s3, s4, s5, mstatus_27, out s1_534, out a0_40, out a3_159, out s2_535, out s3_536, out s4_537, out mstatus_150);
	Eq_2 s0_115 = a0_40;
	Eq_2 s2_117 = 0x03;
	Eq_2 s3_343 = 0x04;
	Eq_2 s1_153 = 0x01;
	Eq_2 s4_334 = 0x02;
	while (s0_115 != 0x00)
	{
		Eq_2 a5_57 = (word32) bLoc22_464;
		Eq_2 s5_210 = (word32) s0_115 + 40;
		if (a5_57 == s2_117)
		{
			struct Eq_141729 * a3_181;
			Eq_2 s0_185 = llc_con_update_ind(ra_114, (word32) *((word32) s0_115 + 116), s0_115, a3_159, s5_210, dwLoc18, dwArgC8, out a3_181);
			ra_114 = llc_con_update_finished(ra_114, s0_185, (word32) *((word32) s0_185 + 116), a3_181, s5_210, dwArgB8, out s0_115, out s1_153, out s2_117, out s5_210, out mstatus_150);
			goto l2302DE50;
		}
		if (a5_57 == s3_343)
		{
			ra_114 = llc_map_update_finished(ra_114, s0_115, (word32) *((word32) s0_115 + 116), a3_159, dwArgB8, out s0_115, out s1_153, out s2_117, out mstatus_150);
			goto l2302DE50;
		}
		word32 a2_124;
		word32 a1_125;
		if (a5_57 == s1_153)
		{
			if (((word32) *((word32) s0_115 + 0x007E) & 0x10) == 0x00)
				goto l2302DE50;
			a2_124 = 0x01;
			a1_125 = 0x01;
			goto l2302DEA8;
		}
		if (a5_57 == s4_334)
		{
			__csrrs(mstatus_150, 0x00);
			struct Eq_15 * a5_65 = __csrrc(mstatus_150, 0x08);
			Eq_2 s0_66 = a5_65->dw0048;
			if (a5_65 != null)
			{
				Eq_2 a0_69;
				word32 s1_543;
				word32 a0_544;
				word32 s3_545;
				word32 s4_546;
				word32 s0_538;
				word32 a1_539;
				word32 a5_540;
				word32 s8_541;
				word32 s0_542;
				ra_114 = em_buf_tx_free(ble_co_list_pop_front(ra_114, s0_66, (word32) s0_66 + 72, out s0_538, out a0_69, out a1_539, out a5_540, out s8_541), a0_69, mstatus_150, out s0_542, out s1_543, out a0_544, out a5_65, out s2_117, out s3_545, out s4_546);
			}
			s0_115 = a5_65->dw0030;
			if (a5_65 != null)
			{
				Eq_2 a0_98;
				word32 s4_555;
				word32 a5_549;
				word32 s8_550;
				word32 s1_551;
				word32 a0_552;
				word32 a5_553;
				word32 s3_554;
				word32 s0_547;
				word32 a1_548;
				ra_114 = em_buf_tx_free(ble_co_list_pop_front(ra_114, s0_115, (word32) s0_115 + 48, out s0_547, out a0_98, out a1_548, out a5_549, out s8_550), a0_98, mstatus_150, out s0_115, out s1_551, out a0_552, out a5_553, out s2_117, out s3_554, out s4_555);
			}
			__csrrw(mstatus_150, 0x00);
			a2_124 = 0x00;
			a1_125 = 0x00;
l2302DEA8:
			word32 a3_559;
			word32 a4_560;
			word32 s4_561;
			word32 s8_562;
			word32 a0_556;
			word32 a1_557;
			word32 a2_558;
			ra_114 = lld_evt_delete_elt_push(ra_114, s0_115, s0_115, a1_125, a2_124, mstatus_150, s2, out s0_115, out s1_153, out a0_556, out a1_557, out a2_558, out a3_559, out a4_560, out s4_561, out s8_562, out mstatus_150);
		}
l2302DE50:
		word32 a0_231;
		Eq_2 s0_241;
		Eq_2 s1_242;
		ptr32 mstatus_239;
		Eq_2 s2_245;
		Eq_2 s3_246;
		Eq_2 s4_247;
		Eq_2 s5_248;
		Eq_2 ra_240 = lld_pdu_check(ra_114, s0_115, s1_153, s5_210, s2_117, s9, mstatus_150, dwLoc08, dwArg38, dwArg48, dwArg54, s5, dwArg68, dwArg78, dwArg88, dwArg98, out s0_241, out s1_242, out a0_231, out s2_245, out s3_246, out s4_247, out s5_248, out s9, out mstatus_239);
		if (s1_242 >= ((word32) bLoc22_464 + ~0x00 & 0x00FF) && a0_231 == 0x00)
		{
			Eq_2 a0_264 = (word32) *((word32) s0_241 + 116);
			if (s1_242 < (word32) ((word16) ((word32) a0_264 - 2)))
				ra_240 = llc_end_evt_defer(ra_240, a0_264, s2_245, s3_246, s5_248, dwArgB8, out s2_245, out s3_246, out s4_247, out mstatus_239);
			else
				ra_240 = llm_end_evt_defer(ra_240, s0_241, s1_242, s2_245, s3_246, s5_248, s6, dwArgB8, dwArgC8, out s2_245, out s3_246, out s4_247, out s5_248, out s9, out mstatus_239);
		}
		Eq_2 a0_337;
		ra_114 = lld_evt_deferred_elt_pop(ra_240, fp + -0x0022, s2_245, s3_246, s4_247, s5_248, mstatus_239, out s1_153, out a0_337, out a3_159, out s2_117, out s3_343, out s4_334, out mstatus_150);
		s0_115 = a0_337;
	}
	0x00 = dwArg0128;
}

// 2302DEEC: void lld_evt_channel_next(Register (ptr32 Eq_143247) a0, Register int32 a1)
// Called from:
//      lld_evt_schedule_next
//      lld_evt_move_to_master
//      lld_evt_move_to_slave
void lld_evt_channel_next(struct Eq_143247 * a0, int32 a1)
{
	int32 a4_12 = (word32) (word16) (word32) a0->w280080FA;
	ui32 a1_19 = (a4_12 >> 0x08 & 0x1F) + a1 + (a4_12 & 63);
	ui32 a1_20 = a1_19 | 37;
	if ((a1_19 | 37) < 0x00)
		a1_20 = (a1_19 | 37) + 37;
	a0->w280080FA = (word16) (word32) (word16) ((int32) (word16) a1_20 | (word32) ((word16) ((word32) a0->w280080FA)) & -64);
}

// 2302DF44: Register Eq_2 lld_evt_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgF8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      lld_init
Eq_2 lld_evt_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgA8, Eq_2 dwArgF8, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	g_t42026458.u1 = 0x00;
	g_b4202645A = 0x00;
	Eq_2 s1_224 = 0x42026000;
	Eq_2 s3_100 = 0x42026000;
	Eq_2 s2_225 = 0x42026000;
	if (a0 != 0x00)
	{
		ra = lld_util_flush_list(lld_util_flush_list(ra, 0x42026000, 0x42026440, 0x42026000, 0x42026000, s4, s5), 0x42026000, 0x42026448, 0x42026000, 0x42026000, s4, s5);
		Eq_2 s5_102 = __csrrs(mstatus, 0x00);
		__csrrc(mstatus, 0x08);
		Eq_2 s4_101 = 0x42026430;
		word32 s6_139 = 0x42026000;
		while (*s4_101 != 0x00 || *((word32) s4_101 + 8) != 0x00)
		{
			Eq_2 a0_59;
			word32 s0_545;
			word32 a5_547;
			word32 s8_548;
			word32 a1_546;
			ra = ble_co_list_pop_front(ra, s0, (word32) s1_224 + 0x0430, out s0_545, out a0_59, out a1_546, out a5_547, out s8_548);
			Eq_2 s0_106 = a0_59;
			if (a0_59 == 0x00)
			{
				word32 a0_71;
				Eq_2 s0_76;
				word32 a5_552;
				word32 s8_553;
				word32 a1_551;
				ra = ble_co_list_pop_front(ra, a0_59, s6_139 + 1080, out s0_76, out a0_71, out a1_551, out a5_552, out s8_553);
				if (a0_71 == 0x00)
					break;
				word32 tp_554;
				word32 a0_555;
				word32 a5_560;
				word32 a1_556;
				word32 a2_557;
				word32 a3_558;
				word32 a4_559;
				word32 a6_561;
				word32 s8_562;
				ra = ble_ke_free(ra, s0_76, s1_224, *((word32) s0_76 + 4), s2_225, s3_100, s4_101, s5_102, out tp_554, out s0_106, out s1_224, out a0_555, out a1_556, out a2_557, out a3_558, out a4_559, out a5_560, out a6_561, out s2_225, out s3_100, out s4_101, out s5_102, out s8_562, out mstatus);
				if (s0_106 == 0x00)
					break;
			}
			word32 s0_549;
			word32 s7_550;
			Eq_2 a0_118;
			Eq_2 s1_128;
			Eq_2 s2_129;
			Eq_2 s3_130;
			Eq_2 s4_131;
			Eq_2 s5_132;
			Eq_2 ra_126 = lld_pdu_tx_flush(ra, s0_106, (word32) s0_106 + 40, s4_101, s5_102, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArgF8, out s0_549, out s1_128, out a0_118, out s2_129, out s3_130, out s4_131, out s5_132, out s6_139, out s7_550);
			Eq_2 s0_145 = *((word32) a0_118 + 80);
			if (a0_118 != 0x00)
			{
				word32 a5_583;
				word32 tp_577;
				word32 a1_579;
				word32 s0_578;
				Eq_2 a0_146;
				Eq_2 s1_155;
				Eq_2 s2_156;
				Eq_2 s4_157;
				word32 a2_580;
				word32 a3_581;
				word32 a4_582;
				word32 a6_584;
				word32 s8_585;
				word32 mstatus_586;
				ra_126 = ble_ke_free(ea_interval_remove(ra_126, s0_145, s1_128, a0_118, s2_129, out s1_155, out a0_146, out s2_156, out s4_157), *((word32) a0_146 + 80), s1_155, a0_146, s2_156, s3_130, s4_157, s5_132, out tp_577, out s0_578, out s1_128, out a0_118, out a1_579, out a2_580, out a3_581, out a4_582, out a5_583, out a6_584, out s2_129, out s3_130, out s4_131, out s5_132, out s8_585, out mstatus_586);
			}
			Eq_2 s0_181 = *((word32) a0_118 + 4);
			if (a0_118 != 0x00)
			{
				word32 tp_596;
				word32 a0_597;
				word32 a1_598;
				word32 a2_599;
				word32 a3_600;
				word32 a4_601;
				word32 a5_602;
				word32 a6_603;
				word32 s8_604;
				word32 mstatus_605;
				ra_126 = ble_ke_free(ra_126, s0_181, s1_128, a0_118, s2_129, s3_130, s4_131, s5_132, out tp_596, out s0_181, out s1_128, out a0_597, out a1_598, out a2_599, out a3_600, out a4_601, out a5_602, out a6_603, out s2_129, out s3_130, out s4_131, out s5_132, out s8_604, out mstatus_605);
			}
			word32 tp_587;
			word32 a0_588;
			word32 a1_589;
			word32 a2_590;
			word32 a3_591;
			word32 a4_592;
			word32 a5_593;
			word32 a6_594;
			word32 s8_595;
			ra = ble_ke_free(ra_126, s0_181, s1_128, s0_181, s2_129, s3_130, s4_131, s5_132, out tp_587, out s0, out s1_224, out a0_588, out a1_589, out a2_590, out a3_591, out a4_592, out a5_593, out a6_594, out s2_225, out s3_100, out s4_101, out s5_102, out s8_595, out mstatus);
		}
		__csrrw(mstatus, 0x00);
		s0.u0 = 0x42026000;
		while (*((word32) s4_101 + 32) != 0x00)
		{
			word32 s8_574;
			word32 a6_573;
			word32 a1_568;
			Eq_2 a0_240;
			Eq_2 s0_245;
			word32 a4_571;
			word32 s8_565;
			word32 a1_563;
			word32 a5_564;
			word32 tp_566;
			word32 a0_567;
			word32 a5_572;
			word32 a3_570;
			word32 a2_569;
			ra = ble_ke_free(ble_co_list_pop_front(ra, s0, (byte) s0.u0 + 1104, out s0_245, out a0_240, out a1_563, out a5_564, out s8_565), s0_245, s1_224, a0_240, s2_225, s3_100, s4_101, s5_102, out tp_566, out s0, out s1_224, out a0_567, out a1_568, out a2_569, out a3_570, out a4_571, out a5_572, out a6_573, out s2_225, out s3_100, out s4_101, out s5_102, out s8_574, out mstatus);
		}
		word32 a3_575;
		rwip_prevent_sleep_clear(32, mstatus, out a3_575);
	}
	word32 a0_535;
	Eq_2 s1_315;
	word32 a0_537;
	word32 a0_539;
	word32 a1_540;
	word32 a1_538;
	word32 a1_542;
	word32 s4_544;
	word32 s0_543;
	word32 a1_536;
	word32 a0_541;
	Eq_2 ra_313 = ble_ke_event_callback_set(ble_co_list_init(ble_co_list_init(ble_co_list_init(ble_co_list_init(ra, s0, (word32) s1_224 + 0x0430, out a0_535, out a1_536), s0, (word32) s3_100 + 0x0440, out a0_537, out a1_538), s0, (word32) s2_225 + 0x0448, out a0_539, out a1_540), s0, &g_dw42026450, out a0_541, out a1_542), s0, s1_224, 0x08, 0x2302DDEE, out s0_543, out s1_315, out s4_544);
	0x00 = (int8) dwArgA8;
	word32 s4_576;
	ptr32 s0_339;
	ptr32 s1_340;
	Eq_2 ra_338 = ble_ke_event_callback_set(ra_313, s1, s1_315, 0x09, 0x2302E196, out s0_339, out s1_340, out s4_576);
	s0Out = s0_339;
	s1Out = s1_340;
	s2Out = s2_225;
	s3Out = s3_100;
	return ra_338;
}

// 2302E056: Register Eq_2 lld_evt_init_evt(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Register out ptr32 tpOut, Register out Eq_2 s1Out, Register out ptr32 a1Out)
// Called from:
//      lld_evt_scan_create
//      lld_evt_update_create
//      lld_evt_move_to_slave
//      lld_evt_adv_create
//      lld_con_start
//      lld_con_update_after_param_req
//      lld_con_update_ind
Eq_2 lld_evt_init_evt(Eq_2 ra, Eq_2 a0, ptr32 mstatus, ptr32 & tpOut, union Eq_2 & s1Out, ptr32 & a1Out)
{
	*((word32) a0 + 84) = (byte) (word32) g_b42025758;
	*((word32) a0 + 82) = 0x00;
	*((word32) a0 + 87) = 0x00;
	Eq_2 s1_19 = __csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	ptr32 a1_41;
	word32 a0_57;
	word32 a1_58;
	word32 a0_59;
	word32 a1_60;
	word32 a0_61;
	word32 a1_62;
	word32 a0_63;
	Eq_2 ra_44 = ble_co_list_init(ble_co_list_init(ble_co_list_init(ble_co_list_init(ra, a0, (word32) a0 + 8, out a0_57, out a1_58), a0, (word32) a0 + 16, out a0_59, out a1_60), a0, (word32) a0 + 24, out a0_61, out a1_62), a0, (word32) a0 + 32, out a0_63, out a1_41);
	__csrrw(mstatus, 0x00);
	tpOut = dwArg14;
	s1Out = s1_19;
	a1Out = a1_41;
	return ra_44;
}

