pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302E0A8: Register Eq_2 lld_evt_elt_delete(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_2) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_128173 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_143769 s7Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_delete_elt_handler
//      lld_adv_stop
//      lld_scan_stop
Eq_2 lld_evt_elt_delete(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, ptr32 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgE8, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_128173 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_143769 & s7Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_128173 a3_103;
	Eq_2 s0_118;
	__csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	Eq_2 s5_166 = a1;
	ptr32 s6_189 = a2;
	Eq_2 s3_112 = 0x42026000;
	Eq_2 a0_34;
	word32 s0_589;
	Eq_2 s1_282;
	Eq_2 ra_109 = ble_co_list_find(ra, s0, a0, 0x42026430, a0, out s0_589, out s1_282, out a0_34);
	if (a0_34 != 0x00)
	{
		*((word32) s1_282 + 0x007E) = (byte) ((word32) *((word32) s1_282 + 0x007E) | 16);
		word32 a5_590;
		rwip_prevent_sleep_set(32, mstatus, out a3_103, out a5_590);
		s0_118.u0 = 0x00;
		goto l2302E0F0;
	}
	Eq_2 s0_310 = a0_34;
	s7.u0 = 0x01;
	s2_303 = s2;
l2302E110:
	Eq_2 s2_303;
	Eq_2 a0_51;
	word32 s2_645;
	word32 s4_646;
	word32 s8_647;
	Eq_2 a4_104;
	ra_109 = lld_evt_elt_wait_get(ra_109, s0_310, s1_282, s1_282, s2_303, out s0_118, out s1_282, out a0_51, out a3_103, out a4_104, out s2_645, out s4_646, out s8_647);
	s2 = a0_51;
	if (s1_282 == 0x00)
	{
		if (a0_51 == 0x00)
			goto l2302E0F0;
	}
	else
	{
		if (s0_118 != 0x00)
			goto l2302E188;
		s0_118 = s1_282;
	}
	if (s6_189 != 0x00)
	{
		Eq_2 a1_77;
		Eq_143769 a1_73 = (word32) *((byte) s0_118.u0 + 116);
		if (s7 >= a1_73)
			a1_77 = (word32) (word16) (a1_73 << 8 | 1);
		else
			a1_77.u0 = 0x00;
		word32 t1_598;
		word32 s1_599;
		word32 s4_604;
		word32 a0_600;
		word32 a6_601;
		word32 a7_602;
		word32 s2_603;
		ra_109 = ble_ke_msg_send_basic(ra_109, s0_118, s1_282, 0x0200, a1_77, 0x02, a0_51, s3_112, s2, dwArg08, dwArgE8, out t1_598, out s0_118, out s1_599, out a0_600, out a3_103, out a4_104, out a6_601, out a7_602, out s2_603, out s3_112, out s4_604, out mstatus);
	}
	Eq_2 s1_139;
	Eq_2 s2_140;
	Eq_2 s0_157;
	word32 s8_593;
	word32 a2_594;
	word32 s4_592;
	word32 a4_591;
	word32 a3_595;
	word32 a4_596;
	word32 s8_597;
	Eq_2 a0_149;
	Eq_2 s1_158;
	Eq_2 s2_159;
	Eq_2 s4_160;
	Eq_2 ra_156 = ble_co_list_extract(ea_elt_remove(ra_109, s0_118, a3_103, a4_104, mstatus, dwLoc08, dwArg08, out s1_139, out a4_591, out s2_140, out s4_592, out s8_593), s0_118, s1_139, (word32) s3_112 + 0x0430, s0_118, 0x00, s2_140, out s0_157, out s1_158, out a0_149, out a2_594, out a3_595, out a4_596, out s2_159, out s4_160, out s8_597);
	if (s5_166 != 0x00)
	{
		word32 s0_605;
		ra_156 = lld_pdu_tx_flush(ra_156, s0_157, (word32) s0_157 + 40, s4_160, s5_166, mstatus, s2, s0, dwArg08, dwArgE8, out s0_605, out s1_158, out a0_149, out s2_159, out s3_112, out s4_160, out s5_166, out s6_189, out s7);
	}
	Eq_2 s0_197 = *((word32) a0_149 + 80);
	if (a0_149 != 0x00)
	{
		word32 a4_611;
		word32 mstatus_615;
		word32 a6_613;
		word32 s8_614;
		word32 a5_612;
		word32 a3_610;
		Eq_2 a0_201;
		Eq_2 s1_210;
		Eq_2 s2_211;
		Eq_2 s4_212;
		word32 tp_606;
		word32 a1_608;
		word32 a2_609;
		word32 s0_607;
		ra_156 = ble_ke_free(ea_interval_remove(ra_156, s0_197, s1_158, a0_149, s2_159, out s1_210, out a0_201, out s2_211, out s4_212), *((word32) a0_201 + 80), s1_210, a0_201, s2_211, s3_112, s4_212, s5_166, out tp_606, out s0_607, out s1_158, out a0_149, out a1_608, out a2_609, out a3_610, out a4_611, out a5_612, out a6_613, out s2_159, out s3_112, out s4_160, out s5_166, out s8_614, out mstatus_615);
	}
	Eq_2 s0_238 = *((word32) a0_149 + 4);
	if (a0_149 != 0x00)
	{
		word32 mstatus_633;
		word32 tp_624;
		word32 a1_626;
		word32 a2_627;
		word32 a0_625;
		word32 a6_631;
		word32 a3_628;
		word32 a4_629;
		word32 a5_630;
		word32 s8_632;
		ra_156 = ble_ke_free(ra_156, s0_238, s1_158, a0_149, s2_159, s3_112, s4_160, s5_166, out tp_624, out s0_238, out s1_158, out a0_625, out a1_626, out a2_627, out a3_628, out a4_629, out a5_630, out a6_631, out s2_159, out s3_112, out s4_160, out s5_166, out s8_632, out mstatus_633);
	}
	word32 a0_617;
	word32 a1_618;
	word32 tp_616;
	word32 a5_621;
	word32 a4_620;
	word32 a2_619;
	word32 a6_622;
	word32 s8_623;
	Eq_2 s0_281;
	Eq_2 s4_285;
	ra_109 = ble_ke_free(ra_156, s0_238, s1_158, s0_238, s2_159, s3_112, s4_160, s5_166, out tp_616, out s0_281, out s1_282, out a0_617, out a1_618, out a2_619, out a3_103, out a4_620, out a5_621, out a6_622, out s2, out s3_112, out s4_285, out s5_166, out s8_623, out mstatus);
	if (s2 != 0x00)
	{
		word32 tp_634;
		word32 s0_635;
		word32 a0_636;
		word32 a1_637;
		word32 a2_638;
		word32 a3_639;
		word32 a4_640;
		word32 a5_641;
		word32 a6_642;
		word32 s4_643;
		word32 s8_644;
		ra_109 = ble_ke_free(ra_109, s0_281, s1_282, s2, s2, s3_112, s4_285, s5_166, out tp_634, out s0_635, out s1_282, out a0_636, out a1_637, out a2_638, out a3_639, out a4_640, out a5_641, out a6_642, out s2_303, out s3_112, out s4_643, out s5_166, out s8_644, out mstatus);
		s0_310.u0 = 0x01;
		goto l2302E110;
	}
l2302E188:
	s0_118.u0 = 0x01;
l2302E0F0:
	__csrrw(mstatus, 0x00);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_282;
	a0Out = s0_118;
	a3Out = a3_103;
	s2Out = s2;
	s3Out = s3_112;
	s4Out = dwArg78;
	s5Out = s5_166;
	s6Out = s6_189;
	s7Out = s7;
	s8Out = s5;
	mstatusOut = mstatus;
	return ra_109;
}

// 2302E196: void lld_evt_delete_elt_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108)
void lld_evt_delete_elt_handler(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 dwArgC8, Eq_2 dwArg0108)
{
	Eq_2 a0_104;
	ptr32 mstatus_111;
	Eq_2 ra_112 = ble_ke_event_clear(ra, s0, 0x09, out a0_104, out mstatus_111);
	__csrrs(mstatus_111, 0x00);
	__csrrc(mstatus_111, 0x08);
	__csrrw(mstatus_111, 0x00);
	Eq_2 s2_115 = 0x01;
	Eq_2 s1_114 = 0x42026430;
	Eq_2 s3_116 = 0x42026000;
	while (s0 != 0x00)
	{
		Eq_2 s0_37 = *((word32) a0_104 + 4);
		if (a0_104 != 0x00)
		{
			word32 s7_276;
			word32 s8_277;
			word32 s5_274;
			word32 s6_275;
			word32 s2_272;
			word32 s4_273;
			word32 a3_271;
			ra_112 = lld_evt_elt_delete(ra_112, s0_37, a0_104, (word32) *((word32) s0_37 + 8), (word32) *((word32) s0_37 + 9), s2_115, mstatus_111, s2, dwArgC8, dwArg0108, out s0_37, out s1_114, out a0_104, out a3_271, out s2_272, out s3_116, out s4_273, out s5_274, out s6_275, out s7_276, out s8_277, out mstatus_111);
			s2_115 = a0_104;
		}
		Eq_2 s4_117 = *s0_37;
		if (s2_115 != 0x00)
		{
			Eq_2 s5_79 = __csrrs(mstatus_111, 0x00);
			__csrrc(mstatus_111, 0x08);
			Eq_2 s0_97;
			Eq_2 s1_98;
			Eq_2 s2_99;
			Eq_2 s4_100;
			word32 a3_280;
			word32 s8_282;
			word32 a4_281;
			word32 a0_278;
			word32 a2_279;
			Eq_2 ra_96 = ble_co_list_extract(ra_112, s0_37, s1_114, (word32) s3_116 + 1104, s0_37, 0x00, s2_115, out s0_97, out s1_98, out a0_278, out a2_279, out a3_280, out a4_281, out s2_99, out s4_100, out s8_282);
			__csrrw(mstatus_111, 0x00);
			word32 s0_284;
			word32 tp_283;
			word32 a1_285;
			word32 a2_286;
			word32 a4_288;
			word32 a6_290;
			word32 a5_289;
			word32 a3_287;
			word32 s5_291;
			word32 s8_292;
			ra_112 = ble_ke_free(ra_96, s0_97, s1_98, s0_97, s2_99, s3_116, s4_100, s5_79, out tp_283, out s0_284, out s1_114, out a0_104, out a1_285, out a2_286, out a3_287, out a4_288, out a5_289, out a6_290, out s2_115, out s3_116, out s4_117, out s5_291, out s8_292, out mstatus_111);
		}
		else
		{
			__csrrs(mstatus_111, 0x00);
			__csrrc(mstatus_111, 0x08);
			__csrrw(mstatus_111, 0x00);
		}
		s0 = s4_117;
	}
	__csrrs(mstatus_111, 0x00);
	if (__csrrc(mstatus_111, 0x08) == null)
	{
		word32 a3_270;
		rwip_prevent_sleep_clear(32, mstatus_111, out a3_270);
	}
	__csrrw(mstatus_111, 0x00);
}

