pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302E242: Register uint32 lld_evt_drift_compute(Register uint32 a0, Register uint32 a1, Register out ptr32 a4Out)
// Called from:
//      lld_evt_rxwin_compute
//      lld_evt_schedule_next
//      lld_evt_move_to_slave
//      lld_con_update_ind
uint32 lld_evt_drift_compute(uint32 a0, uint32 a1, ptr32 & a4Out)
{
	ptr32 a4_14 = (word32) g_a230B4F10[a1 * 0x02];
	uint32 a0_20 = (word32) g_a230B4F10[(word32) g_t42026458 * 0x02] + a4_14 + a0 + 41 >> 16;
	a4Out = a4_14;
	return a0_20;
}

// 2302E274: void lld_evt_rxwin_compute(Register Eq_2 a0)
// Called from:
//      lld_evt_schedule_next
void lld_evt_rxwin_compute(Eq_2 a0)
{
	word32 a4_43;
	struct Eq_144266 * a0_17 = lld_evt_drift_compute((word32) (word16) ((word32) *((word32) a0 + 98) + 0x01 + (word32) (*((word32) a0 + 0x0078))), (word32) *((word32) a0 + 110), out a4_43);
	struct Eq_144288 * a5_21 = (word32) *((word32) a0 + 116);
	a0_17->t0058 = a0;
	word32 a1_27 = (word32) *((word32) a0 + 113);
	struct Eq_142008 * a5_31 = (word32) a5_21->w280080FE;
	a5_31->t0054 = a0;
	lld_evt_winsize_change(a1_27, (struct Eq_142007 *) 0x280080A2, a5_31);
}

// 2302E2C6: Register Eq_2 lld_evt_restart(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register word32 s8, Register ptr32 s9, Register Eq_2 s10, Stack word32 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_144334) a0Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_144338 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out Eq_2 s10Out)
// Called from:
//      lld_evt_elt_insert
//      lld_evt_canceled
//      lld_evt_end_isr
Eq_2 lld_evt_restart(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, word32 s8, ptr32 s9, Eq_2 s10, word32 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_144334 & a0Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_144338 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, union Eq_2 & s10Out)
{
	Eq_144338 s5_29 = (word32) *((word32) a0 + 0x007B);
	if (s5_29 > 0x04)
	{
		struct Eq_144334 * a0_35 = ((word32) *((word32) a0 + 0x007E) >> 4 ^ 1) & 0x01;
		0x00 = (int8) dwArg0128;
		0x00 = dwArg1C;
		s0Out = s4;
		s1Out = s1;
		a0Out = a0_35;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5_29;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	else
	{
		<anonymous> * a5_51 = *((char *) g_a230B57F4 + s5_29 * 0x04);
		Eq_2 s0_56;
		Eq_2 ra_57;
		Eq_2 s1_58;
		Eq_2 s2_59;
		Eq_2 s3_60;
		Eq_144338 s5_62;
		ptr32 s6_63;
		ptr32 s7_64;
		ptr32 s9_66;
		Eq_2 s10_67;
		struct Eq_144334 * a0_68;
		ptr32 a4_70;
		a5_51();
		s0Out = s0_56;
		s1Out = s1_58;
		a0Out = a0_68;
		a4Out = a4_70;
		s2Out = s2_59;
		s3Out = s3_60;
		s5Out = s5_62;
		s6Out = s6_63;
		s7Out = s7_64;
		s9Out = s9_66;
		s10Out = s10_67;
		return ra_57;
	}
}

// 2302EAA0: Register Eq_2 lld_evt_elt_insert(Register Eq_2 ra, Register Eq_2 a0, Register Eq_128173 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_canceled
//      lld_evt_schedule_next
//      lld_evt_end_isr
//      lld_adv_start
//      lld_scan_start
//      lld_con_start
//      lld_move_to_master
//      lld_move_to_slave
//      lld_test_mode_tx
//      lld_test_mode_rx
Eq_2 lld_evt_elt_insert(Eq_2 ra, Eq_2 a0, Eq_128173 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArg0108, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s0_15 = a0;
	do
	{
		Eq_2 a0_27;
		Eq_2 s0_35;
		Eq_2 s1_36;
		Eq_2 s10_37;
		Eq_2 s2_39;
		Eq_2 s3_40;
		Eq_2 s4_41;
		ptr32 s5_42;
		ptr32 s6_43;
		ptr32 s7_44;
		word32 s8_45;
		ptr32 s9_46;
		Eq_2 ra_34 = ea_elt_insert(ra, s0_15, a3, mstatus, dwArg04, dwArg9C, dwArgEC, out s0_35, out s1_36, out a0_27, out a3, out s2_39, out s3_40, out s4_41, out s5_42, out s6_43, out s7_44, out s8_45, out s9_46, out s10_37);
		if (a0_27 != s1_36)
		{
			Eq_2 s1_125 = __csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			ptr32 a0_128;
			ptr32 a3_131;
			ptr32 a4_132;
			ptr32 a5_133;
			ptr32 mstatus_136;
			ptr32 s1_138;
			word32 s4_255;
			word32 s8_256;
			Eq_2 ra_137 = lld_evt_elt_wait_insert(ra_34, s0_35, s1_125, s0_35, out s1_138, out a0_128, out a3_131, out a4_132, out a5_133, out s4_255, out s8_256, out mstatus_136);
			__csrrw(mstatus_136, 0x00);
			s0Out = s0_35;
			s1Out = s1_138;
			a0Out = a0_128;
			a3Out = a3_131;
			a4Out = a4_132;
			a5Out = a5_133;
			s2Out = s2_39;
			s3Out = s3_40;
			s4Out.u0 = <invalid>;
			s5Out = s5_42;
			s6Out = s6_43;
			s7Out = s7_44;
			s8Out.u0 = <invalid>;
			s9Out = s9_46;
			s10Out = s10_37;
			mstatusOut = mstatus_136;
			return ra_137;
		}
		if (s2_39 != 0x00)
		{
			Eq_2 a5_52 = (word32) *((word32) s0_35 + 22);
			if (s3_40 >= a5_52)
				*((word32) s0_35 + 22) = (byte) ((word32) a5_52 + 1);
		}
		word32 a0_68;
		ptr32 s5_74;
		Eq_2 s10_82;
		Eq_2 s2_83;
		Eq_2 s3_84;
		ptr32 s6_85;
		ptr32 s7_86;
		ptr32 s9_87;
		word32 s1_257;
		word32 a4_258;
		ra = lld_evt_restart(ra_34, s1_36, s0_35, 0x01, s2_39, s3_40, s4_41, s8_45, s9_46, s10_37, dwLoc04, dwArg18, dwArg58, dwArg78, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, out s0_15, out s1_257, out a0_68, out a4_258, out s2_83, out s3_84, out s5_74, out s6_85, out s7_86, out s9_87, out s10_82);
	} while (a0_68 != 0x00);
	Eq_2 s0_101;
	ptr32 s1_102;
	word32 s4_259;
	word32 s8_260;
	Eq_2 ra_100 = lld_evt_deferred_elt_push(ra, s0_15, 0x01, 0x00, out s0_101, out s1_102, out s4_259, out s8_260);
	ptr32 a0_115;
	ptr32 a3_118;
	ptr32 a4_119;
	ptr32 a5_120;
	ptr32 mstatus_121;
	Eq_2 s0_124;
	word32 t1_261;
	word32 a1_262;
	word32 a2_263;
	Eq_2 ra_122 = ble_ke_event_set(ra_100, s0_101, 0x08, dwArg10, out t1_261, out s0_124, out a0_115, out a1_262, out a2_263, out a3_118, out a4_119, out a5_120, out mstatus_121);
	s0Out = s0_124;
	s1Out = s1_102;
	a0Out = a0_115;
	a3Out = a3_118;
	a4Out = a4_119;
	a5Out = a5_120;
	s2Out = s2_83;
	s3Out = s3_84;
	s4Out.u0 = <invalid>;
	s5Out = s5_74;
	s6Out = s6_85;
	s7Out = s7_86;
	s8Out.u0 = <invalid>;
	s9Out = s9_87;
	s10Out = s10_82;
	mstatusOut = mstatus_121;
	return ra_122;
}

// 2302EB16: void lld_evt_canceled(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack word32 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF0, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void lld_evt_canceled(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, word32 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC4, Eq_2 dwArgD4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArgF0, Eq_2 dwArgF4, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 a0_12;
	word32 a4_266;
	Eq_2 s0_17;
	Eq_2 s1_23;
	Eq_2 s2_24;
	Eq_2 s4_25;
	word32 s8_18;
	Eq_128173 a3_136;
	Eq_2 ra_16 = lld_evt_elt_wait_get(ra, a0, s1, a0, s2, out s0_17, out s1_23, out a0_12, out a3_136, out a4_266, out s2_24, out s4_25, out s8_18);
	if (a0_12 != 0x00)
	{
		word32 a5_272;
		word32 a4_271;
		word32 s5_274;
		word32 a6_273;
		word32 a2_270;
		word32 tp_267;
		word32 a0_268;
		word32 a1_269;
		ra_16 = ble_ke_free(ra_16, s0_17, s1_23, a0_12, s2_24, s3, s4_25, s5, out tp_267, out s0_17, out s1_23, out a0_268, out a1_269, out a2_270, out a3_136, out a4_271, out a5_272, out a6_273, out s2_24, out s3, out s4_25, out s5_274, out s8_18, out mstatus);
	}
	up32 a5_48 = (word32) *((word32) s0_17 + 22);
	if (a5_48 <= 0x1E)
		*((word32) s0_17 + 22) = (byte) (a5_48 + 0x01);
	word32 a4_276;
	word32 s1_275;
	word32 s3_278;
	word32 s2_277;
	word32 s5_279;
	word32 s6_280;
	word32 a0_76;
	Eq_2 s0_80;
	word32 s7_281;
	word32 s9_282;
	word32 s10_283;
	Eq_2 ra_88 = lld_evt_restart(ra_16, s1_23, s0_17, 0x01, s2_24, s3, s4_25, s8_18, s9, s10, dwArg0C, dwArg28, dwArg68, dwArg88, dwArgA8, dwArgD4, dwArgF0, dwArgF4, dwArg0118, out s0_80, out s1_275, out a0_76, out a4_276, out s2_277, out s3_278, out s5_279, out s6_280, out s7_281, out s9_282, out s10_283);
	if (a0_76 == 0x00)
	{
		word32 s0_284;
		word32 s1_285;
		word32 s4_286;
		word32 s8_287;
		Eq_2 ra_108 = lld_evt_deferred_elt_push(ra_88, s0_80, 0x01, 0x00, out s0_284, out s1_285, out s4_286, out s8_287);
		word32 t1_304;
		word32 s0_305;
		word32 a0_306;
		word32 a1_307;
		word32 a2_308;
		word32 a3_309;
		word32 a4_310;
		word32 a5_311;
		word32 mstatus_312;
		ble_ke_event_set(ra_108, s0, 0x08, dwArg10, out t1_304, out s0_305, out a0_306, out a1_307, out a2_308, out a3_309, out a4_310, out a5_311, out mstatus_312);
	}
	else
	{
		word32 s0_288;
		word32 s1_289;
		word32 a0_290;
		word32 a3_291;
		word32 a4_292;
		word32 a5_293;
		word32 s2_294;
		word32 s3_295;
		word32 s4_296;
		word32 s5_297;
		word32 s6_298;
		word32 s7_299;
		word32 s8_300;
		word32 s9_301;
		word32 s10_302;
		word32 mstatus_303;
		lld_evt_elt_insert(ra_88, s0_80, a3_136, mstatus, dwArg04, dwArg10, dwArg18, dwArg58, dwArg78, dwArg98, dwArg9C, dwArgC4, dwArgE0, dwArgE4, dwArgEC, dwArg0108, out s0_288, out s1_289, out a0_290, out a3_291, out a4_292, out a5_293, out s2_294, out s3_295, out s4_296, out s5_297, out s6_298, out s7_299, out s8_300, out s9_301, out s10_302, out mstatus_303);
	}
}

Eq_2 g_t2302EB3A = 
	{
		0x0022
	};
// 2302EB66: Register Eq_2 lld_evt_schedule_next(Register Eq_2 ra, Register Eq_2 a0, Register Eq_128173 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_144760 a4Out, Register out Eq_144761 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_llcp_send
//      llc_hci_acl_data_tx_handler
Eq_2 lld_evt_schedule_next(Eq_2 ra, Eq_2 a0, Eq_128173 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_144760 & a4Out, union Eq_144761 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_123;
	word32 a5_594;
	struct Eq_128275 * a0_21 = ea_time_get_halfslot_rounded(a0, a3, out a5_594);
	Eq_144760 a4_119 = (word32) *((word32) a0 + 0x007B);
	s1_123 = s1;
	if (a4_119 == 0x04)
	{
		ui32 a3_26 = (word32) *((word32) a0 + 0x007E);
		s1_123 = s1;
		if ((int32) (byte) a3_26 < 0x00)
		{
			ui32 s2_33 = a0_21 + (word32) (*((word32) a0 + 25)) / 0x0C;
			s3 = (word32) *((word32) a0 + 0x0078);
			ui32 a4_35 = (word32) s3 + (s2_33 & 0x07FFFFFF);
			ui32 a4_38 = a4_35 - (a4_35 & 0x07FFFFFF);
			s1_123.u0 = 0x08000000;
			s2 = s2_33 & 0x07FFFFFF;
			a4_119 = a4_38 & 0x07FFFFFF;
			if ((a4_38 & 0x07FFFFFF) <= 0x0030BB00)
			{
				ui32 s1_43 = 0x08000000 - (s2_33 & 0x07FFFFFF);
				s1_123 = s1_43 & 0x07FFFFFF;
				if ((s1_43 & 0x07FFFFFF) >= s3)
				{
					s5 = __csrrs(mstatus, 0x00);
					struct Eq_15 * a5_47 = __csrrc(mstatus, 0x08);
					Eq_2 s0_48 = a5_47->t0040;
					if (a5_47 != null)
						*((word32) s0_48 + 0x007E) = (byte) (a3_26 | 4);
					word32 a0_57;
					Eq_2 s0_104;
					ra = ble_co_list_find(ra, s0_48, s1_43 & 0x07FFFFFF, 0x42026430, s0_48, out s0_104, out s1_123, out a0_57);
					word32 s4_125 = a0_57;
					if (a0_57 == 0x00)
					{
						Eq_2 a0_70;
						Eq_2 s1_81;
						Eq_2 s2_82;
						Eq_2 s4_83;
						word32 s8_595;
						Eq_2 a4_109;
						Eq_128173 a3_110;
						Eq_2 ra_106 = lld_evt_elt_wait_get(ra, s0_104, s1_123, s0_104, s2_33 & 0x07FFFFFF, out s0_104, out s1_81, out a0_70, out a3_110, out a4_109, out s2_82, out s4_83, out s8_595);
						if (a0_70 != 0x00)
						{
							word32 s1_598;
							word32 s2_604;
							word32 a1_600;
							word32 a0_599;
							word32 tp_597;
							word32 a6_603;
							word32 a2_601;
							word32 a5_602;
							word32 s4_605;
							word32 s8_606;
							ra_106 = ble_ke_free(ra_106, s0_104, s1_81, a0_70, s2_82, s3, s4_83, s5, out tp_597, out s0_104, out s1_598, out a0_599, out a1_600, out a2_601, out a3_110, out a4_109, out a5_602, out a6_603, out s2_604, out s3, out s4_605, out s5, out s8_606, out mstatus);
						}
						word32 s8_596;
						ra = ea_elt_remove(ra_106, s0_104, a3_110, a4_109, mstatus, dwArg08, dwArg18, out s1_123, out a4_119, out s2, out s4_125, out s8_596);
					}
					__csrrw(mstatus, 0x00);
					if (s4_125 == 0x00)
					{
						struct Eq_144922 * s1_146 = s1_123 >> s3;
						struct Eq_143247 * a0_149 = (word32) *((word32) s0_104 + 116);
						Eq_2 s0_152 = s1_146->t0029;
						Mem161[CONVERT(SLICE(s1_146 + 1 - ((s1_146 + 1) + CONVERT(Mem114[s0_104 + 0x0078:uint16], uint16, word32)), word27, 0), word27, word32) + 40:word32] = s0_152;
						uint32 s1_154 = (word32) (word16) s1_146;
						*((word32) s0_152 + 96) = (word16) ((word32) *((word32) s0_152 + 96) + ~0x00 - s1_154);
						lld_evt_channel_next(a0_149, (int32) (word16) (0x00 - s1_154));
						uint32 a1_171 = (word32) *((word32) s0_152 + 110);
						*((word32) s0_152 + 0x007E) = (byte) ((word32) *((word32) s0_152 + 0x007E) & 0x007F);
						word32 a4_607;
						struct Eq_144266 * a0_175 = lld_evt_drift_compute(s1_154, a1_171, out a4_607);
						struct Eq_144988 * a4_179 = (word32) *((word32) s0_152 + 116);
						word32 a5_187 = (word32) (word16) (word32) a4_179->w280080FE;
						if ((int32) (word16) a5_187 < 0x00)
							a5_187 = (word32) (word15) a5_187 + 625;
						struct Eq_145004 * a0_197 = a5_187 - (a0_175 << 1);
						if (a0_197 > (struct Eq_145004 *) 0x0D)
						{
							if (a0_197 >= (struct Eq_145004 *) 0x04000000)
								a0_197 = a0_197 + 624 >>u 625 | 0x08000000;
						}
						else
							a0_197 = (struct Eq_145004 *) 0x0E;
						a4_179->w280080FE = (word16) (word32) (word16) a0_197;
						uint32 s4_214 = (word32) *((word32) s0_152 + 0x0078);
						a0_197->t0054 = s0_152;
						while (true)
						{
							struct Eq_145102 * a5_229 = lld_evt_slave_time_compute(s0_152, s4_214);
							s0_152 = a5_229->t0008;
							if ((s2 - a5_229 & 0x07FFFFFF) > 0x0030BB00)
								break;
							*((word32) s0_152 + 98) = (word16) ((word32) *((word32) s0_152 + 98) + 0x01);
							lld_evt_rxwin_compute(s0_152);
						}
						word32 a1_242 = (word32) *((word32) s0_152 + 98);
						struct Eq_143247 * a0_244 = (word32) *((word32) s0_152 + 116);
						*((word32) s0_152 + 96) = (word16) ((word32) *((word32) s0_152 + 96) + a1_242 + 0x01);
						lld_evt_channel_next(a0_244, (int32) (word16) a1_242);
						ui32 a5_255 = (word32) *((word32) s0_152 + 0x007E);
						Eq_128173 a3_256 = (word32) *((word32) s0_152 + 96);
						uint32 a4_259 = (word32) *((word32) s0_152 + 92) + ~0x00 << 16;
						*((word32) s0_152 + 0x007E) = (byte) (a5_255 & 0x00F7);
						if (a3_256 == a4_259 >> 16 && (word32) (*((word32) s0_152 + 0x006D)) != 0x00)
							*((word32) s0_152 + 0x007E) = (byte) (a5_255 & 0x00F7 | 8);
						Eq_144760 a4_288;
						ptr32 mstatus_292;
						Eq_2 s0_294;
						Eq_2 s1_295;
						Eq_144761 s2_298;
						Eq_2 s3_299;
						Eq_2 s4_300;
						Eq_2 s5_301;
						ptr32 s6_302;
						ptr32 s7_303;
						word32 a0_608;
						word32 a3_609;
						word32 s10_613;
						word32 a5_610;
						word32 s9_612;
						word32 s8_611;
						Eq_2 ra_293 = lld_evt_elt_insert(ra, s0_152, a3_256, mstatus, dwArg04, dwArg10, dwArg18, dwArg58, dwArg78, dwArg98, dwArg9C, dwArgC4, dwArgE0, dwArgE4, dwArgEC, dwArg0108, out s0_294, out s1_295, out a0_608, out a3_609, out a4_288, out a5_610, out s2_298, out s3_299, out s4_300, out s5_301, out s6_302, out s7_303, out s8_611, out s9_612, out s10_613, out mstatus_292);
						s0Out = s0_294;
						s1Out = s1_295;
						a4Out = a4_288;
						s2Out = s2_298;
						s3Out = s3_299;
						s4Out = s4_300;
						s5Out = s5_301;
						s6Out = s6_302;
						s7Out = s7_303;
						mstatusOut = mstatus_292;
						return ra_293;
					}
				}
			}
		}
	}
	s0Out = s1;
	s1Out = s1_123;
	a4Out = a4_119;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

