pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302ED70: Register Eq_2 lld_evt_scan_create(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register out ptr32 mstatusOut)
// Called from:
//      lld_scan_start
Eq_2 lld_evt_scan_create(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 & mstatusOut)
{
	Eq_128173 a3_17;
	ptr32 mstatus_22;
	Eq_2 a0_30;
	word32 a1_34;
	word32 s1_38;
	word32 s0_96;
	word32 s1_97;
	word32 a4_98;
	word32 a6_99;
	word32 s4_100;
	word32 s8_101;
	word32 tp_102;
	Eq_2 ra_37 = lld_evt_init_evt(ea_elt_create(ra, s0, a0, 88, out s0_96, out s1_97, out a0_30, out a3_17, out a4_98, out a6_99, out s4_100, out s8_101, out mstatus_22), (word32) a0_30 + 40, mstatus_22, out tp_102, out s1_38, out a1_34);
	*((word32) a0_30 + 0x007B) = 0x01;
	*((word32) a0_30 + 116) = (word16) s1_38;
	*((word32) a0_30 + 94) = (word16) (a1_34 + 0x01);
	*((word32) a0_30 + 118) = (word16) (s1_38 + 0x00EA);
	Eq_2 a0_54 = lld_util_priority_set(a0_30, 0x00);
	g_t2302DC32 = a0_30;
	g_t2302EB3A = a0_30;
	g_t2302DB0E = a0_30;
	*((word32) a0_30 + 18) = ~0x063B;
	*((word32) a0_30 + 16) = (word16) ((word32) g_b230B4F01 & 0x0F | 0x06000050);
	*((word32) a0_30 + 23) = 0x00;
	*((word32) a0_30 + 24) = 0x0200;
	word32 a5_103;
	ea_time_get_halfslot_rounded(a0_54, a3_17, out a5_103)->t0008 = a0_30;
	mstatusOut = mstatus_22;
	return ra_37;
}

// 2302EE14: Register Eq_2 lld_evt_move_to_master(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack word32 dwArg0198, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_move_to_master
Eq_2 lld_evt_move_to_master(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 dwArg98, Eq_2 dwArgD8, word32 dwArg0198, ptr32 & s0Out, union Eq_2 & a0Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_39;
	word32 a0_344;
	word32 a1_345;
	Eq_2 ra_40 = ea_interval_create(ra, a0, s1, out a0_344, out a1_345, out mstatus_39);
	*((word32) a0 + 4) = 0x00;
	Eq_2 a0_59;
	Eq_128173 a3_62;
	ptr32 mstatus_67;
	ui32 s1_69;
	Eq_2 s3_73;
	ui32 s4_74;
	Eq_2 s5_75;
	struct Eq_143247 * s6_76;
	ui32 s7_77;
	int32 s8_78;
	word32 s2_346;
	Eq_2 ra_68 = lld_scan_stop(ra_40, a0, s2, mstatus_39, dwArg98, dwArgD8, out s1_69, out a0_59, out a3_62, out s2_346, out s3_73, out s4_74, out s5_75, out s6_76, out s7_77, out s8_78, out mstatus_67);
	word32 a5_347;
	struct Eq_128275 * a0_85 = ea_time_get_halfslot_rounded(a0_59, a3_62, out a5_347);
	ui32 s1_90 = s1_69 & s4_74;
	ui32 a5_112 = ((word32) *((word32) a0 + 44) + (((word32) (((word32) a3_62 + 0x0E) + s8_78) >> 8) << 3) + 1166 >> 625) + 0x0270 & 0x07FFFFFF;
	ui32 s0_117 = s4_74 + a5_112 - ((a5_112 - s1_90 & 0x07FFFFFF) & s4_74);
	ui32 a3_119 = (s0_117 & 0x07FFFFFF) - a5_112;
	Eq_145372 s7_94 = s7_77 << 0x0011 >> 0x10;
	word32 s2_98 = (word32) (word16) s1_90;
	Eq_2 s0_118 = s0_117 & 0x07FFFFFF;
	Eq_145372 a3_120 = a3_119 & 0x07FFFFFF;
	if ((a3_119 & 0x07FFFFFF) > 0x04000000)
		a3_120 = 0x00 - (a5_112 - (s0_117 & 0x07FFFFFF) & 0x07FFFFFF);
	if (a3_120 < s7_94)
		s0_118 = (word32) (word27) ((s0_117 & 0x07FFFFFF) + s4_74);
	ui32 s1_135 = a0_85 - s0_118;
	Eq_2 s1_137 = s1_135 & 0x07FFFFFF;
	if ((s1_135 & 0x07FFFFFF) > 0x04000000)
	{
		if ((s0_118 - a0_85 & 0x07FFFFFF) != 0x00)
		{
l2302EF2E:
			word32 a5_175 = (word32) *((word32) s3_73 + 0x0078);
			*((word32) s3_73 + 8) = s0_118;
			*((word32) s5_75 + 4) = (word16) a5_175;
			*((word32) s5_75 + 8) = (word16) ((word32) *((word32) s3_73 + 18) >> 625);
			word32 a5_189 = (word32) *((word32) s3_73 + 116);
			*((word32) s5_75 + 6) = (word16) s2_98;
			*((word32) s5_75 + 0x0C) = 0x00;
			*((word32) s5_75 + 0x0A) = (word16) a5_189;
			*((word32) s5_75 + 0x0E) = (word16) ((word32) *((word32) s3_73 + 116) + 0x00EA);
			Eq_2 ra_210 = ea_interval_insert(ra_68, s0_118, s1_137, s5_75);
			*((word32) s3_73 + 80) = s5_75;
			lld_util_priority_set(s3_73, 0x02);
			*((word32) s3_73 + 0x007E) = (byte) ((word32) *((word32) s3_73 + 0x007E) | 2);
			0x00 = dwArg0198;
			s0Out = dwArg0158;
			a0Out = s3_73;
			s3Out = s3_73;
			mstatusOut = mstatus_67;
			return ra_210;
		}
		s1_137.u0 = 0x00;
	}
	uint32 s1_151 = (s1_137 ^ s4_74) + 0x01 << 16;
	lld_evt_channel_next(s6_76, (int32) (word16) (s1_151 >> 16));
	s1_137 = (s1_151 >> 16) + (word32) (*((word32) s3_73 + 96));
	*((word32) s3_73 + 96) = (word16) s1_137;
	s0_118 = (word32) (word27) ((word32) s0_118 + ((s1_151 >> 16) + s4_74));
	goto l2302EF2E;
}

// 2302EFA6: Register Eq_2 lld_evt_update_create(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register uint32 a2, Register uint32 a3, Register word32 a4, Register word32 a5, Register Eq_2 a6, Register out ptr32 s1Out, Register out Eq_2 a0Out)
// Called from:
//      lld_con_update_req
Eq_2 lld_evt_update_create(Eq_2 ra, Eq_2 s0, word32 a0, uint32 a2, uint32 a3, word32 a4, word32 a5, Eq_2 a6, ptr32 & s1Out, union Eq_2 & a0Out)
{
	word32 a3_39;
	word32 a4_40;
	word32 a6_42;
	word32 s1_47;
	word32 s4_48;
	Eq_2 a0_52;
	word32 s8_334;
	word32 mstatus_335;
	word32 s0_333;
	Eq_2 ra_45 = ea_elt_create(ra, s0, a6, 88, out s0_333, out s1_47, out a0_52, out a3_39, out a4_40, out a6_42, out s4_48, out s8_334, out mstatus_335);
	Eq_2 s0_215 = a0_52;
	if (a0_52 == 0x00)
	{
l2302F0F8:
		s1Out = dwArg28;
		a0Out = s0_215;
		return s0_215;
	}
	struct Eq_145547 * a3_142;
	word32 a2_141;
	struct Eq_145549 * a0_139;
	ui32 a4_189;
	Eq_2 s0_148;
	ui32 a1_140;
	<anonymous> * a5_55 = g_ptr4200F3D0;
	struct Eq_145556 * sp_58;
	struct Eq_145557 * s2_59;
	struct Eq_145558 * s0_61;
	word32 s3_63;
	word32 s4_64;
	word32 s5_65;
	word32 s6_66;
	word32 s7_67;
	Eq_2 ra_68;
	ptr32 mstatus_80;
	word32 tp_249;
	word32 t5_250;
	word32 t6_251;
	word32 t2_252;
	a5_55();
	word32 s1_337;
	word32 a1_338;
	word32 tp_336;
	Eq_2 ra_88 = lld_evt_init_evt(ra_68, (char *) s0_61 + 40, mstatus_80, out tp_336, out s1_337, out a1_338);
	s0_61->w005E = (word16) (s3_63 + 0x01);
	s0_61->b007B = 0x03;
	word32 a5_95 = (word32) s2_59->w0074;
	sp_58->w0028 = (word16) a5_95;
	sp_58->w0018 = (word16) s7_67;
	sp_58->w001A = (word16) s6_66;
	sp_58->w0020 = (word16) s4_64;
	sp_58->dw008C = s4_64;
	sp_58->b0022 = (byte) s5_65;
	sp_58->b0026 = 0x00;
	sp_58->w002A = 0x00;
	sp_58->w002E = (word16) (a5_95 + 0x00EA);
	ea_interval_duration_req(&sp_58->w0018, &sp_58->w000C, a5_95 + 0x00EA);
	sp_58->w0024 = 0x00;
	sp_58->b002C = 0x00;
	word32 a0_119;
	struct Eq_145650 * a3_132;
	word32 a5_340;
	word32 a2_339;
	struct Eq_145653 * s1_134;
	Eq_2 s0_126 = ea_offset_req(&sp_58->w0018, &sp_58->w000C, out s1_134, out a0_119, out a2_339, out a3_132, out a5_340);
	if (a0_119 == 0x00)
	{
		*((word32) s0_126 + 0x0078) = (word16) (word32) sp_58->w000C;
		a0_139 = lld_util_connection_param_set(s0_126, &sp_58->w000C, a3_132);
		uint32 a5_169 = (word32) s2_59->w005E + 0x06 << 0x10;
		ui32 a3_177 = (word32) s2_59->w0078 + (a5_169 >> 16) + s2_59->dw0008;
		s0_148 = a0_139->t0008;
		a2_141 = (word32) (word16) ((word32) s2_59->w0060 + (a5_169 >> 16));
		a1_140 = 0x07FFFFFF;
		a3_142 = a3_177 & 0x07FFFFFF;
		ui32 a4_181 = (a3_177 & 0x07FFFFFF) - a0_139;
		if ((a4_181 & 0x07FFFFFF) <= 0x04000000)
		{
			a4_189 = a4_181 & 0x07FFFFFF;
l2302F0BA:
			word32 a1_195 = (word32) *((word32) s0_148 + 0x0078);
			struct Eq_145760 * a5_205 = (word32) (word27) (a0_139 + (((a1_195 + -1) + a4_189 ^ a1_195) + a1_195) / 0x0C);
			a5_205->t0008 = s0_148;
			s1_134->b0004 = 0x01;
			s2_59->w005C = (word16) a2_141;
			s0_215 = a5_205->t0008;
			s1_134->w0002 = (word16) a2_141;
			s1_134->w0000 = (word16) (a5_205 - a3_142 << 5 >> 6);
			s2_59->t0004 = s0_215;
			s2_59->b006D = 0x01;
			goto l2302F0F8;
		}
	}
	else
	{
		word32 s8_343;
		word32 mstatus_344;
		word32 a4_341;
		word32 s4_342;
		lld_evt_delete_elt_push(ra_88, s0_126, s0_126, 0x01, 0x00, mstatus_80, sp_58->t0010, out s0_148, out s1_134, out a0_139, out a1_140, out a2_141, out a3_142, out a4_341, out s4_342, out s8_343, out mstatus_344);
		__ebreak();
	}
	a4_189 = 0x00 - (a0_139 - a3_142 & a1_140);
	goto l2302F0BA;
}

// 2302F110: Register Eq_2 lld_evt_move_to_slave(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_145805) a0, Register Eq_2 a2, Register Eq_2 a3, Stack Eq_2 dwArgA8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_move_to_slave
Eq_2 lld_evt_move_to_slave(Eq_2 ra, Eq_2 s0, struct Eq_145805 * a0, Eq_2 a2, Eq_2 a3, Eq_2 dwArgA8, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_121;
	Eq_2 s0_392;
	Eq_2 s1_49;
	Eq_2 a0_54;
	Eq_2 a0_56;
	struct Eq_145819 * a1_57;
	ptr32 mstatus_64;
	word32 mstatus_607;
	word32 s0_601;
	word32 a3_602;
	word32 s8_606;
	word32 a4_603;
	word32 a6_604;
	word32 s4_605;
	Eq_2 ra_65 = ea_interval_create(ea_elt_create(ra, s0, a3, 88, out s0_601, out s1_49, out a0_54, out a3_602, out a4_603, out a6_604, out s4_605, out s8_606, out mstatus_607), a0_54, s1_49, out a0_56, out a1_57, out mstatus_64);
	word32 s4_72 = (word32) *(uint16 *) 671121812;
	word32 s9_76 = (word32) *(uint16 *) 671121816;
	ui32 s6_163 = (word32) a1_57->w0014;
	word32 s5_81 = (word32) a1_57->b0013;
	a0->b0011 = (byte) ((word32) *(uint16 *) 0x28008154 >> 8);
	if (a0_54 != 0x00)
	{
		Eq_2 s0_123;
		struct Eq_143247 * s1_124;
		word32 s4_125;
		uint32 s8_126;
		word32 a1_618;
		word32 a0_619;
		word32 tp_616;
		word32 s1_617;
		word32 a1_620;
		word32 a2_621;
		word32 a3_622;
		word32 a4_623;
		Eq_2 ra_122 = lld_evt_delete_elt_push(lld_evt_init_evt(ra_65, (word32) a0_54 + 40, mstatus_64, out tp_616, out s1_617, out a1_618), a0_54, a2, 0x01, 0x00, mstatus_64, dwLoc70, out s0_123, out s1_124, out a0_619, out a1_620, out a2_621, out a3_622, out a4_623, out s4_125, out s8_126, out mstatus_121);
		*((word32) s0_123 + 116) = (word16) s1_124;
		*((word32) s0_123 + 0x0078) = (word16) ((word32) a0->w0000 << 1);
		word32 a5_135 = (word32) a0->w0002;
		*((word32) s0_123 + 110) = (byte) (s8_126 >> 0x05);
		*((word32) s0_123 + 113) = 0x00;
		*((word32) s0_123 + 94) = (word16) (a5_135 + 0x01);
		*((word32) s0_123 + 0x007B) = 0x04;
		((word32) s0_123 + 100)->u0 = 0x02;
		uint32 a5_144 = (word32) *((word32) a2 + 25);
		*((word32) s0_123 + 18) = 0x04E2;
		((word32) s0_123 + 25)->u0 = (byte) a5_144;
		s2 = a0_56;
		ui32 s10_150 = (word32) (word16) s4_72;
		ui32 s4_151 = (word32) (word16) s4_125;
		ui32 s9_152 = (word32) (word16) s9_76;
		if (a5_144 >= s6_163 << 0x01)
		{
			word32 s3_153 = (word32) a0->w0000;
			lld_evt_channel_next(s1_124, 0x01);
			((word32) s0_123 + 96)->u2 = 0x01;
			s6_163 = (word32) (word16) (s6_163 + s3_153);
		}
		uint32 s6_171 = (word32) (word16) ((s6_163 << 1) + (s5_81 + 2));
		struct Eq_142007 * a4_177;
		lld_evt_drift_compute(s6_171, s8_126 >> 0x05, out a4_177)->t0058 = s0_123;
		*((word32) s0_123 + 84) = s5_81 + 1217;
		lld_evt_winsize_change(0x01, a4_177, (struct Eq_142008 *) 0x04E2);
		Eq_2 s4_191 = s4_151 << 16 | s10_150;
		Eq_146030 a5_202 = (word32) (word16) (936 - (s9_152 & 0x03FF));
		if (a5_202 > 624)
		{
			a5_202 = (word32) (word16) (311 - (s9_152 & 0x03FF));
			s4_191 = (word32) s4_191 + 1;
		}
		word32 a4_211 = (word32) *((word32) s0_123 + 116);
		*((word32) s0_123 + 44) = (word16) a5_202;
		*((word32) s0_123 + 40) = s4_191;
		*((word32) s0_123 + 16) = 0x00;
		*((word32) s0_123 + 118) = (word16) (a4_211 + 0x00EA);
		g_t2302DC32 = s0_123;
		g_t2302EB3A = s0_123;
		g_t2302DB0E = s0_123;
		lld_util_priority_set(s0_123, 0x02);
		word32 a5_248 = (word32) *((word32) s0_123 + 116);
		*((word32) s0_123 + 0x007E) = (byte) ((word32) *((word32) s0_123 + 0x007E) | 2);
		ea_interval_duration_req(fp + -88, fp + -100, a5_248 + 0x00EA);
		word32 a0_275;
		word32 a2_624;
		word32 a3_625;
		struct Eq_146114 * a5_276;
		Eq_2 s1_290;
		Eq_2 s0_282 = ea_offset_req(fp + -88, fp + -100, out s1_290, out a0_275, out a2_624, out a3_625, out a5_276);
		if (a0_275 != 0x00)
		{
			word32 a0_295;
			word32 a2_626;
			word32 a3_627;
			s0_282 = ea_offset_req(fp + -88, fp + -100, out s1_290, out a0_295, out a2_626, out a3_627, out a5_276);
			if (a0_295 == 0x00)
			{
				Eq_2 a0_324;
				struct Eq_146217 * a2_326;
				struct Eq_146218 * s0_334;
				word32 s4_338;
				word32 s1_628;
				word32 a1_629;
				word32 a3_630;
				word32 a4_631;
				word32 a6_632;
				word32 a7_633;
				word32 s3_634;
				word32 s8_635;
				word32 mstatus_636;
				Eq_2 ra_333 = ble_ke_msg_alloc(ra_122, s0_282, s1_290, 265, (word32) (word16) (s1_290 << 0x08 | 1), 0x02, 0x0022, a0_56, s5_81 + 2, dwArgA8, out s0_334, out s1_628, out a0_324, out a1_629, out a2_326, out a3_630, out a4_631, out a6_632, out a7_633, out s2, out s3_634, out s4_338, out s8_635, out mstatus_636);
				*a0_324 = (byte) s4_338;
				*((word32) a0_324 + 2) = 0x00;
				*((word32) a0_324 + 4) = 0x00;
				((word32) a0_324 + 0x0E)->u2 = 0x00;
				*((word32) a0_324 + 16) = 0x00;
				word32 a5_351 = (word32) s0_334->w005E;
				*((word32) a0_324 + 18) = 0x00;
				*((word32) a0_324 + 6) = (word16) (a5_351 + ~0x00);
				*((word32) a0_324 + 8) = 64440;
				word32 a5_358 = (word32) s0_334->w0060;
				*((word32) a0_324 + 20) = (word16) a5_358;
				*((word32) a0_324 + 0x0A) = (word16) a5_358;
				*((word32) a0_324 + 0x0C) = (word16) (word32) s0_334->w0060;
				Eq_2 s0_363 = a2_326->t0008;
				*((word32) a0_324 + 22) = (word16) (lld_util_get_peer_offset(0x00, 0x00, a2_326) >> 1);
				*((word32) a0_324 + 24) = ~0x00;
				((word32) a0_324 + 26)->u0 = ~0x00;
				*((word32) a0_324 + 28) = ~0x00;
				((word32) a0_324 + 30)->u2 = ~0x00;
				((word32) a0_324 + 32)->u0 = ~0x00;
				word32 tp_637;
				word32 t1_638;
				word32 a0_639;
				word32 a2_640;
				word32 a3_641;
				word32 a4_642;
				ra_122 = ble_ke_msg_send(ra_333, s0_363, a0_324, a0_324, 0x00, out tp_637, out t1_638, out s0_282, out s1_290, out a0_639, out a2_640, out a3_641, out a4_642, out a5_276, out mstatus_121);
			}
		}
		s0_392 = a5_276->t0008;
		*((word32) s2 + 6) = (word16) (a5_276 & (word32) (*((word32) s0_282 + 0x0078)));
		*((word32) s2 + 4) = (word16) (word32) *((word32) s0_392 + 0x0078);
		*((word32) s2 + 8) = 0x02;
		*((word32) s2 + 0x0A) = (word16) (word32) *((word32) s0_392 + 116);
		*((word32) s2 + 0x0C) = 0x01;
		*((word32) s2 + 0x0E) = (word16) ((word32) *((word32) s0_392 + 116) + 0x00EA);
		ea_interval_insert(ra_122, s0_392, s1_290, s2);
		*((word32) s0_392 + 80) = s2;
		lld_evt_slave_time_compute(s0_392, s6_171);
		*((word32) s0_392 + 0x007E) = (byte) ((word32) *((word32) s0_392 + 0x007E) | 1);
	}
	else
	{
		word32 s4_614;
		word32 s8_615;
		word32 a1_610;
		word32 a2_611;
		word32 a3_612;
		word32 a4_613;
		word32 s1_608;
		word32 a0_609;
		lld_evt_delete_elt_push(ra_65, a0_54, a2, 0x01, 0x00, mstatus_64, dwLoc70, out s0_392, out s1_608, out a0_609, out a1_610, out a2_611, out a3_612, out a4_613, out s4_614, out s8_615, out mstatus_121);
	}
	s0Out = s0_392;
	s1Out = dwArg0118;
	a0Out = s0_392;
	s2Out = s2;
	mstatusOut = mstatus_121;
	return dwArg0158;
}

// 2302F436: Register Eq_2 lld_evt_slave_update(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg38, Register out (ptr32 Eq_146377) s1Out, Register out (ptr32 Eq_146378) s2Out, Register out ptr32 s4Out)
// Called from:
//      lld_con_update_ind
Eq_2 lld_evt_slave_update(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg38, struct Eq_146377 & s1Out, struct Eq_146378 & s2Out, ptr32 & s4Out)
{
	if ((word32) *((word32) a1 + 96) != (word32) (*((word32) a0 + 0x0A)))
	{
		word32 s0_29;
		struct Eq_146378 * a0_35;
		word32 mstatus_259;
		word32 a6_257;
		word32 s8_258;
		word32 a4_256;
		word32 a3_255;
		struct Eq_146377 * s1_213;
		ptr32 s4_222;
		Eq_2 ra_206 = ea_elt_create(ra, a1, a0, 88, out s0_29, out s1_213, out a0_35, out a3_255, out a4_256, out a6_257, out s4_222, out s8_258, out mstatus_259);
		struct Eq_146378 * s2_217 = a0_35;
		if (a0_35 != null)
		{
			<anonymous> * a5_38 = g_ptr4200F3D0;
			struct Eq_146512 * s0_48;
			Eq_2 ra_50;
			word32 a6_53;
			word32 a7_54;
			ptr32 mstatus_55;
			word32 s8_57;
			word32 t1_58;
			word32 t3_59;
			a5_38();
			word32 tp_67;
			word32 a1_260;
			ra_206 = lld_evt_init_evt(ra_50, &s2_217->w0012 + 11, mstatus_55, out tp_67, out s1_213, out a1_260);
			s2_217->w0074 = (word16) (word32) s0_48->w0074;
			s2_217->w0078 = (word16) ((word32) s1_213->w0004 << 1);
			s2_217->w005E = (word16) ((word32) s1_213->w0006 + 0x01);
			s2_217->b007B = 0x04;
			uint32 a1_78 = (word32) s0_48->b006E;
			s2_217->b006E = (byte) a1_78;
			s2_217->w0064 = (word16) (word32) s0_48->w0064;
			s2_217->b007E = (byte) ((word32) s2_217->b007E | 1);
			s2_217->w0012 = ~0x00;
			word32 a4_261;
			s2_217->ptr0058 = lld_evt_drift_compute((word32) (word16) (((word32) s1_213->w0002 + (word32) s1_213->b0001 << 1) + (word32) s0_48->w0078), a1_78, out a4_261);
			s2_217->dw0054 = (word32) s1_213->b0001 + 1217;
			s0_48->ptr0004 = s2_217;
			ui32 a4_107 = (word32) s0_48->b007E;
			word32 a3_108 = (word32) s0_48->w0060;
			s0_48->w005C = (word16) (word32) s1_213->w000A;
			s0_48->b006D = 0x01;
			s0_48->w0066 = (word16) (word32) s1_213->w0002;
			s0_48->b006C = (byte) (word32) s1_213->b0001;
			s0_48->b007E = (byte) (a4_107 | 1);
			if (a3_108 == (word32) ((word16) ((word32) s1_213->w000A + ~0x00)))
				s0_48->b007E = (byte) (a4_107 | 9);
		}
		0x00 = (int8) dwArg38;
		s1Out = s1_213;
		s2Out = s2_217;
		s4Out = s4_222;
		return ra_206;
	}
	else
	{
		struct Eq_146389 * a5_137 = *((char *) &g_t42026428 + (word32) (*((word32) a1 + 116)) * 0x04);
		if ((word32) *((word32) a1 + 0x0078) != (word32) (*((word32) a0 + 4)) << 1 || ((word32) (*((word32) a1 + 94)) != (word32) (*((word32) a0 + 6)) + 0x01 || (word32) a5_137->w0054 != (word32) a5_137->w0056))
			a5_137->w005C = (word16) ((word32) a5_137->w005C | 0x0080);
		*((word32) a1 + 0x0078) = (word16) ((word32) *((word32) a0 + 4) << 1);
		*((word32) a1 + 94) = (word16) ((word32) *((word32) a0 + 6) + 0x01);
		*((word32) a1 + 92) = (word16) (word32) *((word32) a0 + 0x0A);
		*((word32) a1 + 0x006D) = 0x01;
		*((word32) a1 + 0x007E) = (byte) ((word32) *((word32) a1 + 0x007E) | 9);
		s1Out = s1;
		s2Out = s2;
		s4Out = s4;
		return ra;
	}
}

