pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302F5B4: Register Eq_2 lld_evt_adv_create(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Stack Eq_2 dwArg84, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_adv_start
//      lld_test_mode_tx
//      lld_test_mode_rx
Eq_2 lld_evt_adv_create(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 dwArg84, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_128173 a3_19;
	ptr32 mstatus_24;
	Eq_2 a0_32;
	word32 s1_40;
	word32 a4_116;
	word32 a6_117;
	word32 s4_118;
	word32 s1_115;
	word32 s0_114;
	word32 s8_119;
	word32 tp_120;
	word32 a1_121;
	Eq_2 ra_39 = lld_evt_init_evt(ea_elt_create(ra, s0, a0, 88, out s0_114, out s1_115, out a0_32, out a3_19, out a4_116, out a6_117, out s4_118, out s8_119, out mstatus_24), (word32) a0_32 + 40, mstatus_24, out tp_120, out s1_40, out a1_121);
	*((word32) a0_32 + 18) = ~0x063B;
	*((word32) a0_32 + 116) = (word16) s1_40;
	*((word32) a0_32 + 122) = 0x00;
	*((word32) a0_32 + 0x0078) = (word16) a2;
	*((word32) a0_32 + 118) = (word16) (s1_40 + 0x00EA);
	Eq_2 a0_57 = lld_util_priority_set(a0_32, 0x05);
	*((word32) a0_32 + 24) = 0x0200;
	g_t2302DC32 = a0_32;
	g_t2302EB3A = a0_32;
	g_t2302DB0E = dwArg84;
	*((word32) dwArg84 + 23) = 0x00;
	*((word32) dwArg84 + 16) = 0x00;
	if (a3_19 == 0x00)
		*((word32) dwArg84 + 0x007E) = (byte) ((word32) *((word32) dwArg84 + 0x007E) | 32);
	word32 a5_122;
	ea_time_get_halfslot_rounded(a0_57, a3_19, out a5_122)->t0008 = dwArg84;
	s1Out = s1_40 + 0x00EA;
	a0Out = dwArg84;
	s4Out = dwArg04;
	mstatusOut = mstatus_24;
	return ra_39;
}

// 2302F656: Register Eq_2 lld_evt_end(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register word32 s8, Register ptr32 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_146822 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_end_isr
Eq_2 lld_evt_end(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s4, word32 s8, ptr32 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_146822 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	ptr32 a4_144;
	Eq_2 s2_143;
	struct Eq_146836 * a5_15 = (word32) *((word32) a0 + 116);
	uint32 s1_33 = ((word32) a5_15->w28008140 >> 8) + ((word32) a5_15->w2800813E >> 8);
	Eq_2 s0_109 = a0;
	Eq_2 a3_104 = &a5_15->w2800813E;
	Eq_2 s1_110 = s1_33 & 0x00FF;
	Eq_2 s3_114 = (word32) (word16) (word32) a5_15->w2800813E;
	if (((word32) a5_15->w28008142 >> 7 & 0x01) != 0x00 && (s1_33 & 0x00FF) == 0x00)
	{
		s2_143.u0 = 0x01;
l2302F740:
		a4_144 = 0x00;
		goto l2302F7E8;
	}
	ui32 a5_41 = (word32) *((word32) a0 + 0x007E);
	if ((a5_41 & 16) != 0x00)
	{
l2302F6BA:
		goto l2302F6BC;
	}
	struct Eq_142408 ** a5_50;
	struct Eq_142408 ** a4_43 = a5_41 & 64;
	if ((a5_41 & 64) != 0x00)
	{
		*((word32) a0 + 0x007E) = (byte) (a5_41 & -65);
		a4_43 = (word32) *((word32) a0 + 0x007B);
		a5_50 = (struct Eq_142408 **) 0x01;
		if ((s1_33 & 0x00FF) != 0x00)
			goto l2302F70A;
	}
	else
	{
		*((word32) a0 + 22) = (byte) (word32) *((word32) a0 + 0x007D);
		if ((s1_33 & 0x00FF) != 0x00)
			goto l2302F6BA;
	}
	a5_50 = (word32) *((word32) a0 + 0x007B);
	if (a5_50 == null)
	{
		if ((word32) g_ptr42026474->b0021 != 0x00)
			goto l2302F6BA;
l2302F70E:
		struct Eq_147202 * a0_72 = lld_evt_get_next_free_slot(a0, &a5_15->w2800813E, a4_43);
		struct Eq_147207 * a5_80 = (word32) g_b230B4F01 & 0x0F | 0xFA000050;
		*((word32) a0 + 16) = (word16) a5_80;
		Eq_2 s0_84 = a5_80->t005C;
		a0_72->t0008 = s0_84;
		a5_80->t000C = s0_84;
		word32 a0_101;
		word32 s2_875;
		word32 s8_877;
		word32 s4_876;
		ra = ea_elt_insert(ra, s0_84, &a5_15->w2800813E, mstatus, dwArg04, dwArg9C, dwArgEC, out s0_109, out s1_110, out a0_101, out a3_104, out s2_875, out s3_114, out s4_876, out s5, out s6, out s7, out s8_877, out s9, out s10);
		if (a0_101 == 0x00)
		{
			word32 a5_879;
			word32 a4_878;
			ra = lld_evt_elt_wait_insert(ra, s0_109, s1_110, s0_109, out s1_110, out a0, out a3_104, out a4_878, out a5_879, out s4, out s8, out mstatus);
			s2_143.u0 = 0x00;
			if (s1_110 == 0x00)
				goto l2302F740;
l2302F6BC:
			Eq_2 a1_150 = (word32) *((word32) s0_109 + 122);
			if (s1_110 < a1_150)
			{
				word32 s9_871;
				word32 s10_872;
				word32 t4_874;
				word32 s11_873;
				word32 a1_858;
				word32 a3_860;
				word32 a0_857;
				word32 a2_859;
				word32 s1_856;
				word32 a4_861;
				word32 s3_865;
				word32 a7_863;
				word32 a5_862;
				word32 s2_864;
				word32 s4_866;
				word32 s6_868;
				word32 s5_867;
				word32 s7_869;
				word32 s8_870;
				printf(ra, &g_t230B5814, a3_104, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_856, out a0_857, out a1_858, out a2_859, out a3_860, out a4_861, out a5_862, out a7_863, out s2_864, out s3_865, out s4_866, out s5_867, out s6_868, out s7_869, out s8_870, out s9_871, out s10_872, out s11_873, out t4_874);
				while (true)
					;
			}
			Eq_2 ra_242;
			Eq_2 s0_243;
			Eq_2 s0_206;
			uint32 s1_207;
			Eq_2 ra_205 = lld_pdu_rx_handler(ra, s0_109, s1_110, (word32) s0_109 + 40, s1_110 - a1_150 & 0x00FF, s10, dwArg54, dwArgB8, dwArgEC, out s0_206, out s1_207, out s2_143, out s3_114, out s9, out s10);
			if ((word32) *((word32) s0_206 + 0x007B) == 0x02)
				ra_242 = lld_evt_deferred_elt_push(ra_205, s0_206, 0x02, s1_207 & 1, out s0_243, out s1_110, out s4, out s8);
			else
			{
				uint32 a2_225;
				uint32 a2_224 = (word32) *((word32) s0_206 + 122);
				if (s1_207 >= a2_224)
					a2_225 = s1_207 - a2_224 & 0x00FF;
				else
					a2_225 = 0x00;
				word32 s1_244;
				ra_242 = lld_evt_deferred_elt_push(ra_205, s0_206, 0x01, a2_225, out s0_243, out s1_244, out s4, out s8);
				*((word32) s0_243 + 111) = (byte) ((word32) (((word32) g_b42026424 + (s1_244 + ~0x00) | 0x08) & 0x00FF)->w280083E0 >> 4 & 0x01);
				s1_110.u0 = 0x08;
			}
			word32 a5_289 = (word32) *((word32) s0_243 + 0x007B);
			if (a5_289 == 0x01 && (word32) (*((word32) s0_243 + 96)) != 0x00)
			{
				s3_114 &= 0x00FF;
				if ((s3_114 & 0x00FF) != 0x00)
					*((word32) s0_243 + 97) = (byte) a5_289;
			}
			*((word32) s0_243 + 122) = 0x00;
			word32 a1_848;
			word32 a2_849;
			word32 t1_847;
			word32 a4_851;
			word32 a5_852;
			word32 a3_850;
			ra = ble_ke_event_set(ra_242, s0_243, 0x08, dwLoc10, out t1_847, out s0_109, out a0, out a1_848, out a2_849, out a3_850, out a4_851, out a5_852, out mstatus);
			a4_144 = 0x01;
l2302F7E8:
			ui32 a5_319 = (word32) *((word32) s0_109 + 0x007E);
			if ((a5_319 & 48) == 0x00 && s2_143 != 0x00)
			{
				ra = lld_evt_restart(ra, s1_110, s0_109, 0x00, s2_143, s3_114, s4, s8, s9, s10, dwLoc04, dwArg18, dwArg58, dwArg78, dwArg98, dwArgC4, dwArgE0, dwArgE4, dwArg0108, out s0_109, out s1_110, out a0, out a4_144, out s2_143, out s3_114, out s5, out s6, out s7, out s9, out s10);
				if (a0 != 0x00)
				{
					Eq_2 a0_431;
					Eq_146822 a3_434;
					ptr32 a4_435;
					ptr32 mstatus_439;
					Eq_2 s0_441;
					Eq_2 s1_442;
					Eq_2 s10_443;
					Eq_2 s2_445;
					Eq_2 s3_446;
					Eq_2 s4_447;
					ptr32 s5_448;
					ptr32 s6_449;
					ptr32 s7_450;
					ptr32 s8_451;
					ptr32 s9_452;
					word32 a5_853;
					Eq_2 ra_440 = lld_evt_elt_insert(ra, s0_109, a5_319 & 48, mstatus, dwArg04, dwArg10, dwArg18, dwArg58, dwArg78, dwArg98, dwArg9C, dwArgC4, dwArgE0, dwArgE4, dwArgEC, dwArg0108, out s0_441, out s1_442, out a0_431, out a3_434, out a4_435, out a5_853, out s2_445, out s3_446, out s4_447, out s5_448, out s6_449, out s7_450, out s8_451, out s9_452, out s10_443, out mstatus_439);
					s0Out = s0_441;
					s1Out = s1_442;
					a0Out = a0_431;
					a3Out = a3_434;
					a4Out = a4_435;
					s2Out = s2_445;
					s3Out = s3_446;
					s4Out = s4_447;
					s5Out = s5_448;
					s6Out = s6_449;
					s7Out = s7_450;
					s8Out = s8_451;
					s9Out = s9_452;
					s10Out = s10_443;
					mstatusOut = mstatus_439;
					return ra_440;
				}
			}
			else if ((a5_319 & 0x10) != 0x00 && a4_144 == 0x00)
			{
				Eq_2 a0_350;
				Eq_146822 a3_353;
				ptr32 a4_354;
				ptr32 mstatus_357;
				Eq_2 s0_359;
				Eq_2 s1_360;
				Eq_2 s4_361;
				ptr32 s8_362;
				word32 a1_854;
				word32 a2_855;
				Eq_2 ra_358 = lld_evt_delete_elt_push(ra, s0_109, s0_109, 0x01, 0x01, mstatus, dwArg10, out s0_359, out s1_360, out a0_350, out a1_854, out a2_855, out a3_353, out a4_354, out s4_361, out s8_362, out mstatus_357);
				s0Out = s0_359;
				s1Out = s1_360;
				a0Out = a0_350;
				a3Out = a3_353;
				a4Out = a4_354;
				s2Out = s2_143;
				s3Out = s3_114;
				s4Out = s4_361;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				s8Out = s8_362;
				s9Out = s9;
				s10Out = s10;
				mstatusOut = mstatus_357;
				return ra_358;
			}
			s0Out = s0_109;
			s1Out = s1_110;
			a0Out = a0;
			a3Out = a5_319 & 48;
			a4Out = a4_144;
			s2Out = s2_143;
			s3Out = s3_114;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = dwLoc1C;
			s9Out = s9;
			s10Out = s10;
			mstatusOut = mstatus;
			return ra;
		}
		goto l2302F6BA;
	}
	a4_43 = (struct Eq_142408 **) 0x01;
l2302F70A:
	if (a5_50 != a4_43)
		goto l2302F6BA;
	goto l2302F70E;
}

