pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302F846: Register Eq_2 lld_evt_rx(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s10, Stack Eq_2 dwArg10, Stack Eq_2 dwArg54, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgEC, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_rx_isr
Eq_2 lld_evt_rx(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s10, Eq_2 dwArg10, Eq_2 dwArg54, Eq_2 dwArgB8, Eq_2 dwArgEC, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	uint32 a2_17 = (word32) ((uint16[]) 0x280080EE)[(word32) *((word32) a0 + 116) / 2];
	Eq_2 s0_33;
	ptr32 s10_35;
	ptr32 s2_37;
	ptr32 s3_38;
	ptr32 s9_44;
	word32 s1_110;
	Eq_2 ra_32 = lld_pdu_rx_handler(ra, a0, s1, (word32) a0 + 40, a2_17 >> 0x0C, s10, dwArg54, dwArgB8, dwArgEC, out s0_33, out s1_110, out s2_37, out s3_38, out s9_44, out s10_35);
	*((word32) s0_33 + 122) = (byte) ((word32) *((word32) s0_33 + 122) + (a2_17 >> 0x0C));
	Eq_2 s0_65;
	ptr32 s1_66;
	ptr32 s4_67;
	word32 s8_111;
	Eq_2 ra_64 = lld_evt_deferred_elt_push(ra_32, s0_33, 0x00, a2_17 >> 0x0C, out s0_65, out s1_66, out s4_67, out s8_111);
	ptr32 a0_76;
	ptr32 a3_79;
	ptr32 a4_80;
	ptr32 mstatus_82;
	ptr32 s0_85;
	word32 t1_112;
	word32 a1_113;
	word32 a2_114;
	word32 a5_115;
	Eq_2 ra_83 = ble_ke_event_set(ra_64, s0_65, 0x08, dwArg10, out t1_112, out s0_85, out a0_76, out a1_113, out a2_114, out a3_79, out a4_80, out a5_115, out mstatus_82);
	s0Out = s0_85;
	s1Out = s1_66;
	a0Out = a0_76;
	a3Out = a3_79;
	a4Out = a4_80;
	s2Out = s2_37;
	s3Out = s3_38;
	s4Out = s4_67;
	s5Out = s5_40;
	s6Out = s6_41;
	s7Out = s7_42;
	s8Out = dwLoc1C;
	s9Out = s9_44;
	s10Out = s10_35;
	mstatusOut = mstatus_82;
	return ra_83;
}

// 2302F896: Register Eq_2 lld_evt_rx_afs(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s10, Stack Eq_2 dwArg10, Stack Eq_2 dwArg64, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_afs_isr
Eq_2 lld_evt_rx_afs(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s10, Eq_2 dwArg10, Eq_2 dwArg64, Eq_2 dwArgC8, Eq_2 dwArgFC, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a5_5 = (word32) *((word32) a0 + 122);
	if (a5_5 >= a1)
	{
		while (true)
			;
	}
	else
	{
		Eq_2 s0_30;
		word32 s1_31;
		ptr32 s10_32;
		ptr32 s2_34;
		ptr32 s3_35;
		ptr32 s9_41;
		Eq_2 ra_29 = lld_pdu_rx_handler(ra, a0, a1, (word32) a0 + 40, a1 - a5_5 & 0x00FF, s10, dwArg64, dwArgC8, dwArgFC, out s0_30, out s1_31, out s2_34, out s3_35, out s9_41, out s10_32);
		*((word32) s0_30 + 122) = (byte) s1_31;
		ptr32 s1_61;
		ptr32 s4_62;
		ptr32 s8_63;
		word32 s0_105;
		Eq_2 ra_59 = lld_evt_deferred_elt_push(ra_29, s0_30, 0x00, 0x00, out s0_105, out s1_61, out s4_62, out s8_63);
		ptr32 a0_72;
		ptr32 a3_75;
		ptr32 a4_76;
		ptr32 mstatus_78;
		ptr32 s0_81;
		word32 t1_106;
		word32 a1_107;
		word32 a2_108;
		word32 a5_109;
		Eq_2 ra_79 = ble_ke_event_set(ra_59, s0, 0x08, dwArg10, out t1_106, out s0_81, out a0_72, out a1_107, out a2_108, out a3_75, out a4_76, out a5_109, out mstatus_78);
		s0Out = s0_81;
		s1Out = s1_61;
		a0Out = a0_72;
		a3Out = a3_75;
		a4Out = a4_76;
		s2Out = s2_34;
		s3Out = s3_35;
		s4Out = s4_62;
		s5Out = s5_37;
		s6Out = s6_38;
		s7Out = s7_39;
		s8Out = s8_63;
		s9Out = s9_41;
		s10Out = s10_32;
		mstatusOut = mstatus_78;
		return ra_79;
	}
}

// 2302F8D6: Register Eq_2 lld_evt_timer_isr(Register Eq_2 ra, Register Eq_2 s0, Stack Eq_2 dwArg10, Register out Eq_128588 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_isr
Eq_2 lld_evt_timer_isr(Eq_2 ra, Eq_2 s0, Eq_2 dwArg10, union Eq_128588 & s0Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	ptr32 a0_7;
	ptr32 a3_10;
	ptr32 a4_11;
	ptr32 mstatus_13;
	Eq_128588 s0_16;
	word32 t1_23;
	word32 a1_24;
	word32 a2_25;
	word32 a5_26;
	Eq_2 ra_14 = ble_ke_event_set(ra, s0, 0x03, dwArg10, out t1_23, out s0_16, out a0_7, out a1_24, out a2_25, out a3_10, out a4_11, out a5_26, out mstatus_13);
	s0Out = s0_16;
	a0Out = a0_7;
	a3Out = a3_10;
	a4Out = a4_11;
	mstatusOut = mstatus_13;
	return ra_14;
}

// 2302F8DC: Register Eq_2 lld_evt_end_isr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_128173 a3, Register Eq_2 a4, Register ptr32 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0108, Register out Eq_128382 s0Out, Register out (ptr32 Eq_128383) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_128388) s3Out, Register out (ptr32 Eq_128389) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_128392 s7Out, Register out (ptr32 Eq_128393) s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_isr
Eq_2 lld_evt_end_isr(Eq_2 ra, Eq_2 s0, Eq_128173 a3, Eq_2 a4, ptr32 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgEC, Eq_2 dwArg0108, union Eq_128382 & s0Out, struct Eq_128383 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, struct Eq_128388 & s3Out, struct Eq_128389 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_128392 & s7Out, struct Eq_128393 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a0_14;
	word32 s1_34;
	Eq_2 s2_35;
	Eq_2 s4_36;
	word32 s8_37;
	word32 s0_143;
	word32 a1_144;
	word32 a5_145;
	word32 s8_146;
	word32 a4_147;
	Eq_2 ra_33 = ea_elt_remove(ble_co_list_pop_front(ra, s0, 0x42026430, out s0_143, out a0_14, out a1_144, out a5_145, out s8_146), a0_14, a3, a4, mstatus, dwArg18, dwArg28, out s1_34, out a4_147, out s2_35, out s4_36, out s8_37);
	if (s1_34 != 0x00)
		*((word32) a0_14 + 0x007E) = (byte) ((word32) *((word32) a0_14 + 0x007E) | 64);
	else if ((word32) *((word32) a0_14 + 16) >> 0x0E != 0x00)
		((word32) a0_14 + 16)->u2 = 0x00;
	ptr32 a0_63;
	ptr32 a3_66;
	ptr32 a4_67;
	ptr32 mstatus_71;
	Eq_128382 s0_73;
	struct Eq_128383 * s1_74;
	ptr32 s10_75;
	ptr32 s2_77;
	struct Eq_128388 * s3_78;
	struct Eq_128389 * s4_79;
	ptr32 s5_80;
	ptr32 s6_81;
	Eq_128392 s7_82;
	struct Eq_128393 * s8_83;
	ptr32 s9_84;
	Eq_2 ra_72 = lld_evt_end(ra_33, a0_14, s2_35, s4_36, s8_37, s9, s10, mstatus, dwArg04, dwArg08, dwArg10, dwArg18, dwArg50, dwArg54, dwArg58, dwArg78, dwArg98, dwArg9C, dwArgB8, dwArgC4, dwArgE0, dwArgE4, dwArgEC, dwArg0108, out s0_73, out s1_74, out a0_63, out a3_66, out a4_67, out s2_77, out s3_78, out s4_79, out s5_80, out s6_81, out s7_82, out s8_83, out s9_84, out s10_75, out mstatus_71);
	s0Out = s0_73;
	s1Out = s1_74;
	a0Out = a0_63;
	a3Out = a3_66;
	a4Out = a4_67;
	s2Out = s2_77;
	s3Out = s3_78;
	s4Out = s4_79;
	s5Out = s5_80;
	s6Out = s6_81;
	s7Out = s7_82;
	s8Out = s8_83;
	s9Out = s9_84;
	s10Out = s10_75;
	mstatusOut = mstatus_71;
	return ra_72;
}

// 2302F922: Register Eq_2 lld_evt_rx_isr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s10, Stack Eq_2 dwArg10, Stack Eq_2 dwArg54, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgEC, Register out Eq_128476 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_128482) s3Out, Register out (ptr32 Eq_128483) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_128486 s7Out, Register out (ptr32 Eq_128487) s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_isr
Eq_2 lld_evt_rx_isr(Eq_2 ra, Eq_2 s1, Eq_2 s10, Eq_2 dwArg10, Eq_2 dwArg54, Eq_2 dwArgB8, Eq_2 dwArgEC, union Eq_128476 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, struct Eq_128482 & s3Out, struct Eq_128483 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_128486 & s7Out, struct Eq_128487 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a0_5 = g_t42026430;
	if (a0_5 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0_5;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_9;
		ptr32 a3_12;
		ptr32 a4_13;
		ptr32 mstatus_17;
		Eq_128476 s0_19;
		Eq_2 s1_20;
		Eq_2 s10_21;
		ptr32 s2_23;
		struct Eq_128482 * s3_24;
		struct Eq_128483 * s4_25;
		ptr32 s5_26;
		ptr32 s6_27;
		Eq_128486 s7_28;
		struct Eq_128487 * s8_29;
		ptr32 s9_30;
		Eq_2 ra_18 = lld_evt_rx(ra, s1, a0_5, s10, dwArg10, dwArg54, dwArgB8, dwArgEC, out s0_19, out s1_20, out a0_9, out a3_12, out a4_13, out s2_23, out s3_24, out s4_25, out s5_26, out s6_27, out s7_28, out s8_29, out s9_30, out s10_21, out mstatus_17);
		s0Out = s0_19;
		s1Out = s1_20;
		a0Out = a0_9;
		a3Out = a3_12;
		a4Out = a4_13;
		s2Out = s2_23;
		s3Out = s3_24;
		s4Out = s4_25;
		s5Out = s5_26;
		s6Out = s6_27;
		s7Out = s7_28;
		s8Out = s8_29;
		s9Out = s9_30;
		s10Out = s10_21;
		mstatusOut = mstatus_17;
		return ra_18;
	}
}

// 2302F932: Register Eq_2 lld_evt_afs_isr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s10, Stack Eq_2 dwArg10, Stack Eq_2 dwArg64, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC, Register out Eq_2 s0Out, Register out (ptr32 Eq_128518) s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_128523) s3Out, Register out (ptr32 Eq_128524) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_128527 s7Out, Register out (ptr32 Eq_128528) s8Out, Register out ptr32 s9Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      rwble_isr
Eq_2 lld_evt_afs_isr(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s10, Eq_2 dwArg10, Eq_2 dwArg64, Eq_2 dwArgC8, Eq_2 dwArgFC, union Eq_2 & s0Out, struct Eq_128518 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, struct Eq_128523 & s3Out, struct Eq_128524 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_128527 & s7Out, struct Eq_128528 & s8Out, ptr32 & s9Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 a0_7 = g_t42026430;
	if (a0_7 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0_7;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a0_11;
		ptr32 a3_14;
		ptr32 a4_15;
		ptr32 mstatus_19;
		Eq_2 s0_21;
		struct Eq_128518 * s1_22;
		Eq_2 s10_23;
		ptr32 s2_25;
		struct Eq_128523 * s3_26;
		struct Eq_128524 * s4_27;
		ptr32 s5_28;
		ptr32 s6_29;
		Eq_128527 s7_30;
		struct Eq_128528 * s8_31;
		ptr32 s9_32;
		Eq_2 ra_20 = lld_evt_rx_afs(ra, s0, a0_7, a0, s10, dwArg10, dwArg64, dwArgC8, dwArgFC, out s0_21, out s1_22, out a0_11, out a3_14, out a4_15, out s2_25, out s3_26, out s4_27, out s5_28, out s6_29, out s7_30, out s8_31, out s9_32, out s10_23, out mstatus_19);
		s0Out = s0_21;
		s1Out = s1_22;
		a0Out = a0_11;
		a3Out = a3_14;
		a4Out = a4_15;
		s2Out = s2_25;
		s3Out = s3_26;
		s4Out = s4_27;
		s5Out = s5_28;
		s6Out = s6_29;
		s7Out = s7_30;
		s8Out = s8_31;
		s9Out = s9_32;
		s10Out = s10_23;
		mstatusOut = mstatus_19;
		return ra_20;
	}
}

