pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302F944: void lld_pdu_llcp_con_param_req_unpk(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a2, Register word32 s2, Register word32 s3, Stack word32 dwArg0128)
void lld_pdu_llcp_con_param_req_unpk(word32 ra, word32 s0, word32 s1, word32 a0, word32 a2, word32 s2, word32 s3, word32 dwArg0128)
{
	struct Eq_147695 * sp_24;
	struct Eq_147696 * s3_25;
	word32 s2_27;
	word32 ra_28;
	word32 s0_29;
	struct Eq_147700 * s1_30;
	g_ptr4200F3D0();
	s1_30->w0002 = (word16) (word32) sp_24->w000E;
	<anonymous> * a5_40 = s3_25->ptr03D0;
	struct Eq_147715 * sp_45;
	struct Eq_147716 * s3_46;
	word32 s2_48;
	word32 ra_49;
	word32 s0_50;
	struct Eq_147720 * s1_51;
	a5_40();
	s1_51->w0004 = (word16) (word32) sp_45->w000E;
	<anonymous> * a5_61 = s3_46->ptr03D0;
	struct Eq_147733 * sp_66;
	struct Eq_147734 * s3_67;
	word32 s2_69;
	word32 ra_70;
	word32 s0_71;
	struct Eq_147738 * s1_72;
	a5_61();
	s1_72->w0006 = (word16) (word32) sp_66->w000E;
	<anonymous> * a5_82 = s3_67->ptr03D0;
	struct Eq_147751 * sp_87;
	struct Eq_147752 * s3_88;
	word32 s2_90;
	word32 ra_91;
	word32 s0_92;
	struct Eq_147756 * s1_93;
	a5_82();
	s1_93->w0008 = (word16) (word32) sp_87->w000E;
	<anonymous> * a5_103 = s3_88->ptr03D0;
	struct Eq_147769 * sp_108;
	struct Eq_147770 * s3_109;
	word32 s2_111;
	word32 ra_112;
	word32 s0_113;
	struct Eq_147774 * s1_114;
	a5_103();
	s1_114->b000A = (byte) (word32) sp_108->b000E;
	<anonymous> * a5_124 = s3_109->ptr03D0;
	struct Eq_147787 * sp_129;
	struct Eq_147788 * s3_130;
	word32 s2_132;
	word32 ra_133;
	word32 s0_134;
	struct Eq_147792 * s1_135;
	a5_124();
	s1_135->w000C = (word16) (word32) sp_129->w000E;
	<anonymous> * a5_145 = s3_130->ptr03D0;
	struct Eq_147805 * sp_150;
	struct Eq_147806 * s3_151;
	word32 s2_153;
	word32 ra_154;
	word32 s0_155;
	struct Eq_147810 * s1_156;
	a5_145();
	s1_156->w000E = (word16) (word32) sp_150->w000E;
	<anonymous> * a5_166 = s3_151->ptr03D0;
	struct Eq_147823 * sp_171;
	struct Eq_147824 * s3_172;
	word32 s2_174;
	word32 ra_175;
	word32 s0_176;
	struct Eq_147828 * s1_177;
	a5_166();
	s1_177->w0010 = (word16) (word32) sp_171->w000E;
	<anonymous> * a5_187 = s3_172->ptr03D0;
	struct Eq_147841 * sp_192;
	struct Eq_147842 * s3_193;
	word32 s2_195;
	word32 ra_196;
	word32 s0_197;
	struct Eq_147846 * s1_198;
	a5_187();
	s1_198->w0012 = (word16) (word32) sp_192->w000E;
	<anonymous> * a5_208 = s3_193->ptr03D0;
	struct Eq_147859 * sp_213;
	struct Eq_147860 * s3_214;
	word32 s2_216;
	word32 ra_217;
	word32 s0_218;
	struct Eq_147864 * s1_219;
	a5_208();
	s1_219->w0014 = (word16) (word32) sp_213->w000E;
	<anonymous> * a5_229 = s3_214->ptr03D0;
	struct Eq_147877 * sp_234;
	struct Eq_147878 * s3_235;
	word32 s2_237;
	word32 ra_238;
	word32 s0_239;
	struct Eq_147882 * s1_240;
	a5_229();
	s1_240->w0016 = (word16) (word32) sp_234->w000E;
	<anonymous> * a5_250 = s3_235->ptr03D0;
	struct Eq_147895 * s1_261;
	a5_250();
	s1_261->w0018 = (word16) (word32) wLoc22;
	0x00 = dwArg0128;
}

// 2302FACC: void lld_pdu_llcp_con_param_rsp_unpk(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a2, Register word32 s2, Register word32 s3, Stack word32 dwArg0128)
void lld_pdu_llcp_con_param_rsp_unpk(word32 ra, word32 s0, word32 s1, word32 a0, word32 a2, word32 s2, word32 s3, word32 dwArg0128)
{
	struct Eq_147911 * sp_24;
	struct Eq_147912 * s3_25;
	word32 s2_27;
	word32 ra_28;
	word32 s0_29;
	struct Eq_147916 * s1_30;
	g_ptr4200F3D0();
	s1_30->w0002 = (word16) (word32) sp_24->w000E;
	<anonymous> * a5_40 = s3_25->ptr03D0;
	struct Eq_147931 * sp_45;
	struct Eq_147932 * s3_46;
	word32 s2_48;
	word32 ra_49;
	word32 s0_50;
	struct Eq_147936 * s1_51;
	a5_40();
	s1_51->w0004 = (word16) (word32) sp_45->w000E;
	<anonymous> * a5_61 = s3_46->ptr03D0;
	struct Eq_147949 * sp_66;
	struct Eq_147950 * s3_67;
	word32 s2_69;
	word32 ra_70;
	word32 s0_71;
	struct Eq_147954 * s1_72;
	a5_61();
	s1_72->w0006 = (word16) (word32) sp_66->w000E;
	<anonymous> * a5_82 = s3_67->ptr03D0;
	struct Eq_147967 * sp_87;
	struct Eq_147968 * s3_88;
	word32 s2_90;
	word32 ra_91;
	word32 s0_92;
	struct Eq_147972 * s1_93;
	a5_82();
	s1_93->w0008 = (word16) (word32) sp_87->w000E;
	<anonymous> * a5_103 = s3_88->ptr03D0;
	struct Eq_147985 * sp_108;
	struct Eq_147986 * s3_109;
	word32 s2_111;
	word32 ra_112;
	word32 s0_113;
	struct Eq_147990 * s1_114;
	a5_103();
	s1_114->b000A = (byte) (word32) sp_108->b000E;
	<anonymous> * a5_124 = s3_109->ptr03D0;
	struct Eq_148003 * sp_129;
	struct Eq_148004 * s3_130;
	word32 s2_132;
	word32 ra_133;
	word32 s0_134;
	struct Eq_148008 * s1_135;
	a5_124();
	s1_135->w000C = (word16) (word32) sp_129->w000E;
	<anonymous> * a5_145 = s3_130->ptr03D0;
	struct Eq_148021 * sp_150;
	struct Eq_148022 * s3_151;
	word32 s2_153;
	word32 ra_154;
	word32 s0_155;
	struct Eq_148026 * s1_156;
	a5_145();
	s1_156->w000E = (word16) (word32) sp_150->w000E;
	<anonymous> * a5_166 = s3_151->ptr03D0;
	struct Eq_148039 * sp_171;
	struct Eq_148040 * s3_172;
	word32 s2_174;
	word32 ra_175;
	word32 s0_176;
	struct Eq_148044 * s1_177;
	a5_166();
	s1_177->w0010 = (word16) (word32) sp_171->w000E;
	<anonymous> * a5_187 = s3_172->ptr03D0;
	struct Eq_148057 * sp_192;
	struct Eq_148058 * s3_193;
	word32 s2_195;
	word32 ra_196;
	word32 s0_197;
	struct Eq_148062 * s1_198;
	a5_187();
	s1_198->w0012 = (word16) (word32) sp_192->w000E;
	<anonymous> * a5_208 = s3_193->ptr03D0;
	struct Eq_148075 * sp_213;
	struct Eq_148076 * s3_214;
	word32 s2_216;
	word32 ra_217;
	word32 s0_218;
	struct Eq_148080 * s1_219;
	a5_208();
	s1_219->w0014 = (word16) (word32) sp_213->w000E;
	<anonymous> * a5_229 = s3_214->ptr03D0;
	struct Eq_148093 * sp_234;
	struct Eq_148094 * s3_235;
	word32 s2_237;
	word32 ra_238;
	word32 s0_239;
	struct Eq_148098 * s1_240;
	a5_229();
	s1_240->w0016 = (word16) (word32) sp_234->w000E;
	<anonymous> * a5_250 = s3_235->ptr03D0;
	struct Eq_148111 * s1_261;
	a5_250();
	s1_261->w0018 = (word16) (word32) wLoc22;
	0x00 = dwArg0128;
}

// 2302FC54: void lld_pdu_llcp_length_req_unpk(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a2, Register word32 s2, Register word32 s3, Stack word32 dwArg0128)
void lld_pdu_llcp_length_req_unpk(word32 ra, word32 s0, word32 s1, word32 a0, word32 a2, word32 s2, word32 s3, word32 dwArg0128)
{
	struct Eq_148127 * sp_24;
	struct Eq_148128 * s3_25;
	word32 s2_27;
	word32 ra_28;
	word32 s0_29;
	struct Eq_148132 * s1_30;
	g_ptr4200F3D0();
	s1_30->w0002 = (word16) (word32) sp_24->w000E;
	<anonymous> * a5_40 = s3_25->ptr03D0;
	struct Eq_148147 * sp_45;
	struct Eq_148148 * s3_46;
	word32 s2_48;
	word32 ra_49;
	word32 s0_50;
	struct Eq_148152 * s1_51;
	a5_40();
	s1_51->w0004 = (word16) (word32) sp_45->w000E;
	<anonymous> * a5_61 = s3_46->ptr03D0;
	struct Eq_148165 * sp_66;
	struct Eq_148166 * s3_67;
	word32 s2_69;
	word32 ra_70;
	word32 s0_71;
	struct Eq_148170 * s1_72;
	a5_61();
	s1_72->w0006 = (word16) (word32) sp_66->w000E;
	<anonymous> * a5_82 = s3_67->ptr03D0;
	struct Eq_148183 * s1_93;
	a5_82();
	s1_93->w0008 = (word16) (word32) wLoc22;
	0x00 = dwArg0128;
}

// 2302FCEC: void lld_pdu_llcp_length_rsp_unpk(Register word32 ra, Register word32 s0, Register word32 s1, Register word32 a0, Register word32 a2, Register word32 s2, Register word32 s3, Stack word32 dwArg0128)
void lld_pdu_llcp_length_rsp_unpk(word32 ra, word32 s0, word32 s1, word32 a0, word32 a2, word32 s2, word32 s3, word32 dwArg0128)
{
	struct Eq_148199 * sp_24;
	struct Eq_148200 * s3_25;
	word32 s2_27;
	word32 ra_28;
	word32 s0_29;
	struct Eq_148204 * s1_30;
	g_ptr4200F3D0();
	s1_30->w0002 = (word16) (word32) sp_24->w000E;
	<anonymous> * a5_40 = s3_25->ptr03D0;
	struct Eq_148219 * sp_45;
	struct Eq_148220 * s3_46;
	word32 s2_48;
	word32 ra_49;
	word32 s0_50;
	struct Eq_148224 * s1_51;
	a5_40();
	s1_51->w0004 = (word16) (word32) sp_45->w000E;
	<anonymous> * a5_61 = s3_46->ptr03D0;
	struct Eq_148237 * sp_66;
	struct Eq_148238 * s3_67;
	word32 s2_69;
	word32 ra_70;
	word32 s0_71;
	struct Eq_148242 * s1_72;
	a5_61();
	s1_72->w0006 = (word16) (word32) sp_66->w000E;
	<anonymous> * a5_82 = s3_67->ptr03D0;
	struct Eq_148255 * s1_93;
	a5_82();
	s1_93->w0008 = (word16) (word32) wLoc22;
	0x00 = dwArg0128;
}

// 2302FD84: Register Eq_2 lld_pdu_pack(Register Eq_2 ra, Register Eq_148264 a0, Register (ptr32 Eq_148265) a1, Register (ptr32 Eq_148265) a2, Stack ptr32 dwArg0198, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_148264 s2Out, Register out Eq_148264 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_148265) s5Out, Register out (ptr32 word32) s6Out, Register out (ptr32 Eq_148276) s7Out, Register out (ptr32 word32) s9Out, Register out (ptr32 Eq_148278) s10Out, Register out (ptr32 Eq_148265) s11Out)
// Called from:
//      lld_pdu_tx_prog
//      lld_pdu_adv_pack
Eq_2 lld_pdu_pack(Eq_2 ra, Eq_148264 a0, struct Eq_148265 * a1, struct Eq_148265 * a2, ptr32 dwArg0198, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_148264 & s2Out, union Eq_148264 & s3Out, ptr32 & s4Out, struct Eq_148265 & s5Out, word32 & s6Out, struct Eq_148276 & s7Out, word32 & s9Out, struct Eq_148278 & s10Out, struct Eq_148265 & s11Out)
{
	Eq_148264 s3_130 = a0;
	struct Eq_148265 * s5_132 = a1;
	Eq_148264 s0_155 = a0;
	Eq_148264 s2_157 = a0;
	uint32 s4_131 = 0x09;
	struct Eq_148276 * s7_119 = (struct Eq_148276 *) 0x0A;
	word32 * s8_135 = (word32 *) 72;
	word32 * s9_136 = (word32 *) 76;
	word32 * s6_133 = (word32 *) 66;
	struct Eq_148278 * s10_109 = &g_t4200F000;
	while (true)
	{
		ptr32 a0_158 = (word32) a2->b0000;
		if (a0_158 == 0x00)
			break;
		s1 = 0x00;
		if (s4_131 >= (a0_158 + -48 & 0x00FF))
		{
			++a2;
			s1 = (word32) (word16) (a0_158 + -48);
			while (true)
			{
				word32 a4_59 = (word32) a2->b0000;
				struct Eq_148265 * a3_60 = a2 + 1;
				if (s4_131 < (a4_59 + -48 & 0x00FF))
					break;
				a2 = a3_60;
				s1 = (word32) (word16) ((char *) (s7_119 + s1 / 78) - 48 + a4_59);
			}
		}
		Eq_148264 a1_102;
		Eq_148264 a0_103;
		word32 * a5_66 = (word32) a2->b0000;
		s11 = a2 + 1;
		if (a5_66 != s8_135)
		{
			if (a5_66 != s9_136)
			{
				if (a5_66 != s6_133)
				{
					a0_158 = 0x01;
					goto l2302FE8A;
				}
				*s0_155 = (byte) (word32) *s2_157;
				a1_102 = (word32) s2_157 + 1;
				a0_103 = (word32) s0_155 + 1;
				if (s1 > 0x01)
				{
					word32 s0_128;
					word32 s2_129;
					word32 a5_144;
					word32 a4_145;
					word32 a3_146;
					s10_109->ptr03D0();
					a0_103 = s0_128 + s1;
					a1_102 = s2_129 + s1;
				}
			}
			else
			{
				a1_102 = *a5_66 + 0x04;
				*s0_155 = (byte) a5_66;
				*((word32) s0_155 + 1) = (byte) (a5_66 >> 0x08);
				*((word32) s0_155 + 2) = (byte) (a5_66 >> 0x10);
				*((word32) s0_155 + 3) = (byte) (a5_66 >> 24);
				a0_103 = (word32) s0_155 + 4;
			}
		}
		else
		{
			Eq_148404 a1_74 = (word32) s2_157 + 1;
			uint32 a5_76 = (word32) *(a1_74 & ~0x01);
			*s0_155 = (byte) a5_76;
			*((word32) s0_155 + 1) = (byte) (a5_76 >> 8);
			a0_103 = (word32) s0_155 + 2;
			a1_102 = (a1_74 & ~0x01) + 0x02;
		}
		a2 = s11;
		s0_155 = a0_103;
		s2_157 = a1_102;
	}
	s5_132->b0000 = (byte) (s0_155 - s3_130);
l2302FE8A:
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1;
	a0Out = a0_158;
	s2Out = s2_157;
	s3Out = s3_130;
	s4Out = dwLoc14;
	s5Out = s5_132;
	s6Out = s6_133;
	s7Out = s7_119;
	s9Out = s9_136;
	s10Out = s10_109;
	s11Out = s11;
	return ra;
}

