pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 2302FEB2: Register Eq_2 lld_pdu_tx_flush_list(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s5, Register ptr32 mstatus, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      lld_pdu_tx_flush
Eq_2 lld_pdu_tx_flush_list(Eq_2 ra, Eq_2 a0, Eq_2 s5, ptr32 mstatus, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	Eq_2 s2_17 = a0;
	Eq_2 s0_18 = 0x00;
	Eq_2 s3_19 = 0x13;
	Eq_2 s4_20 = 0x17;
	while (true)
	{
		Eq_2 s1_22 = __csrrs(mstatus, 0x00);
		__csrrc(mstatus, 0x08);
		Eq_2 a0_28;
		word32 a1_143;
		word32 a5_144;
		word32 s8_145;
		ra = ble_co_list_pop_front(ra, s0_18, s2_17, out s0_18, out a0_28, out a1_143, out a5_144, out s8_145);
		__csrrw(mstatus, 0x00);
		if (a0_28 == 0x00)
			break;
		word32 a5_46 = (word32) *((word32) a0_28 + 4);
		if (s3_19 >= (word32) ((word16) (a5_46 + -6)))
		{
			__csrrs(mstatus, 0x00);
			__csrrc(mstatus, 0x08);
			word32 a0_76;
			word32 s1_141;
			word32 a5_142;
			ra = em_buf_tx_free(ra, a0_28, mstatus, out s0_18, out s1_141, out a0_76, out a5_142, out s2_17, out s3_19, out s4_20);
			if (a0_76 != 0x00)
				s0_18 = (word32) s0_18 + 1 & 0x00FF;
			__csrrw(mstatus, 0x00);
		}
		else if (s4_20 < (word32) ((word16) (a5_46 + ~0x01)))
		{
			word32 tp_146;
			word32 s1_147;
			word32 a0_148;
			word32 a1_149;
			word32 a2_150;
			word32 a3_151;
			word32 a4_152;
			word32 a5_153;
			word32 a6_154;
			word32 s8_155;
			ra = ble_ke_free(ra, s0_18, s1_22, a0_28, s2_17, s3_19, s4_20, s5, out tp_146, out s0_18, out s1_147, out a0_148, out a1_149, out a2_150, out a3_151, out a4_152, out a5_153, out a6_154, out s2_17, out s3_19, out s4_20, out s5, out s8_155, out mstatus);
		}
	}
	s0Out = s1;
	s1Out = s1_22;
	a0Out = s0_18;
	s2Out = s2_17;
	s3Out = s3_19;
	return ra;
}

// 2302FF28: void lld_pdu_cntl_aligned_unpk(Register word32 a0, Register word32 a1, Register word32 a2)
void lld_pdu_cntl_aligned_unpk(word32 a0, word32 a1, word32 a2)
{
	if (a1 == 0x00)
		return;
	word32 t1_19;
	g_ptr4200F3D0();
}

// 2302FF44: Register Eq_2 lld_pdu_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack word32 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgC8, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      lld_evt_deffered_elt_handler
Eq_2 lld_pdu_check(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, word32 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgC8, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	word32 a1_850;
	Eq_2 a0_129;
	Eq_2 ra_100 = ble_co_list_init(ra, s0, fp + -72, out a0_129, out a1_850);
	Eq_2 s2_103 = (word32) *((word32) a0 + 76);
	__csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	Eq_2 s3_104 = *((word32) a0 + 32);
	__csrrw(mstatus, 0x00);
	Eq_2 s1_102 = a0;
	Eq_2 s0_101 = 0x00;
	Eq_2 s5_106 = 0x0A;
	Eq_2 s4_105 = 671122122;
	Eq_2 s7_213 = (word32) a0 + 16;
	while (s3_104 != 0x00 && (word32) (*((word32) s4_105 + ((word32) s5_106 + (word32) (*((word32) s3_104 + 4))))) >> 0x0F != 0x00)
	{
		__csrrs(mstatus, 0x00);
		__csrrc(mstatus, 0x08);
		s3_104 = *s3_104;
		Eq_2 a0_71;
		struct Eq_148704 * a5_74;
		word32 a1_854;
		ui32 s8_107;
		ra_100 = ble_co_list_pop_front(ra_100, s0_101, a0_129, out s0_101, out a0_71, out a1_854, out a5_74, out s8_107);
		s1_102 = a5_74->t0010;
		a0_129 = a0_71;
		if (a5_74 != null)
		{
			word32 a1_855;
			word32 a5_856;
			ra_100 = ble_co_list_pop_front(ra_100, s0_101, s7_213, out s0_101, out a0_129, out a1_855, out a5_856, out s8_107);
			if (a0_129 != 0x00)
			{
				word32 a5_862;
				word32 a3_860;
				word32 tp_857;
				word32 a1_858;
				word32 a4_861;
				word32 a2_859;
				word32 a6_863;
				ra_100 = ble_ke_free(ra_100, s0_101, s1_102, a0_129, s2_103, s3_104, s4_105, s5_106, out tp_857, out s0_101, out s1_102, out a0_129, out a1_858, out a2_859, out a3_860, out a4_861, out a5_862, out a6_863, out s2_103, out s3_104, out s4_105, out s5_106, out s8_107, out mstatus);
			}
		}
		__csrrw(mstatus, 0x00);
		uint16 * a5_117 = (word32) s4_105 + ((word32) s5_106 + (word32) (*((word32) a0_71 + 4)));
		*a5_117 = (word16) ((word32) *a5_117 & s8_107);
		up32 a5_122 = (word32) *((word32) a0_71 + 4);
		if (a5_122 <= 0x01)
		{
			*((word32) s1_102 + 72) = (byte) ((word32) *((word32) s1_102 + 72) + ~0x00);
			__csrrs(mstatus, 0x00);
			struct Eq_15 * a5_154 = __csrrc(mstatus, 0x08);
			Eq_2 s1_155 = a5_154->t0018;
			if (a5_154 == null)
				*((word32) s1_155 + 86) = (byte) ((word32) *((word32) s1_155 + 86) & ~0x04);
			ptr32 mstatus_177;
			Eq_2 s2_181;
			word32 s5_876;
			word32 s0_865;
			word32 a3_870;
			word32 s4_875;
			word32 s8_877;
			word32 tp_864;
			word32 s1_866;
			word32 a0_867;
			word32 a1_868;
			word32 a2_869;
			word32 a5_872;
			word32 a4_871;
			word32 a6_873;
			word32 s3_874;
			Eq_2 ra_178 = ble_ke_free(ra_100, s0_101, s1_155, a0_71, s2_103, s3_104, s4_105, s5_106, out tp_864, out s0_865, out s1_866, out a0_867, out a1_868, out a2_869, out a3_870, out a4_871, out a5_872, out a6_873, out s2_181, out s3_874, out s4_875, out s5_876, out s8_877, out mstatus_177);
			__csrrw(mstatus_177, 0x00);
			ra_100 = llc_pdu_llcp_tx_ack_defer(ra_178, s2_181, (word32) *((word32) a0_71 + 0x0C), s2_181, mstatus_177, dwLoc58, dwLoc50, dwLoc28, dwArg68, dwArg78, dwArg84, dwArg88, dwArgB8, dwArgC8, out s0_101, out s1_102, out a0_129, out s2_103, out s3_104, out s4_105, out s5_106, out s7_213, out mstatus);
			continue;
		}
		if (a5_122 > 0x05)
		{
			word32 a5_882;
			ra_100 = em_buf_tx_free(ra_100, a0_71, mstatus, out s0_101, out s1_102, out a0_129, out a5_882, out s2_103, out s3_104, out s4_105);
			if (a0_129 == 0x00)
				continue;
		}
		s0_101 = (word32) s0_101 + 1 & 0x00FF;
	}
	word32 s4_216 = (word32) s2_103 - 2;
	if ((word32) (word16) s4_216 > 0x01 && s0_101 != 0x00)
	{
		Eq_2 a4_222 = __csrrs(mstatus, 0x00);
		__csrrc(mstatus, 0x08);
		*((word32) s1_102 + 72) = (byte) ((word32) *((word32) s1_102 + 72) - s0_101);
		__csrrw(mstatus, 0x00);
		ra_100 = llc_pdu_acl_tx_ack_defer(ra_100, s0_101, s2_103, s0_101, a4_222, s2_103, s3_104, s5_106, mstatus, dwLoc60, dwLoc5C, dwLoc50, s2, dwLoc28, dwArgA8, dwArgB8, out s0_101, out s2_103, out s4_216, out mstatus);
	}
	__csrrs(mstatus, 0x00);
	__csrrc(mstatus, 0x08);
	Eq_2 a0_263;
	word32 s8_853;
	word32 a5_852;
	word32 a1_851;
	Eq_2 s0_268;
	Eq_2 ra_267 = ble_co_list_pop_front(ra_100, s0_101, 0x42026448, out s0_268, out a0_263, out a1_851, out a5_852, out s8_853);
	__csrrw(mstatus, 0x00);
	Eq_2 s3_259 = 0x42026000;
	Eq_2 s1_271 = a0_263;
	ptr32 s5_274 = 0x00;
	ptr32 s4_275 = (word32) (word16) s4_216;
	ptr32 s6_276 = 0x01;
	while (s1_271 != 0x00)
	{
		Eq_2 ra_290;
		if ((word32) *((word32) s1_271 + 6) == s2_103)
		{
			Eq_2 s5_331;
			Eq_2 s4_311;
			Eq_2 s3_319;
			Eq_2 s2_310;
			Eq_2 ra_307;
			Eq_2 s0_308;
			Eq_2 s1_309;
			Eq_148921 a0_293 = (word32) *((word32) s1_271 + 8);
			if (s6_276 < s4_275)
				ra_307 = llc_pdu_defer(ra_267, s2_103, a0_293, (word32) *((word32) s1_271 + 0x0C), (word32) *((word32) s1_271 + 11), (word32) *((word32) s1_271 + 0x0A), dwArgC8, out s0_308, out s1_309, out s2_310, out s3_319, out s4_311, out s5_331, out s6_276);
			else
			{
				Eq_2 a0_301;
				ra_307 = llm_pdu_defer(ra_267, s0_268, s1_271, a0_293, (word32) *((word32) s1_271 + 4), s0_268, s3_259, s4_275, s5_274, s6_276, s7_213, dwLoc28, dwLoc20, dwLoc1C, dwLoc14, dwLoc08, dwArg28, s9, s1, dwArg98, out s0_308, out s1_309, out a0_301, out s2_310, out s3_319, out s4_311, out s6_276);
				s5_331 = a0_301;
			}
			word32 a6_891;
			word32 a1_886;
			word32 s8_892;
			word32 a5_890;
			word32 a2_887;
			word32 a3_888;
			word32 a4_889;
			word32 s1_884;
			word32 a0_885;
			word32 tp_883;
			ra_290 = ble_ke_free(ra_307, s0_308, s1_309, s1_309, s2_310, s3_319, s4_311, s5_331, out tp_883, out s0_268, out s1_884, out a0_885, out a1_886, out a2_887, out a3_888, out a4_889, out a5_890, out a6_891, out s2_103, out s3_259, out s4_275, out s5_274, out s8_892, out mstatus);
		}
		else
		{
			word32 a5_880;
			word32 s1_878;
			word32 a0_879;
			ra_290 = ble_co_list_push_back(ra_267, s0_268, s1_271, fp + -72, s1_271, out s1_878, out a0_879, out a5_880);
		}
		s7_213 = __csrrs(mstatus, 0x00);
		__csrrc(mstatus, 0x08);
		word32 a1_893;
		Eq_2 a0_392;
		word32 a5_395;
		word32 s8_894;
		ra_267 = ble_co_list_pop_front(ra_290, s0_268, (word32) s3_259 + 0x0448, out s0_268, out a0_392, out a1_893, out a5_395, out s8_894);
		s1_271 = a0_392;
		if (a0_392 == 0x00 && a5_395 != 0x00)
		{
			word32 a0_881;
			ra_267 = ble_co_list_merge(ra_267, s0_268, a0_392, (word32) s3_259 + 0x0448, fp + -72, out s1_271, out a0_881);
		}
		__csrrw(mstatus, 0x00);
	}
	s0Out = s0_268;
	s1Out = dwArg28;
	a0Out = s5_274;
	s2Out = s2_103;
	s3Out = s3_259;
	s4Out = dwArgDC;
	s5Out = s4;
	s9Out = dwLoc5C;
	mstatusOut = mstatus;
	return dwArg68;
}

