pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0002.c
// 23030120: Register ui32 lld_pdu_tx_loop(Register ptr32 mstatus)
// Called from:
//      lld_adv_start
//      lld_scan_start
//      lld_test_mode_tx
ui32 lld_pdu_tx_loop(ptr32 mstatus)
{
	__csrrs(mstatus, 0x00);
	struct Eq_149096 * a4_9 = (word32) __csrrc(mstatus, 0x08)->w0004;
	ui32 a3_16 = (word32) a4_9->w280082D4;
	a4_9->w280082D4 = (word16) (word32) (word16) ((word32) *(uint16 *) 671122126 + 0x02D4 | a3_16 & 0xF8000000);
	__csrrw(mstatus, 0x00);
	return a3_16 & 0xF8000000;
}

// 23030166: Register (ptr32 Eq_149126) lld_pdu_data_tx_push(Register (ptr32 Eq_149126) a0, Register (ptr32 Eq_149127) a1, Register word32 a2, Register int32 a3, Register out (ptr32 Eq_149130) a5Out)
// Called from:
//      lld_pdu_tx_prog
struct Eq_149126 * lld_pdu_data_tx_push(struct Eq_149126 * a0, struct Eq_149127 * a1, word32 a2, int32 a3, struct Eq_149130 & a5Out)
{
	struct Eq_149131 * a5_5 = (word32) a1->t0004;
	a5_5->w280082D4 = 0x00;
	struct Eq_149130 * a5_42 = (char *) a5_5 + 0x0A;
	if (a3 != 0x00)
		a1->b000B = (byte) ((word32) a1->b000B + 0x04);
	a5_5->w280082D6 = (word16) ((word32) a1->b000B << 8 | (word32) a1->b000A);
	a5_5->w280082D8 = (word16) (word32) a1->w0008;
	if (a2 != 0x00)
	{
		a5_5->w280082DC = (word16) ((word32) a1->t0006 | 0x08000000);
		word32 a5_41 = (word32) a0->b0048;
		a0->b0048 = (byte) (a5_41 + 0x01);
		a5_42 = a5_41 + 0x01;
	}
	struct Eq_149126 * a0_46 = a5_42->ptr0020;
	if (a5_42 != null)
	{
		struct Eq_149208 * a4_49 = (word32) a5_42->w0004;
		a5_42 = (word32) (word16) ((word32) a1->t0004 + 0x02D4 | (word32) a4_49->w280082D4 & 0xF8000000);
		a4_49->w280082D4 = (word16) a5_42;
		a0_46 = a5_42->ptr0020;
		if (a5_42 != null)
		{
			a0_46 = a5_42->ptr0024;
			a1->ptr0000 = a5_42;
l230301D6:
			a1->ptr0024 = a0_46;
			a1->ptr0000 = null;
			a5Out = a5_42;
			return a0_46;
		}
	}
	a1->ptr0020 = a0_46;
	goto l230301D6;
}

// 2303021E: Register Eq_2 lld_pdu_data_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      llc_hci_acl_data_tx_handler
Eq_2 lld_pdu_data_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 & a0Out, ptr32 & a3Out, ptr32 & mstatusOut)
{
	ptr32 a0_29;
	Eq_2 a0_13;
	ptr32 a3_16;
	ptr32 mstatus_21;
	Eq_2 s1_24;
	word32 s4_92;
	word32 a6_91;
	word32 a5_90;
	word32 a4_89;
	word32 s0_88;
	word32 s8_93;
	Eq_2 ra_22 = ble_ke_malloc(ra, a0, s1, 0x10, 0x00, out s0_88, out s1_24, out a0_13, out a3_16, out a4_89, out a5_90, out a6_91, out s4_92, out s8_93, out mstatus_21);
	if (a0_13 != 0x00)
	{
		struct Eq_149287 * a5_37 = *((word32) a0_13 + 16);
		struct Eq_149291 * s0_38 = a5_37->ptr0008;
		a5_37->t000C = a0_13;
		*((word32) a0_13 + 6) = (word16) (word32) s0_38->w0000;
		*((word32) a0_13 + 8) = (word16) (word32) s0_38->w0004;
		*((word32) a0_13 + 0x0A) = (byte) (word32) s0_38->b0002;
		*((word32) a0_13 + 4) = 0x1A;
		Eq_2 s0_49 = __csrrs(mstatus_21, 0x00);
		__csrrc(mstatus_21, 0x08);
		word32 s1_94;
		word32 a0_95;
		word32 a5_96;
		ra_22 = ble_co_list_push_back(ra_22, s0_49, s1_24, (word32) a0_13 + 48, a0_13, out s1_94, out a0_95, out a5_96);
		__csrrw(mstatus_21, 0x00);
		a0_29 = 0x01;
	}
	else
		a0_29 = 0x00;
	a0Out = a0_29;
	a3Out = a3_16;
	mstatusOut = mstatus_21;
	return ra_22;
}

// 2303028A: Register Eq_2 lld_pdu_tx_push(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out ptr32 s1Out, Register out Eq_149353 a3Out)
// Called from:
//      lld_adv_start
//      lld_scan_start
//      lld_con_start
//      lld_test_mode_tx
Eq_2 lld_pdu_tx_push(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, ptr32 mstatus, ptr32 & s1Out, union Eq_149353 & a3Out)
{
	((word16[]) 671122132)[(word32) *((word32) a1 + 4) / 2] = 0x00;
	Eq_2 s0_20 = __csrrs(mstatus, 0x00);
	Eq_149353 a3_10 = 671122122;
	struct Eq_15 * a5_21 = __csrrc(mstatus, 0x08);
	if (a5_21 != null)
	{
		struct Eq_149388 * a4_25 = (word32) a5_21->w0004;
		ui32 a3_30 = (word32) a4_25->w280082D4;
		a4_25->w280082D4 = (word16) (word32) (word16) ((word32) *((word32) a1 + 4) + 0x02D4 | a3_30 & 0xF8000000);
		a3_10 = a3_30 & 0xF8000000;
	}
	ptr32 s1_49;
	word32 a0_68;
	word32 a5_69;
	Eq_2 ra_48 = ble_co_list_push_back(ra, s0_20, s1, (word32) a0 + 48, a1, out s1_49, out a0_68, out a5_69);
	__csrrw(mstatus, 0x00);
	s1Out = s1_49;
	a3Out = a3_10;
	return ra_48;
}

// 230302F6: Register Eq_2 lld_pdu_tx_prog(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s4, Stack word32 dwArg74, Stack ptr32 dwArg0128, Register out Eq_2 s0Out, Register out ptr32 s1Out)
// Called from:
//      lld_evt_schedule
Eq_2 lld_pdu_tx_prog(Eq_2 ra, Eq_2 s0, Eq_2 s4, word32 dwArg74, ptr32 dwArg0128, union Eq_2 & s0Out, ptr32 & s1Out)
{
	struct Eq_149126 * a0_30 = *((word32) s0 + 24);
	byte bLoc41_676 = SLICE(s4, byte, 24);
	struct Eq_149126 * s7_116 = a0_30;
	Eq_2 s1_122 = &a0_30->ptr0020;
	struct Eq_149423 * s5_114 = (word32) a0_30->w004C;
	if (s0 != 0x00 && (word32) s5_114->w280082D4 >> 0x0F != 0x00)
	{
		ui32 a4_47 = (word32) *((char *) *((char *) &g_t42026428 + s5_114 * 0x04) + 0x00A5);
		if ((a4_47 & 4) != 0x00)
		{
			do
			{
				ui32 a0_56;
				uint32 a0_52 = (word32) *((word32) s0 + 0x0C);
				if ((a4_47 & 32) != 0x00)
					a0_56 = llc_llcp_get_autorize(a0_52) & 0x02;
				else
					a0_56 = llc_llcp_get_autorize(a0_52) & 0x01;
				if (a0_56 != 0x00)
					goto l23030522;
				s0 = *s0;
			} while (s0 != 0x00);
		}
		else
		{
l23030522:
			struct Eq_148265 * a2_80;
			struct Eq_149461 * s0_86;
			word32 s8_90;
			word32 s4_1241;
			word32 s2_1240;
			word32 a4_1239;
			word32 a0_1237;
			word32 a3_1238;
			ra = ble_co_list_extract(ra, s0, &a0_30->ptr0020, (char *) &a0_30->ptr0014 + 4, s0, 0x00, (char *) s5_114 + 0x0A, out s0_86, out s1_122, out a0_1237, out a2_80, out a3_1238, out a4_1239, out s2_1240, out s4_1241, out s8_90);
			Eq_148264 s6_94 = s0_86->t0008;
			if (a2_80 != null)
			{
				word32 a0_106;
				word32 s0_109;
				word32 s10_110;
				word32 s2_111;
				word32 s3_112;
				word32 s4_113;
				word32 s6_115;
				word32 s9_117;
				word32 s11_123;
				ra = lld_pdu_pack(ra, s6_94, fp + -65, a2_80, dwArg0128, out s0_109, out s1_122, out a0_106, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s9_117, out s10_110, out s11_123);
				if (a0_106 == 0x00)
				{
					<anonymous> * a4_137 = g_ptr4200F3D0;
					struct Eq_149567 * sp_140;
					Eq_2 s1_141;
					Eq_2 ra_143;
					Eq_2 s2_145;
					Eq_2 s3_146;
					Eq_2 s4_147;
					Eq_2 s5_148;
					Eq_2 a0_154;
					word32 t1_166;
					word32 mstatus_679;
					a4_137();
					word32 a6_174;
					Eq_2 s0_177;
					Eq_2 s1_178;
					struct Eq_149580 * s2_179;
					struct Eq_149616 ** s3_180;
					word32 tp_185;
					word32 mstatus_1250;
					word32 s8_1249;
					word32 a5_1247;
					word32 a3_1245;
					word32 a2_1244;
					word32 a1_1243;
					word32 s4_1248;
					word32 a4_1246;
					word32 a0_1242;
					Eq_2 ra_176 = ble_ke_free(ra_143, *((word32) a0_154 + 8), s1_141, a0_154, s2_145, s3_146, s4_147, s5_148, out tp_185, out s0_177, out s1_178, out a0_1242, out a1_1243, out a2_1244, out a3_1245, out a4_1246, out a5_1247, out a6_174, out s2_179, out s3_180, out s4_1248, out s5_114, out s8_1249, out mstatus_1250);
					if (((word32) *((char *) *s3_180 + 0x00A5) & 0x01) != 0x00)
						sp_140->b002F = (byte) ((word32) sp_140->b002F + 0x04);
					s2_179->w280082CC = (word16) ((word32) sp_140->b002F << 8 | (word32) s2_179->w280082CC & 0x00FF);
					s2_179->w280082CC = (word16) ((word32) (word16) (word32) s2_179->w280082CC & ~0x03 | 3);
					((word16[]) 671122132)[(word32) s7_116->w004C / 2] = 0x00;
					if (s7_116->ptr0020 != null)
					{
						struct Eq_149773 * a3_220 = (word32) s7_116->ptr0024->w0004;
						a3_220->w280082D4 = (word16) (word32) (word16) ((word32) *((word32) s0_177 + 4) + 0x02D4 | (word32) a3_220->w280082D4 & 0xF8000000);
					}
					word32 a5_1255;
					word32 a0_1254;
					ra = ble_co_list_push_back(ra_176, s0_177, s1_178, s1_178, s0_177, out s1_122, out a0_1254, out a5_1255);
					s7_116->b0048 = (byte) ((word32) s7_116->b0048 + 0x01);
				}
			}
		}
	}
	up32 a2_256 = (word32) s7_116->w004C;
	Eq_2 s0_257 = 0x01;
	if (a2_256 <= 0x01)
		s0_257 = ((word32) *((char *) *((char *) &g_t42026428 + s5_114 * 0x04) + 0x00A5) >> 2 ^ 1) & 0x01;
	if (s7_116->ptr0008 == null || s0_257 == 0x00)
	{
l2303066E:
		word32 a4_566;
		struct Eq_149677 * s5_542 = (char *) s5_114 + 92;
		struct Eq_149663 * a5_546 = s7_116->ptr0020;
		if (a5_546 != null)
		{
			do
			{
				struct Eq_149870 * a4_571 = (word32) a5_546->w0004;
				if ((word32) a4_571->w280082D4 >> 0x0F == 0x00)
				{
					a4_566 = (word32) (word16) ((char *) a4_571 + 724);
					goto l230306AC;
				}
				a5_546 = a5_546->ptr0000;
			} while (a5_546 != null);
			a4_566 = 0x00;
l230306AC:
			ui32 a3_587 = (word32) g_b230CB971;
			s5_542->w2800808E = (word16) ((a3_587 & 1) << 0x0A | (word32) s5_542->w2800808E & 0x1F | a3_587 << 0x08 & 0x0200 | a3_587 << 6 & 0x0100 | 0x0F000000);
		}
		else
		{
			ui32 a4_551 = (word32) g_b230CB970;
			s5_542->w2800808E = (word16) ((a4_551 & 1) << 0x0A | (word32) s5_542->w2800808E & 0x1F | a4_551 << 0x08 & 0x0200 | a4_551 << 6 & 0x0100 | 0x0F000000);
			a4_566 = 0x00;
		}
		s5_542->w280080A4 = (word16) a4_566;
		s0Out = s0_257;
		s1Out = dwLoc64;
		return dwLoc24;
	}
	else
	{
		Eq_2 ra_295;
		int32 * a0_290;
		if (a2_256 <= 0x01)
		{
			ra_295 = ble_co_list_size(ra, s0_257, 0x420262C8, out s0_257, out a0_290);
			struct Eq_149518 * s6_307 = s7_116->ptr0008;
			dwLoc64 = 0x42026000;
			int32 * s4_309 = a0_290;
			if (s6_307 != null)
			{
				ui32 s1_316 = (word32) *((char *) *((char *) &g_t42026428 + (word32) s7_116->w004C * 0x04) + 0x00A5);
				struct Eq_149518 * a3_317 = s6_307->ptr0000;
				s7_116->ptr0008 = a3_317;
				if (a3_317 == null)
					s7_116->ptr000C = null;
				int32 s1_323 = s1_316 << 2 & 0x04;
				ui32 a5_329 = s1_323 << 0x03;
				ui32 s3_331 = 0x00;
				while (true)
				{
					int32 a1_338 = (word32) s7_116->w0042;
					int32 s8_334 = (int32) s6_307->w0008;
					uint32 a3_343 = (word32) s7_116->w0040;
					int32 s9_346 = a1_338 & 0x00FF;
					if (a3_343 < ((s8_334 + 0x0A) + a5_329 << 19) >> 16)
					{
						int32 a3_352 = a3_343 - a5_329 + -80 >> 3;
						if (a1_338 - s1_323 >= (a3_352 & 0x00FF))
							s9_346 = a3_352 & 0x00FF;
						else
							s9_346 = (a1_338 & 0x00FF) - s1_323 & 0x00FF;
					}
					if (s9_346 < s8_334)
						s9_346 &= 0x00FE;
					ui32 s2_365 = (s8_334 + -1 ^ s9_346) + 0x01 & 0x00FF;
					if (s4_309 < (word32) ((word16) s2_365))
						break;
					word32 a5_386 = (word32) (word16) s9_346;
					Eq_2 a3_390 = s0_257;
					word32 s11_391 = 0x00;
					word32 s10_392 = 0x00;
					while (true)
					{
						struct Eq_149127 * a0_403;
						int32 s8_409;
						word32 a5_1257;
						word32 a1_1256;
						ra_295 = ble_co_list_pop_front(ra_295, s0_257, a5_386 + 712, out s0_257, out a0_403, out a1_1256, out a5_1257, out s8_409);
						if (a3_390 != 0x00)
						{
							ui32 a3_420 = (word32) s6_307->b000A;
							ui32 a3_422 = a3_420 & 0x03;
							if ((a3_420 & 0x03) != 0x01)
								a3_422 = 0x02;
							a0_403->b000A = (byte) a3_422;
							struct Eq_149914 * a3_428 = s6_307->ptr000C;
							s10_392 = (word32) a3_428->w0006;
							s11_391 = (word32) a3_428->w0004;
						}
						else
						{
							a0_403->b000A = 0x01;
							0x00 = dwArg74;
							s10_392 = (word32) (word16) (s10_392 + 0x01);
						}
						int32 a3_434 = s9_346;
						if (s9_346 >= s8_409)
							a3_434 = s8_409 & 0x00FF;
						0x00 = dwArg74;
						a0_403->b000B = (byte) a3_434;
						a0_403->t0006 = (word16) s11_391;
						a0_403->w0008 = (word16) s10_392;
						if ((int32) (word16) (s8_409 - 0x01) <= 0x00)
							break;
						lld_pdu_data_tx_push(s7_116, a0_403, 0x00, a3_434, out a5_386);
						a3_390.u0 = 0x00;
					}
					ui32 s3_496 = s3_331 + s2_365;
					word32 a5_481;
					a0_290 = lld_pdu_data_tx_push(s7_116, a0_403, 0x01, a3_434, out a5_481);
					s3_331 = s3_496 & 0x00FF;
					s4_309 = (word32) (word16) (dwArg74 - a5_481);
					if (s7_116->ptr0010 == null)
						s7_116->ptr0010 = s6_307;
					else
						s7_116->ptr0014->ptr0000 = s6_307;
					s7_116->ptr0014 = s6_307;
					s6_307->ptr0000 = null;
					a5_329 = 0x0A;
					if ((s3_496 & 0x00FF) > 0x0A)
						goto l2303066E;
					s6_307 = s7_116->ptr0008;
					if (s6_307 == null)
						goto l2303071C;
					struct Eq_149518 * a3_632 = s6_307->ptr0000;
					s7_116->ptr0008 = a3_632;
					if (a3_632 == null)
						s7_116->ptr000C = null;
				}
				struct Eq_149518 * a3_376 = s7_116->ptr0008;
				if (a3_376 == null)
					s7_116->ptr000C = s6_307;
				s6_307->ptr0000 = a3_376;
				s7_116->ptr0008 = s6_307;
				goto l2303066E;
			}
		}
		else
		{
			word32 s1_1251;
			ra_295 = ble_co_list_merge(ra, s0_257, s1_122, s1_122, &s7_116->ptr0008, out s1_1251, out a0_290);
		}
l2303071C:
		word32 a1_1253;
		word32 a0_1252;
		ble_co_list_init(ra_295, dwLoc2C, a0_290, out a0_1252, out a1_1253);
		s0_257 = dwLoc2C;
		goto l2303066E;
	}
}

